{"/wiki/Alakazam": "Alakazam is based on a magician and also a spoon bender. It also shares similarities to foxes, animals with ties to magic. Its head is in shape of Pentagram and makes it similar to goats which are symbols associated with occultism and magic. The horns, talons, and long mustache are also reminiscent of Chinese dragons, which similarly are considered miraculous beings.", "/wiki/Applin": "Applin appears to be based on the popular image of a worm burrowing into an apple; perhaps specifically the larvae of various moths, such as the geometer moth larvae (also known as the inchworm) and the codling moth larvae, who burrow into apples and feed on their cores, inhibiting growth and ripening them earlier. It may also be based on the mole lizard, which has two forelimbs and closely resembles an earthworm, but is actually a type of reptile related to snakes known as an amphisbaenia.", "/wiki/Anorith": "Anorith may be a combination of Anomalocaris, anorthosite, and -lith (suffix for rock or stone).", "/wiki/Azurill": "Ruriri may be derived from 瑠璃 ruri (lapis lazuli), a mineral that is deep blue in color.", "/wiki/Aurorus": "Similar to Tyrantrum being based on the imagery of kings, Aurorus may have also been based upon imagery of queens: the white, V-shaped mark with an ice crystal covering the top of its head, together with its sails, make the appearance of a tiara or a headdress worn by queens from medieval times; while the ice crystals and patterning on its body resemble a dress.", "/wiki/Abomasnow": "PAL:Abomasnow is a Grass- and Ice-type Pokémon said to live the quiet life in snowy mountains, but it's been known to mingle with humans too. It can whip up blizzards to attack anyone who strays too close, and it can throw a powerful Ice Punch either straight in front of back over its shoulder, so there's nowhere to hide!", "/wiki/Ariados": "Ariados may be named after Ariadne, a Cretan princess in Greek mythology associated with strings and mazes. In the myth, Ariadne gave Theseus a ball of twine before he entered the Labyrinth to slay the Minotaur, so that he may trail the strand behind him and find his route back to her. Ariados may also be a combination of arachnid (Latin for spider) and 脅す odosu (to threaten) or dos (Spanish for two, used possibly because it has two stingers, or because it is the second form in its evolutionary line).", "/wiki/Araquanid": "Araquanid appears to be based on the diving bell spider, a species that gathers air into a bubble and uses it to breathe underwater. Araquanid, however, reverses this by instead utilizing a bubble of water to breathe above the surface. Given its long, skinny legs, Araquanid may also take some influence from one of many species of sea spiders, while the color resembles reeds. The growths on its head may be inspired by the Hawaiian happy-face spider.", "/wiki/Arboliva": "Arboliva may be a combination of arbor or árbol (Spanish for tree), olive or oliva (olive in various Romance languages), and diva.", "/wiki/Axew": "PAL:No, that's not some delicious snack poking out either side of its mouth - those are tusks. Axew uses them to break through the hard outer shells of its favourite fruits and to carve territorial markings on trees. Occasionally, its tusks can break, but they just grow back stronger than before.", "/wiki/Arctovish": "Uochilldon may be a combination of 魚 uo (fish), chill, and -don (common suffix in dinosaur names derived from the Ancient Greek word for tooth).", "/wiki/Audino": "Tabunne may be derived from a pun of 多分ね tabun ne (maybe) or 多聞 tabun (hearing many things). It may also involve 耳朶 mimitabu (earlobe).", "/wiki/Aerodactyl": "Aerodactyl's design is mostly based on rhamphorhynchids, a family of toothed pterosaurs that lived in the Jurassic period. However, its pointed wings, spaded tail, and robust jaws also give it the resemblance of a dragon, specifically wyverns.", "/wiki/Arctozolt": "Patchilldon may be a combination of パチパチ pachipachi (onomatopoeia for crackling), chill, and -don (common suffix in dinosaur names derived from the Ancient Greek word for tooth).", "/wiki/Arcanine": "In its Hisuian Form, its Rock typing and appearance may be based on the komainu statues. Its ankle fur and tail resemble plumes of smoke.", "/wiki/Arceus": "From αρχή arkhē or alpha and deus or Zeus, and possibly arcane, aureus, arc, arcesso, and Archeus", "/wiki/Archen": "Archen is extinct but can be revived from fossils. It is believed to be the ancestor of all bird Pokémon, though recent research of this claim suggests otherwise. Its wings are small and cannot be used for flying; instead, Archen roost on trees, hop branch to branch, and glide through long distances to snatch prey. Archen is capable of jumping despite being unable to fly. In the anime, it was shown Archen does not like Pokémon food but can grow a special plant with its cries. It enjoys the Berries grown on this plant.", "/wiki/Abra": "Abra may be based on a mystic or psychic. It also has similarities to foxes, animals with ties to magic. Given the rat-like tail of its early sprites and the fact that it sleeps 18 hours a day, Abra could also draw inspiration from opossums. It also shares traits with cats, namely their feline appearances and the fact that they sleep for most of the day.", "/wiki/Archeops": "Archeops and Archeos may be derived from Archaeopteryx and -ops (common suffix in names of prehistoric animals derived from the Ancient Greek word for face). Archeops may also allude to Cheops, the Greek name for Egyptian pharaoh Khufu.", "/wiki/Aipom": "Aipom uses its powerful tail freely and cleverly for many purposes. The tail is strong enough to anchor Aipom to a branch and suspend the rest of its body in the air, but also delicate enough to pick fruit and manipulate objects. Aipom has been known to wrap its tail around tree branches as it sleeps so it does not fall. Since Aipom uses its tail so much, its actual arms are not as dexterous and become clumsy over time. Aipom lives high in the treetops of tropical, temperate, and even boreal forests, using its tail for balance as it swings from branch to branch. In Alola, Bounsweet is its favorite food.", "/wiki/Armarouge": "Gurenarma may be a combination of 紅蓮 guren (crimson) and arma or armadura.", "/wiki/Azelf": "Agnome may be a combination of A of the acronym UMA (Unidentified Mysterious Animal, wasei-eigo for cryptid) and gnome.", "/wiki/Ampharos": "Denryu may be derived from 電流 denryū (electric current), as well as forming a pun on 電竜 den ryū (electric dragon). It may also incorporate 電球 denkyū (light bulb), referring to its tail.", "/wiki/Ambipom": "Ambipom can leap from tree to tree with brilliant speed. To eat, it deftly shucks nuts with its two tails. As it has two hands on its tails, it rarely uses its arms. Ambipom works in large colonies in heavily wooded areas and makes rings by linking tails with another Ambipom, apparently in friendship. Ambipom has been seen giving rings even to humans sometimes. It also shows affection by using both of its tails to wrap and squeeze people. It lives along with its young, Aipom. It lives high in the treetops of tropical, temperate, and even boreal forests, using its tails for balance as it swings from branch to branch. In the Alolaregion, while searching for comfortable trees, Ambipom tend to get into territorial disputes with Passimian, in which they win half the time.", "/wiki/Absol": "From absolute or absolution, 危ない abunai, and 物騒 bussō, as well as ab- and sol", "/wiki/Avalugg": "Avalugg may be a combination of avalanche and lug (to carry or drag heavy objects, or a big/clumsy person).", "/wiki/Amaura": "The color-changing sails upon Amaura's head appear to be based on auroras, which are predominantly seen in polar regions and are most visible at night; these may also inspire Amaura's Ice-type and the fact that it can only evolve at night.", "/wiki/Alcremie": "Alcremie appears to be based on whipped cream, or eton mess, a British dessert made of fruit, meringue, and whipped cream. Its Gigantamax form may be based on a wedding cake.", "/wiki/Aggron": "Aggron is surprisingly protective of its environment. If its mountain is ravaged by a landslide or a fire, this Pokémon will haul topsoil to the area, plant trees, and beautifully restore its own territory.", "/wiki/Annihilape": "Konoyozaru may be a combination of この世を去る kono yo o saru (to leave this world; to die) and 猿 saru (monkey).", "/wiki/Aegislash": "Gillgard may be a combination of Gilgamesh or gild (to cover with a layer of gold), 斬る kiru (to slay with a blade) or kill, and guard.", "/wiki/Armaldo": "He later reappears in Pokémon Super Mystery Dungeon, where another Igglybuff requests the player to deliver a Tiny Reviver Seed to Armaldo. Upon delivery, Armaldo muses about another Igglybuff he knew that had become a respected guildmaster.", "/wiki/Alomomola": "Alomomola may be a combination of Mola mola (scientific name for the ocean sunfish) and mom. It may also involve aloha (Hawaiian for love).", "/wiki/Aromatisse": "Frefuwan may be a combination of fragrance or fresh and フワフワ fuwafuwa (light, airy, fluffy).", "/wiki/Appletun": "Tarupple may be a combination of tart, 怠い tarui (sluggish), たっぷり tappuri (onomatopoetic word for plenty), and apple.", "/wiki/Arbok": "This Pokémon is terrifically strong in order to constrict things with its body. It can even flatten steel oil drums. Once Arbok wraps its body around its foe, escaping its crunching embrace is impossible.", "/wiki/Accelgor": "It is a very fast Pokémon and attacks in ways similar to ninjas. In Generation VIII, Water Shuriken was its signature move. It lives in moist habitats like bogs and swamps. Accelgor is often featured as a main character in movies or comics to increase the popularity of these products. Accelgor's pouting expression and crossed arms are due to it being miserable over having lost its shell.[1]", "/wiki/Amoonguss": "Amoonguss may draw inspiration from Amanita muscaria or mushrooms of the Agaricus genus. Like Voltorb and its evolved form, the idea of them being mistaken for the standard Item Balls is similar to a mimic, a monster archetype commonly found in RPGs.", "/wiki/Arctibax": "Arctibax may be based on the Spinosaurus or the Concavenator — fossils of the latter were first discovered in Spain, and it had a crest on its back and quills on its forelimbs, the former of which is hypothesized to have functioned as a tool of thermoregulation. It may also be based on other sail-backed prehistoric animals, most notably Ouranosaurus, Arizonasaurus, or Dimetrodon.", "/wiki/Articuno": "Articuno may be a combination of arctic (northern polar region) and uno (Spanish for one, indicating that it is the first of the KantoLegendary birds).", "/wiki/Altaria": "From チルット Tyltto, Mytyl and Tyltyl, cockatrice, and possibly チル chiru or Tyl and Altais", "/wiki/Azumarill": "Marilli may be a combination of 丸い marui (round or circular) or 鞠 mari (ball), 瑠璃 ruri (lapis lazuli), and possibly rill (a small river or brook) and マリンブルー marine blue.", "/wiki/Arrokuda": "Arrokuda can only swim in a straight line. Should Arrokuda see any movement near it, it will charge ahead using its sharp pointed jaws; however, its poor eyesight causes it to miss frequently. Its movements also tend to become sluggish when it eats too much, which is typically when Cramorant and Wattrel appear to swallow it up.", "/wiki/Aron": "Aron seems to be based on the Bulgasari, a monster that eats iron in Korean legend, and a dinosaur from the family Nodosauridae. As its Pokémon category suggests, its appearance may also be inspired by plate armours.", "/wiki/Bewear": "Kiteruguma may be a combination of 着てる kiteru (wearing), 着ぐるみ kigurumi (costume), and 熊 kuma (bear).", "/wiki/Beldum": "Even though Beldum is mechanical, it still has emotions, the need to eat, and a way of reproducing. Beldum's body lacks blood, and is instead made of cells that are all magnets. It uses magnetism to move, communicate, and control its attacks. Beldum sometimes gathers in swarms, communicating with each other telepathically and magnetically and moving in sync. When enraged, it can cause nearby machines to break from its strong magnetism. Beldum can also use its magnetic force to rapidly pull in enemies and then use its sharp claws to harm them. Beldum is scarce in the wild, but it does tend to inhabit areas with rugged terrain. It anchors itself to a cliff using its hooks when it sleeps.", "/wiki/Beedrill": "In Pokémon Conquest, Beedrill is the only Pokémon that is featured without its evolutionary relatives.", "/wiki/Bunnelby": "Three Bunnelby appeared in Mind-Boggling Dynamax!, with two under the ownership of different Trainers and the third being wild. The Trainers' Bunnelby were seen on the train heading to the Wild Area, while the wild one was among the Pokémon seen in the Wild Area.", "/wiki/Brambleghast": "Anohoragusa may be derived from the phrase あのほら草 ano hora kusa (\"Um... Look! Grass\") and horror.", "/wiki/Bruxish": "↑@JamesTurner_42 on Twitter: \"Well spotted...the concept of Bruxish was by a different artist in Game Freak, but I was asked to finalize the design and draw the reference sheet...\" (Posted on January 10, 2018).", "/wiki/Burmy": "Burmy may be a combination of bag or bug and worm, with a diminutive -y.", "/wiki/Bastiodon": "Torideps may be a combination of 砦 toride (fortress) and Triceratops or -ops (common suffix in dinosaur names derived from the Ancient Greek word for face).", "/wiki/Baxcalibur": "Baxcalibur may draw inspiration from kaiju. Its upright posture may allude to how most kaiju are humanoid in shape, due to the need to fit a human actor inside the creature suit in kaiju films. It also has traits of certain species of dinosaurs, most notably Concavenator, a theropod dinosaur which had a crest on its back and quills on its forelimbs. Fossils of the genus were first discovered in Spain, and the crest is hypothesized to have functioned as a tool of thermoregulation.", "/wiki/Blipbug": "Sacchimushi may be a combination of 察知 satchi (sense), search, and 虫 mushi (bug).", "/wiki/Breloom": "Kinogassa may be a combination of 茸 kinoko (mushroom) and 笠 kasa (traditional Japanese hat) or 傘 kasa (umbrella). It may be derived from 衣笠茸 kinugasatake (bamboo mushroom).", "/wiki/Blaziken": "Its Fighting type may also draw inspiration from Muay Thai fighters, since Blaziken's official artwork depicts a typical flying knee and Mega Blaziken's stance portrays a check.", "/wiki/Barbaracle": "Barbaracle seems to be based on the goose barnacle, due to their general shape and use of a connective \"stalk\" to cling to rocks. Considering one \"main\" Barbaracle survives together with others, it may possibly reference to the rarer, same species symbiosis, in particular conjunctive symbiosis due to their fusion into a single body. Considering its hand-like limbs and bodies, and its eyes within its many hands' \"palms\", it may have also been based on the hamsa. Its limbs having minds of their own may be a reference to alien hand syndrome.", "/wiki/Buneary": "\"A Rabbit Pokémon. It rolls up its long ears, then unrolls them with great force to slap enemies. This attack stings enough to make adults jump. It uses its ears not only to attack, but also to sense danger--they stand straight up when it senses a threat. Its fluffy fur lets it sleep in warmth and comfort on cold nights. When it levels up, it evolves into Lopunny.\"", "/wiki/Baltoy": "In Bucking the Treasure Trend!, a Baltoy is Buck's main Pokémon and partner in treasure-hunting. It has the ability to sense when treasure is near and would indicate this to Buck by spinning. Baltoy was also a very powerful battler, as it was able to defeat the Claydol that was guarding the treasure hidden near Lily of the Valley Island.", "/wiki/Bayleef": "Bayleef's \"necklace\" is consistently described as having a spicy aroma, while real bay leaves have a bitter and herbal taste, which is similar to thyme.", "/wiki/Bellossom": "Bellossom seems to be based on a stereotypical hula dancer. The leaves encircling its body resemble a grass skirt, which was popularized in Hawaii through tourism. The flowers adorning its head resemble both plumeria in concept, which are commonly worn in the hair and used to make leis, and Rafflesia keithii in shape, which relates to its pre-evolved form Gloom. It is also reminiscent of a bell due to its body shape and the ringing sound it produces as described in its Pokédex entries.", "/wiki/Blastoise": "Blastoise's design appears to be a turtle mixed with aspects of a tank. Blastoise's cannons may have been derived from the functioning tubes found in mussels and some other shellfish, thus its category.", "/wiki/Binacle": "Kametete may be a combination of 亀の手 kame-no-te (Japanese goose barnacle), tête (French for head), and 手 te (hand).", "/wiki/Bounsweet": "While fleeing danger, Bounsweet skips along in a way that does not convey its desperation. As a result, no one ever comes to help it. It has been known to drive away enemies by rotating its calyx, but it becomes dizzy afterward.[1]", "/wiki/Beartic": "Tunbear may be a combination of tundra, 氷柱 tsurara (icicle), and bear.", "/wiki/Bidoof": "Pokémon Mystery Dungeon: Explorers of Sky: Bidoof stars in his own special episode, being the playable character. When Bidoof left home and first joined Wigglytuff's Guild, he often messed jobs up and wasn't really liked by anyone. One day, whilst visiting the Kecleon Shop, he was approached by a Snover who gave him an old map before hurrying off. A Gligar and Bagon then appeared to be chasing Snover. The map showed a legendary dungeon known as the Star Cave where Jirachi sleeps, and after learning about it from Chatot, Bidoof decided to go there and wish to make himself a stronger explorer. Snover finds Bidoof at the Guild, and together they go to the Star Cave. However, upon reaching the end, Gligar and Bagon appeared, and Snover turned against Bidoof. It turns out that it was a trap, and Snover, Bagon and Gligar are a gang of thieves called Team Rogue. They saw Bidoof's money when he visited the Kecleon shop, so they lured Bidoof to the Wish Cave, hoping to steal his money. Bidoof fights the three, but fails. Before Team Rogue can steal Bidoof's money, the entire Guild shows up to help him. Bidoof is touched that he is an appreciated member of the Guild after all. Wigglytuff helps him blast open a hidden cave where Bidoof can find Jirachi. He finds Jirachi sleeping. It talks in its sleep, warning Bidoof that it attacks in its sleep. Bidoof must defeat it to help it awaken. Bidoof makes his wish and, though given a lot of choices, Bidoof wishes for new juniors to join the Guild so he could help them. The wish is fulfilled when the player and their partner join the Guild, thus ending the story.", "/wiki/Bronzor": "Dohmirror may be a combination of 銅鏡 dōkyō (bronze mirror) and mirror.", "/wiki/Barboach": "Barboach may be a combination of barb or barbel (whiskerlike sensory organ in a catfish) and loach.", "/wiki/Bouffalant": "In the prologue of White—Victini and Zekrom, multiple Bouffalant were startled by the arrival of a dust storm and began to stampede towards Luisa's village. However, the nearby Damon summoned Reshiram to easily destroy the dust storm, thus placating the Bouffalant in time. In Black—Victini and Reshiram, this flashback instead occurred midway through the movie and involved Damon using Zekrom to destroy the dust storm and stop the stampeding Bouffalant.", "/wiki/Bronzong": "Additionally, Bronzong's facial features resemble those of the Mesoamerican rain god Tlāloc, who is often depicted as being predominantly cyan in color. In Mexico City, which is located on the site of the former capital of the Aztec Empire, artifacts are often discovered during construction-related excavation, which Bronzong's Pokédex entry in Pokémon Diamond may reference.", "/wiki/Buizel": "In Pikachu's Island Adventure, a Buizel, six Wynaut, and two Pichu were forced off their island by Meowth and his cronies, who claimed the island for themselves. As a result, Pikachu and his friends agreed to help them reclaim the island.", "/wiki/Braixen": "Braixen's evolutionary family is based on a fox,[2] specifically resembling the fennec fox. It also shares characteristics with kitsune and kitsune-mochi, witches in Japanese folklore that inherit their powers from foxes. Braixen's use of a wand-like branch is likely derived from mages. When the stick is stored in the fur of its tail, the entire tail resembles a broom, which has been depicted as a witch's primary means of transport. As drawing the stick from its tail ignites the stick, this may be a reference to striking a matchstick.", "/wiki/Blacephalon": "Blacephalon debuted in Twirling with a Bang!. Ash and his classmates first encountered it performing during a fireworks show. The next day, they learned that it was an Ultra Beast and set out as the Ultra Guardians to capture it. However, they also ran into a Xurkitree while trying to find it, and soon, the two Ultra Beasts ended up in a performance showdown, each trying to outperform the other with their moves. Thanks to a distraction from the Ultra Guardians, they were able to distract, weaken, and subsequently capture the two Ultra Beasts at the same time, allowing them to be returned home wherever they come from. It reappeared in a flashback in Securing the Future!.", "/wiki/Bagon": "Bagon harbors a never-ending dream of one day soaring high among the clouds. As if trying to dispel its frustration over its inability to fly, this Pokémon slams its hard head against huge rocks and shatters them into pebbles.", "/wiki/Brionne": "As Brionne dances, it creates water balloons in a variety of colors. Its battle strategy consists of dancing while creating water balloons. The dance confuses the opponent, and during this weakness, Brionne slaps the balloons toward the target where they explode. Only those who have earned its trust can see this Pokémon when it is sad. It will otherwise always act cheerful and never allow its sorrow to show.[1]", "/wiki/Budew": "Budew keeps its buds closed during the cold winter, but opens them again in the spring and releases poisonous pollen. The pollen it scatters induces harsh sneezing and runny noses, and is more toxic depending on how clean the water it was fed with was. Budew's bud beginning to open is seen as the imminent arrival of spring. It lives near clean pools and ponds.", "/wiki/Bulbasaur": "From 不思議 fushigi and 種 tane, as well as a pun of 不思議だね Fushigi, da ne?", "/wiki/Bellibolt": "Harabarie may be a combination of 腹 hara (belly) and バリバリ baribari (onomatopoeia for crackling).", "/wiki/Basculegion": "Idaitou may be a combination of 偉大idai (great), 哀悼aitou (mourning), and イトウitou (Sakhalin taimen).", "/wiki/Blissey": "Happinas may be a combination of happiness and nurse. It may also involve 茄子 nasu (eggplant), referring to the egg theme of this evolutionary line.", "/wiki/Banette": "Banette seems to be based on the idea of a haunted doll, while its Pokédex backstory of an ordinary doll coming to life is similar to the tsukumogami, an idea rooted in Shinto's animism. Its appearance and habit of sticking itself with pins is also a reference to the popular concept of a voodoo doll.", "/wiki/Barraskewda": "Barraskewda's jaws are said to be as sharp as a spear and strong like steel. It propels itself up to speeds of 100 knots by spinning its tail, and uses that speed to ram into its prey, spearing it. It is able to leap out of the water and catch Wingull flying near the surface with its jaws. It is also known to compete with Finizen for food. The flesh of Barraskewda is surprisingly tasty.", "/wiki/Bombirdier": "Otoshidori may be a combination of 落とし otoshi (to drop) and 鳥 tori (bird).", "/wiki/Bramblin": "Bramblin may be a combination of bramble and rambling, goblin, or gremlin.", "/wiki/Beautifly": "Beautifly has a long and curled black proboscis that it uses to gather pollen and nectar — its favorite food — from flowers. Its diet also includes water, fruit juices, and bodily fluids from its prey, all of which it sucks up with its proboscis. Despite its appearance, Beautifly is known to be aggressive and greedy; it will jab at foes with its proboscis if it is disturbed while collecting pollen. The preferred habitats of a Beautifly are forests, where it rides the spring winds while searching for pollen. It competes with Combee for nectar.", "/wiki/Bibarel": "In Bibarel Gnaws Best!, the expert stonecutter owns a Bibarel, which was being taken care of and trained by Isis for the majority of the episode. She encountered problems when Bibarel refused to help build a bridge. Unbeknownst to her, this was because Bibarel knew the bridge was structurally unstable.", "/wiki/Braviary": "Warrgle may be a combination of war or warrior and eagle. It may also involve warble, a sound a bird makes.", "/wiki/Brute_Bonnet": "In an article from a June issue of Occulture magazine, it is described as a bizarre creature combining traits of dinosaurs with those of Amoonguss. It's named after a fierce mushroom creature of matching description that appears in the Scarlet Book. Its gigantic stature and seemingly low intelligence combine to make it a powerful and savage fighter.", "/wiki/Boldore": "Boldore's crystals shine brightly when it begins overflowing with power or when it is preparing to fire bursts of energy. Because its crystals are valuable, with a fragment being capable of powering a hundred dump trucks, Boldore is targeted for them. It searches for underground water in the caves where it lives; however, because it is uncomfortable around water, it is always very careful about lapping it up. A healthy Boldore will always have its core sticking out. Due to relying on sound to know what is nearby, it always faces the same way, never moving in a diagonal direction; even when brought to anger, it will attack while facing in its initial direction.", "/wiki/Blitzle": "Blitzle is a black, zebra-like Pokémon with thick, double-pointed white stripes on its neck, chest, back, and hind legs. It has a rounded muzzle with a large, dark nose and oval, blue eyes with yellow sclerae. On top of its head are short, triangular ears with blue insides. Below the knees, its legs are white with black hooves. Its tail is stubby, white, and has two points. Running up its neck is a spiky, white mane, which culminates at the front in a long extension that resembles a lightning bolt. This mane captures and stores electricity, which flashes whenever this Pokémon discharges energy. It communicates with other members of its species by controlling the rhythm and frequency of these flashes. During lightning storms, Blitzle ventures out to recharge its mane with lightning bolts.", "/wiki/Bergmite": "Bergmite can create cold air, which is used to repair cracks in its icy coating. This air reaches temperatures as cold as −150 degrees Fahrenheit (−100 degrees Celsius) and can be used to freeze enemies. Bergmite lives in herds on snowy mountain tops and can sometimes be found huddled on the back of an Avalugg, freezing itself in place as the Avalugg carries it to new habitats. Bergmite quarrels with Frigibax whenever they encounter each other.", "/wiki/Basculin": "The selection of colored forms being red, white, and blue may reference the national flag of the USA, where Unova, the region Basculin was first introduced, is based.", "/wiki/Beheeyem": "Ohbem may be a combination of 大 ō (large) and BEM (pronounced as a single word in Japanese).", "/wiki/Butterfree": "Butterfree can be seen as a parallel to Beedrill. Both of their unevolved stages evolve at level 7 and again at level 10. They both go through metamorphosis-like evolution and have the same base stat total of 395. Also, while Beedrill is exclusive to Black and Black 2, Butterfree is exclusive to White and White 2. Both also have an alternate form only available in-battle (Gigantamax Butterfree and Mega Beedrill, respectively).", "/wiki/Boltund": "Boltund can channel the electricity that it generates to its legs in order to keep them strong, boosting its strength and allowing it to run nonstop for three full days. It can easily run faster than 50 mph at top speed. It serves as the enemy of Thievul.", "/wiki/Bonsly": "Bonsly seems to be based on a bonsai tree (miniature trees grown inside small pots) and petrified wood (plants that have become fossilized over time). This would explain its pure Rock type since all of the organic material in petrified wood is replaced with minerals. It is also reminiscent of a toddler since its flowerpot resembles a diaper and it tends to cry a lot. It may also be based on the concept of mimicry.", "/wiki/Bisharp": "Kirikizan may be a combination of 切り刻む kirikizamu (to mince) and 斬 zan (to cut or slay).", "/wiki/Bellsprout": "A sextet of Bellsprout was seen in Bellsprout Rout, during Gold's visit to Sprout Tower. Gold was attacked by the monks and their Bellsprout in an attempt to convince him to join their group. The excellent teamwork of the Bellsprout managed to make short work of Gold's Aipom, only to lose to Gold's Cyndaquil when it incinerated them from below.", "/wiki/Buzzwole": "Massivoon may be a combination of massive and 蚊 bun (mosquito) or ブーン būn (buzz).", "/wiki/Corviknight": "Corviknight may be based on a raven, a carrion crow, or the western jackdaw; all three are corvids commonly found in Great Britain. Its overall appearance may be based on black knight characters from medieval settings. It may also draw inspiration from the Ravens of the Tower of London, a group of at least six ravens kept at the Tower of London, who are believed to protect the Crown and the Tower.", "/wiki/Camerupt": "Camerupt's evolutionary family can be seen as a parallel to Sharpedo's family. Both of them are dual-type Pokémon, both lines have identical base stat totals per evolutionary stage, both of their final evolved forms are used by Team Magma Leader Maxie and Team Aqua Leader Archie, respectively, and both of their final evolved forms can Mega Evolve.", "/wiki/Cyclizar": "Mototokage may be a combination of moto (Spanish, Italian and Portuguese for motorcycle) and 蜥蜴 tokage (lizard).", "/wiki/Clamperl": "Clamperl debuted in Clamperl of Wisdom as a resident of Maisie Island. Spoink lost its pearl and took a blue pearl that was created by a Clamperl from Isaiah's lab, thus causing conflict with the Bivalve Pokémon. Team Rocket also wanted to get their hands on the blue pearl.", "/wiki/Cosmoem": "Cosmoem may be a combination of cosmo, ovum (Latin for egg), and embryo.", "/wiki/Cobalion": "Cobalion and Cobalon may be combinations of cobalt (referring to the metal and the color of cobalt blue) and stallion or champion.", "/wiki/Clawitzer": "Clawitzer appears to be based on a pistol shrimp, with its oversized claw and its ability to expel powerful blasts of water from its claw. Its deep blue coloration may be based upon Procambarus alleni, though it may also be a reference to mutated American lobsters. Its curved body is often seen in real-world shrimps and prawns, typically when moulting or cleaning.", "/wiki/Carnivine": "This Pokémon shares its name, possibly by coincidence, with a monster from the Dragon Quest series.", "/wiki/Conkeldurr": "Roubushin may be a combination of 老 rō (old) and 武神 bushin (warlord) or 普請 fushin (construction work/public work).", "/wiki/Crustle": "It is very strong, to the point that it can carry heavy rocks for a long time, even through arid lands where it resides. It fights members of its species over territory in battles which can become very vicious. If its shell breaks during such a fight, it loses. When Crustle's shell breaks, it will become weaker and unsure of itself. Crustle's biggest strength is its thick claws; being strong enough to break even Rhyperior's sturdy carapace.", "/wiki/Cranidos": "A Cranidos is owned by Roark, which he sends out against Platinum in her Gym match. He seems to be one of the first Pokémon that he owned, having been hatched from an Egg long ago. He later evolved to Rampardos around the three Sinnoh Trainers' arrival on Canalave City. He first appeared in Putting a Crimp in Kricketot.", "/wiki/Cascoon": "Cascoon is the only Pokémon found in a Friend Safari that is not its own type; it is found in the Poison-type Friend Safari even though Cascoon is pure Bug. However, it evolves into the Poison-type Dustox.", "/wiki/Cryogonal": "Cryogonal may be a combination of cryo- (prefix for icy cold) and hexagonal.", "/wiki/Chikorita": "Chikorita is the only starter Pokémon that cannot be used in the Pokémon Jump minigame.", "/wiki/Chatot": "Chatot is the only Pokémon that is not Legendary or Mythical (excluding Phione, whose Mythical status is disputed) to be banned from Generation V's Global Battle Union. This is likely due to Chatot's signature moveChatter and its ability to play pre-recorded audio, which can be abused to play vulgar words and phrases. This vulnerability is also presumably the reason for the move's ability to play pre-recorded audio being removed starting with Generation VI.", "/wiki/Chi-Yu": "Yiyui may be a combination of 魚 / 鱼 yú (Chinese for fish) and 玉 yù (Chinese for jade). Both /i/ and /ui/ are common approximates of the close front rounded vowel (represented as -ü- or yu- in pinyin, pronounced like French u or German ü) in languages where the vowel is not present.", "/wiki/Cottonee": "Cottonee may be derived from cotton, cottony, cottonweed, and possibly wee (small).", "/wiki/Carvanha": "Carvanha's evolutionary line may be considered a counterpart of Numel's evolutionary line. Both of them are dual-type Pokémon, both lines have identical base stat totals per evolutionary stage, both of their final evolutions are used by Team Aqua Leader Archie and Team Magma Leader Maxie, respectively, and both of their final evolutions can Mega Evolve.", "/wiki/Chimecho": "Pokémon Super Mystery Dungeon: The same Chimecho later returns as a recruitable character and will request the player to make a delivery to Diglett. Upon completion, the pair will connect with the player and will be usable.", "/wiki/Cresselia": "Cresselia may be a combination of crescent (referring to the lunar phase) and Selene (Greek goddess of the Moon).", "/wiki/Ceruledge": "Soublades may be a combination of 蒼 sō (azure) or soul and blades. It may also involve blaze or レイス reisu (wraith).", "/wiki/Capsakid": "Capsakid may be a combination of capsaicin (active component of chili peppers), kappa, and kid.", "/wiki/Corsola": "Corsola may be a combination of coral and sole (a piece of coral) or solar.", "/wiki/Cradily": "Yuradle may be a combination of 百合 yuri (lily), 揺り籠 yurikago (cradle), and cradle.", "/wiki/Calyrex": "Calyrex may be a combination of calyx (Latin for bud) and rex (Latin for king) or carex. It may also incorporate cavalry, referring to its ability to mount Glastrier or Spectrier.", "/wiki/Clauncher": "Clauncher's large claw gives it a poor sense of balance and makes it difficult to swim straight. Instead, it moves by firing compressed water from this claw. This is achieved through controlled expulsions of internal gas. Additionally, it uses this ability to shoot down flying prey and can shatter rock at close range. Occasionally, its claws will fall off, causing it to go into hiding until they grow back. The meat inside its claws is said to be delicious; however, it has a characteristic taste that is not universally loved. Clauncher's claws are a popular delicacy in places like Galar and Paldea. Dreepy is known to bite on Clauncher, although it does not actually feed on them; this is said to be a behavior carried over from when it was alive.", "/wiki/Cufant": "Zoudou may be a combination of 象 zō (elephant) and 銅 dō (copper) or 童 dō (child). It may also reference 銅像 dōzō (bronze statue).", "/wiki/Cubchoo": "When White was trapped in the Rondez-View Ferris Wheel by N in Gigi's Choice, and forced to challenge his point of view, she told of how her Pokémon Musical idea was inspired by an event in her past, in which a Cubchoo joined the dancers on stage during a theater performance she saw.", "/wiki/Coalossal": "As Gigantamax Coalossal, it becomes considerably larger, and the mountain of coal expands, with three red clouds surrounding its summit. Its physique is largely similar to its original form, but the spikes on its shoulders have split into two each, and its front now features three open spots, which expose intense heat radiating from its body, and it resembles a stove oven. Its fire can burn even hotter than 3,600 degrees Fahrenheit (2,000 degrees Celsius), and its shoulders' temperature is over 2,000 Kelvin.[1] Gigantamax Coalossal once served as a massive heat stove when Galar was struck by a harsh cold wave, saving many people in doing so.", "/wiki/Corvisquire": "Corvisquire's brain is large relative to those of other bird Pokémon, which is thought to be the reason behind its high intelligence level. Corvisquire are intelligent enough to use tools in battle, having been seen to throw rocks at their opponents or use vines to entangle them. Over the course of many tough battles, they learn to assess the strength of prospective opponents before engaging them. Corvisquire preys on Steenee.", "/wiki/Comfey": "Comfey appears to be a living lei, which are widely associated with Hawaiian culture, the design origin of the Alola region. Some of its Pokédex entries seem to be references to aromatherapy and perhaps herbal medicine.", "/wiki/Centiskorch": "Centiskorch appears to be based on radiator coils and centipedes like Orphnaeus brevilabiatus, also known as fire centipede due to its bioluminescence. It may also be inspired by millipedes with the same ability, like the Sierra luminous millipedes. Additionally, it might also be based on the Ōmukade, a colossal centipede of Japanese myth, with the creature's legs described as resembling thousands of torches. The circular heat-generating organs on its body segments resemble stove burners, while its fire \"mustache\" could be inspired by Kabuto, a style of Japanese helmet.", "/wiki/Cursola": "Cursola appears to be based on bleached coral, a phenomenon in which coral expels the algae that gives it color, primarily because of rising water temperatures as a result of climate change. Its Ghost type refers to the high mortality rate of bleached coral. Additionally, its appearance and ability to petrify, along with its name in various languages, may reference the Gorgon of Greek mythology. It may also borrow shapes from skeletons. The ectoplasmic encasing that it periodically sheds may draw inspiration from the mucus houses of larvaceans.", "/wiki/Carkol": "Carkol forms coal and coal tar inside of its body. Although it frequently drops its coal, the heap on Carkol's back never falls apart completely even when it travels at high speeds, due to the tar binding it together. People in the Galarregion once used Carkol's coal to fuel their lives. Carkol can move faster than 18 mph (30 km/h), and can breathe flames hotter than 1,800 degrees Fahrenheit (1,000 degrees Celsius). When Carkol experiences strong emotions, the temperature inside its body increases. In Generation IX, Heat Crash is its signature move.", "/wiki/Cleffa": "Cleffa may be a combination of clef (musical symbol) and the first two letters of fairy or fable.", "/wiki/Cinccino": "Cinccino and its pre-evolved form were designed by Atsuko Nishida, and almost no changes were made to her original designs. They were intended to be parallels of Kanto's Clefairy and Clefable; Pokémon that everyone would think was cute. Nishida was hired specifically for her reputation in Game Freak for her skill in designing cute characters.[1]", "/wiki/Cubone": "Karakara may be derived from カラカラ karakara (onomatopoeia for light clattering), contrasting with the ガラガラ garagara (onomatopoeia for heavy clattering) in Marowak's Japanese name.", "/wiki/Cacturne": "Cacturne and Noctus may be a combination of cactus and nocturne (French for nocturnal).", "/wiki/Cofagrigus": "Desukarn may be a combination of death and 棺 kan (coffin). It may also be a pun on です か desu ka, a form used at the at the end of an interrogative sentence which can be translated as \"Is it?\".", "/wiki/Charcadet": "Carbou may be a combination of carbón (Spanish for charcoal) and 坊 bō (boy).", "/wiki/Clefairy": "Clefairy seems to be based on fairies and pixies since it is a playful, magical, humanoid creature with wings. It may also be inspired by the concept of extraterrestrial life due to its rumored celestial origins and vaguely star-shaped body. It may also reference the mythical Moon rabbit due to its large ears, various Moon related powers, and the fact that it evolves into Clefable using a Moon Stone.", "/wiki/Chesnaught": "Chesnaught seems to be based on a hedgehog combined with a matured chestnut. It may also draw inspiration from \"armored\" mammals such as pangolins, armadillos, and glyptodonts. Its bulky \"armor\" is possibly a reference to split apart calybium and cupule, which are parts that protect the nuts of chestnut trees which split apart when sufficiently ripened. It is also based on knights and various types of body armor, including brigandines, barbutes, and modern bomb suits. Chesnaught and its pre-evolutions may also draw inspiration from the fighter or warrior character class in role-playing games, which specializes in physical combat and generally has high defense, while lacking in magical capabilities.", "/wiki/Crobat": "Crobat may be a combination of cross and bat. It may also involve acrobat (referring to its agility in the air).", "/wiki/Crocalor": "Achigator may be a combination of あちち achichi (\"Hot!\"), mariachi, and alligator.", "/wiki/Cetitan": "Hulkujira may be a combination of hulk, 歩く aruku (to walk), and 鯨 kujira (whale). It may be a pun on 歯鯨 hakujira (toothed whale).", "/wiki/Carracosta": "Abagoura may be a combination of 暴れる abareru (to thrash or act violently) or 肋 abara (rib cage) and 甲羅 kōra (shell).", "/wiki/Cyndaquil": "Hinoarashi may be a combination of 火 hi (fire) and ヤマアラシ (山荒) yama-arashi (porcupine). It can be taken to mean 火の嵐 hi no arashi (storm of fire).", "/wiki/Cramorant": "Uu may be a combination of ウッ u~ (sound of choking or gasping) and 鵜 u (cormorant).", "/wiki/Chimchar": "\"A Chimp Pokémon. With a flaming tail, Chimchar is skilled in Fire-type moves. Its light body affords it the ability to scale steep cliffs and live atop rocky mountains. Some say that the fiery tail is fueled by gas made in its stomach. Not even rain can put out the flames, but Chimchar always puts out the fire when asleep. Chimchar evolves into Monferno.\"", "/wiki/Chespin": "Harimaron may be a combination of 蝟 harinezumi (hedgehog), 針 hari (needle), and marron (French for chestnut).", "/wiki/Cacnea": "Cacnea has no Egg Moves in Generation IX, even though most of the ones it had previously would still be able to be inherited by it otherwise (due to both a possible parent and the move itself being present in the game). It is unknown if this is intentional.", "/wiki/Croagunk": "Gureggru may be a combination of グレる gureru (to turn delinquent) and げろげろ gerogero (onomatopoeia for a frog's croaking; exclamation of disgust).", "/wiki/Castform": "Powalen may be a combination of ポワン powan (onomatopoeia of a sudden transformation, similar to \"poof\" in English) and 変わる kawaru (to change or transform).", "/wiki/Clefable": "Clefable seems to be based on fairies and pixies since it is a playful, magical, humanoid creature with wings. It may also be inspired by the concept of extraterrestrial life due to its rumored celestial origins and vaguely star-shaped body. It may also reference the mythical Moon rabbit due to its large ears, various Moon related powers, and the fact that it evolves from Clefairy using a Moon Stone.", "/wiki/Cosmog": "Cosmog is the lightestPsychic-type Pokémon, the lightest Legendary Pokémon, and tied for the lightest Pokémon. Its evolution, Cosmoem, is the heaviest or joint-heaviest (joint with Celesteela for heaviest Pokémon) in all these categories, making it the only evolution line to hit both extremes of any measurement or stat.", "/wiki/Celesteela": "Celesteela may be a combination of celestial, steel, and stella (Latin and Italian for star).", "/wiki/Chansey": "Chansey's tendency to carry eggs in a pouch is very reminiscent of a monotreme or marsupial, but it may also simply be based on a general concept of females and motherhood. As the Pokédex mentions its frequent laying of nutritious eggs, Chansey may also be based on chickens or other poultry, and its \"ears\" give it the semblance of an axolotl.", "/wiki/Cetoddle": "Arukujira may be a combination of 歩く aruku (to walk) and 鯨 kujira (whale).", "/wiki/Corphish": "A hardy creature, Corphish is able to live in polluted water and eat nearly anything. Though not native to Alola, Corphish set free by Trainers there have easily adapted and thrived in the region. Feebas and Corphish are the only Pokémon known to be able to live in stagnant ditches. Corphish and its evolved form Crawdaunt are the only known Pokémon that do not flee when a swarm of Basculin appears in the lake it lives in.", "/wiki/Combusken": "Sapphire's Torchic evolved into a Combusken before her challenge of Brawly in Mashing Makuhita, and won against his Hariyama even after her partner Rono had nearly collapsed. After undergoing much training and being used in fights against the likes of Team Aqua and in friendly bouts against Flannery, she evolved again to a Blaziken battling Winona, though she failed to win.", "/wiki/Cinderace": "Gigantamax Cinderace is the only known Pokémon capable of using the G-Max MoveG-Max Fireball; using its well-honed techniques and fighting spirit, it can make its fireball chase after opponents almost like it had a mind of its own, and thus this attack will never miss. Gigantamax Cinderace is said to have the strongest leg strength of any Pokémon. Without its giant Pyro Ball, it can still overwhelm even a Dynamax Pokémon by delivering powerful kicking moves.[2]", "/wiki/Copperajah": "Copperajah may be a combination of copper and Maharajah (Indian title of great king). It may also incorporate gajah (Indonesian and Malay for elephant), which in turn is derived from गज gaja (Sanskrit for elephant).", "/wiki/Clobbopus": "Tatakko may be a combination of 叩く tataku (to strike), 戦い tatakai (fight, battle), attack, 蛸 tako (octopus), and possibly 子 ko (child, referring to its childish mentality). It could also be a pun on 駄々っ子 dadakko (spoiled child), which is the name of its category in Japanese.", "/wiki/Charjabug": "Charjabug appears to be based on a cocooned bug and a battery. It may also be based on the denkimushi, a caterpillar in Japan that, when touched, can give a sting that is said to feel like an electric shock. In addition, it bears a resemblance to subway cars, which are typically powered by electricity and reflect its habit of living underground. It may be also based on a two-pronged electrical plug or nine-volt battery.", "/wiki/Crabrawler": "Makenkani may be a combination of 負けん気 makenki (hates to lose, competitive spirit), 喧嘩 kenka (fight), and 蟹 kani (crab).", "/wiki/Clodsire": "Clodsire may be a combination of clod (lump of earth), sire or Siren (a genus of salamander), and Quagsire.", "/wiki/Cloyster": "Lorelei owns a Cloyster that she uses as one of her main Pokémon alongside her Dewgong. It first appeared in Cloystered.", "/wiki/Carbink": "Carbink could be based on the carbuncle, a mythical fairy-like creature that was rumored to be able to emit light and have gemstones growing out of its body. It physically resembles ores, rocks that contains minerals with important elements that are valued for a high price.", "/wiki/Cherrim": "Its Overcast Form resembles the bud of a fuchsia flower and other flowering plants such as the cherry blossoms and cherry fruits, that tend to grow a form of clustered flowers that hangs on its tree and later blossoms into multiple fruits.", "/wiki/Croconaw": "Croconaw may be a combination of crocodile and gnaw, though it may also involve maw or jaw.", "/wiki/Crawdaunt": "Shizariger may be a combination of シザー shizā (scissors) and 蝲蛄 zarigani (crayfish).", "/wiki/Chien-Pao": "Chien-Pao and Paojian may be a combination of 劍 / 剑 jiàn (Chinese for sword) or 寶劍 / 宝剑 bǎojiàn (Chinese for treasure sword) and 豹 bào (Chinese for leopard). The English name is formatted in Wade–Giles, a romanization system used in the Anglosphere for most of the 20th century.", "/wiki/Chandelure": "In the Pokémon of the Year poll held by The Pokémon Company in 2020, Chandelure was voted the most popular Generation V Pokémon, receiving 50,943 votes. It was also the eighteenth-most popular Pokémon overall.", "/wiki/Crabominable": "Crabominable grew its fluffy fur to combat the icy cold of its mountain home. It can also store cold in its claws, which are capable of smashing ice walls or halting avalanches. In desperate times, the claws can even be fired like rockets. Additionally, Crabominable can freeze its opponents in place by firing icy bubbles from its mouth, which is useful since Crabominable has a slow movement speed. Crabominable's detached pincers are said to have a delicious taste; some Trainers have been known to use Lechonk just to find these pincers.", "/wiki/Charmeleon": "Charmeleon mercilessly destroys its foes using its sharp claws. If it encounters a strong foe, it turns aggressive. In this excited state, the flame at the tip of its tail flares with a bluish white color.", "/wiki/Chinchou": "Pokémon Pinball: Ruby & Sapphire: Chinchou are the main bumpers on the Ruby Field. Hitting a nearby button will change the formation from three floating in place, to three moving around, to just the one moving around. They will occasionally disappear and be replaced by Lotad or Whiscash.", "/wiki/Claydol": "Claydol, the Clay Doll Pokémon. Claydol is the evolved form of Baltoy. These ancient Pokémon are said to come alive when a mysterious light instilled life into clay creatures created in ancient times. Claydol can fly and are able to fire beams from both arms.", "/wiki/Chewtle": "Inside Chewtle's mouth is a dark orange tongue and a single large tooth, the latter of which it can use to bite down hard on targets, not letting them go. It can even hang on from low heights for a period of time using just its teeth. Chewtle snaps at anything in front of it because of an itch of its teething. Sometimes it bites at another Chewtle's horn, causing the two Chewtle to fight. There is popular children game involving Chewtle. The game involves children lifting Chewtle holding onto a stick and see which one can hold onto stick the longest. In Generation VIII, Jaw Lock was its signature move.", "/wiki/Cutiefly": "Cutiefly is capable of detecting the aura of living things, such as plants, people, and Pokémon. It uses this ability to predict the movements of its opponents. It collects nectar and pollen from flowers, which are found by the color and brightness of their auras. However, when a living creature is excited, its aura resembles a flower in full bloom. As a result, Cutiefly tends to gather around beings feeling strong emotions. This Pokémon can be found in fields and meadows but is sometimes attracted to towns or buildings by the emotions of living beings.[1] Loving nectar and pollen, it often gets into skirmishes with Butterfree over food. It is known to be drawn in by Fomantis's sweet scent and Gossifleur's pollen. Spinarak and Pineco are natural predators of Cutiefly.", "/wiki/Charizard": "Lizardon may be a combination of lizard and either dragon or -don (common suffix in dinosaur names derived from the Ancient Greek word for tooth).", "/wiki/Celebi": "Prior to this, it was impossible to legitimately obtain a Shiny Celebi in a non-Japanese language game, as a Shiny Celebi was never distributed and wild Celebi can only be caught through Crystal's GS Ball event.", "/wiki/Charmander": "Hitokage may be a combination of 火 hi (fire) and 蜥蜴 tokage (lizard), forming together the word 火蜥蜴 hitokage (mythical salamander).", "/wiki/Chingling": "Three Chingling made their main series debut in The Bells Are Singing!, under the ownership of Francesca. They formed part of Francesca's magic trick, but she had trouble keeping them under control. When Team Rocket captured the Chingling, James found himself growing fond of them since they reminded him of his Chimecho.", "/wiki/Caterpie": "Poliwag and Togepi also share this record, but in Pokémon Adventures only.", "/wiki/Combee": "Mitsuhoney may be a combination of 蜜蜂 mitsubachi (honey bee), 三つ mittsu (three), and honey.", "/wiki/Cherubi": "Cherubi, the Cherry Pokémon. All of the nutrients needed for evolution are contained in its small ball. Cherubi becomes redder as it is exposed to sunlight, and is almost ready to evolve once the smaller ball buds.", "/wiki/Diggersby": "Horudo may be a combination of 掘る horu (to dig) or hole and 土 do (soil) or 兎 to (rabbit)", "/wiki/Decidueye": "Hisuian Decidueye's earthy coloring and comparatively shorter wings seem to draw inspiration from the color change deciduous tree leaves experience during autumn, signifying its growth. Its hat-like crown of feathers resembles a kasa, or traditional Japanese brimmed hats, perhaps the ayaigasa specifically worn by samurai archers for hunting or ceremonial purposes.[2] Additionally, the motif of autumn leaves is commonly associated with Rōnin, samurai members who have fallen from grace and usually have been ousted. This is also suggested by its wandering lifestyle. It may also be inspired by Cikap-kamuy, the Ainu god of owls and the land; and hence inspired by Blakiston's fish owl. It also shares similarities with primarily ground-dwelling burrowing owls and secretarybirds. Hisuian Decidueye's Shiny coloration is similar to Alolan Decidueye's normal coloration.", "/wiki/Delibird": "Delibird is a combination of delivery and bird. Deli may have derived from the Adélie penguin. Pronouncing Delibird with the same inflection as delivered yields a very similar pronunciation, with the \"b\" and \"v\" being the only variation between the two words. As the \"v\" sound does not exist in the Japanese language, it is commonly pronounced as a \"b\" sound by Japanese speakers.", "/wiki/Dewgong": "Despite its name, Dewgong has more in common with earless seals than dugongs, particularly harp seal pups due to its white fur and icy habitat. Its body is similar to mermaids. It also shares characteristics with various aquatic mammals that live in the Arctic Ocean. Its long, white body is also similar to a beluga whale, its horn may be inspired by a narwhal, and its tusks may be inspired by a walrus.", "/wiki/Delphox": "Its witch-like characteristics and appearance, along with its Fire typing, are possible references to common witch-hunts that involved burning a victim for the accused practice of witchcraft.", "/wiki/Dachsbun": "Bowtzel may be a combination of bow wow (onomatopoeia for a dog's bark) and pretzel.", "/wiki/Drapion": "Drapion and Dorapion may be a combination of dragon, drastic (referring to its violent nature), or Dracula (referring to its huge vampire-looking teeth) and scorpion.", "/wiki/Duosion": "Duosion and the rest of its evolutionary line seem to bear reference to cells, with the green substance surrounding their bodies resembling cytoplasm and the objects inside their bodies representing organelles. The line down its head also resembles a cleavage furrow due to mitosis. It may also make allusion to the embryonary stages, specifically when the embryo is fully developed to become into a fetus, while the green jelly may represent the amniotic fluid.", "/wiki/Dracozolt": "Patchiragon may be a combination of パチパチ pachipachi (onomatopoeia for crackling) and dragon.", "/wiki/Durant": "Durant may be a combination of durable or durus (Latin for hard) and ant.", "/wiki/Deoxys": "Deoxyribonucleic acid (DNA) is a molecule composed of two polynucleotide chains that coil around each other to form a double helix carrying genetic instructions for the development, functioning, growth and reproduction of all known organisms and many viruses. Normal Forme Deoxys's arms can sometimes be seen as represented by overlapping helix strands, which resemble the double helix coil of DNA.", "/wiki/Deino": "Monozu may be a combination of mono- (prefix meaning one) and 頭 zu (head).", "/wiki/Dondozo": "Heyrusher may be a combination of へいらっしゃい heirasshai (\"Hey, come on in\"; typically said by sushi restaurant chefs when greeting customers) and the agentive suffix ～者 -sha or -er. It may also refer to Rusher Itamae, a Japanese comedian. 板前 Itamae is a Japanese word referring to a chef of traditional Japanese cuisine, and can refer to a sushi chef.", "/wiki/Dolliv": "Dolliv has coexisted with humans since ancient times, living among settlements and sharing its tasteful, fresh-scented oil. It enjoys basking in the sunlight until the fruits on its head ripen. Once accomplished, it leaves the settlements and goes on its own journey.", "/wiki/Dragapult": "It may also be a reference to the paternal care behavior present in many amphibian species. The Dragon typing may be a reference to the Olm, a type of salamander native to central and southeastern Europe that was believed to be a dragon offspring by locals. However, its posture and body stature are closer to crocodilians supporting themselves with their hind legs and tails while underwater, and are also known to hold their young on their heads.", "/wiki/Deerling": "Shikijika may be a combination of 四季 shiki (four seasons) and 鹿 shika (deer).", "/wiki/Dreepy": "Dorameshiya may be a combination of dragon and うらめしや urameshiya (a phrase typically said by ghosts).", "/wiki/Dragonair": "Dragonair may be a combination of dragon and air, debonair, or lair (traditional home of a dragon).", "/wiki/Dwebble": "Dwebble, the Rock Inn Pokémon. After finding a suitable rock, Dwebble digs a hole in the rock's bottom to use as a protective shell. Dwebble can make rocks easier to carve by producing a liquid from its mouth.", "/wiki/Drifblim": "As a concept of a Ghost-type balloon, it may have been inspired by some Kaidan ghost stories, where ghosts and spirits have been compared to balloons.", "/wiki/Doduo": "Doduo may be a combination of dodo (an extinct, flightless bird) and duo (a pair).", "/wiki/Druddigon": "Crimgan may be a combination of crimson and dragon, 顔 gan (face), or 岩 gan (rock).", "/wiki/Dewott": "Futachimaru may be a combination of 二つ futatsu (two), 太刀 tachi (long sword), and 丸 maru (round; common suffix in male Japanese names).", "/wiki/Dhelmise": "Dhelmise appears to be a cluster of seaweed holding together the anchor and a helm of a wrecked ship. Its behaviour may be a reference to two famous captains in classic literature, Captain Ahab the main protagonist in Herman Melville's Moby-Dick that dies tied to his own harpoon while trying to kill a whale, and the captain of the ghost ship Demeter, that in Bram Stoker's Dracula is found tied to the helm of the ship after being drained by the protagonist.", "/wiki/Dartrix": "Dartrix may be a combination of dart and Strix (a genus of owls) or tricks.", "/wiki/Darkrai": "Darkrai's appearance and abilities suggest it is based on the concept of nightmares or a mare. Resembling a shadow, it may also have been inspired by the bogeyman, the Greek god Morpheus, genies (or jinn), or the Oneiroi, namely Phobetor. It might also be based on the Nocnitsa from Slavic folklore. The Nocnitsa is an evil spirit that torments children with horrible nightmares, slowly draining them of their life energy with each passing night. Supposedly, the only way to protect oneself from Nocnitsa is by placing a knife or special stone underneath a pillow. This is similar to how victims of Darkrai's nightmares can only be woken up with the Lunar Feather.", "/wiki/Dewpider": "Shizukumo may be a combination of 滴 shizuku (drop, of water or other liquids), 蜘蛛 kumo (spider), and 水蜘蛛 mizugumo (diving bell spider).", "/wiki/Drampa": "Jijilong may be a combination of 爺 jijī (an informal term for an old man) and 龍 Lóng (Chinese dragon).", "/wiki/Darumaka": "In their debut games, Pokémon Black and White, Darumaka lived in a desert with constant sandstorms, despite having no type-based protection against sandstorm damage. In The Lonely Deino!, Darumaka are shown to burrow under the sand, which may intend to clarify how they protect themselves in the sandstorm.", "/wiki/Dugtrio": "Dugtrio's body has been described inconsistently throughout the franchise's history. Originally, it was three Diglett forming a group of three, but more recent Pokédex entries claim it split from a single Diglett into three - sometimes separate, sometimes sharing a body.", "/wiki/Dratini": "Dratini appears to be based on sea serpents or ryu, traditional Japanese dragons or Chinese dragons who bring good luck. Its constant growth is similar to that of snakes, who grow as long as they live. Additionally, its reclusive nature, aquatic habitat, and the fact that, for a long time, it was considered a myth are reminiscent of the Loch Ness Monster.", "/wiki/Dunsparce": "Nokocchi may be derived from an anagram of ツチノコ, the katakana spelling of 槌の子 tsuchinoko (a fabled snake-like creature).", "/wiki/Duraludon": "Duraludon may be a combination of duralumin, durable, dragon, don (Spanish for lord), and -don (common suffix in dinosaur names derived from the Ancient Greek word for tooth).", "/wiki/Duskull": "Duskull may be based on the Grim Reaper or the bogeyman. The Japanese equivalent of the bogeyman is called the Namahage. Its shape is similar to a Hitodama, the Japanese representation of a human soul.", "/wiki/Drowzee": "Drowzee may be a combination of drowsy and zzz (onomatopoeia for snoring).", "/wiki/Dragalge": "Dragalge appears to be based on a leafy seadragon, but bears resemblance in shape and body appendages to the weedy seadragon. Both of these animals are capable of mimicking the appearance of aquatic foliage as a way of camouflage, like Dragalge. The Pokédex entries for Dragalge and its pre-evolution make several allusions to a diet, habitat, and resemblance based around rotten kelp, a kind of seaweed. Notably, rotting seaweed releases highly toxic gas, and can cause poisonings.", "/wiki/Dragonite": "PAL:A benevolent Pokémon said to search the ocean for drowning swimmers and guide damaged ships to shore. Because of this, many people venerate Dragonite as a guardian of the sea. In battle, on the other hand, it's a fearsome foe, soaring rapidly through the air to deliver incredible attacks. Let's be thankful it's usually friendly.", "/wiki/Drednaw": "Kajirigame may be a combination of 齧り付く kajiritsuku (to bite into) and 亀 kame (turtle).", "/wiki/Dustox": "When Dustox flaps its wings, a fine dust is scattered all over. This dust is actually a powerful poison that will even make a pro wrestler sick. This Pokémon searches for food using its antennae like radar.", "/wiki/Delcatty": "Delcatty appears to be based on a domestic cat. It may also draw inspiration from lynxes, cats with a ruffed face and tufted ears. Delcatty's collar resembles an orthopedic neck pillow, which could be a reference to the fact that it sleeps whenever and wherever it decides, and a pin holder.", "/wiki/Dracovish": "Dracovish may be a combination of dracō (Latin for dragon), fish, and possibly vicious or Ordovician.", "/wiki/Donphan": "Donphan and Ursaring, along with their pre-evolved forms, are the only Pokémon to swap version-exclusive status between localizations. While Phanpy and Donphan are found only in the Japanese and Korean Gold, they are not found in Gold in other languages, being found in the Silver Version of those languages instead, with Teddiursa and Ursaring getting the opposite treatment. This is changed in the remakes HeartGold and SoulSilver, where they follow the Japanese and Korean Gold and Silver.", "/wiki/Dottler": "Dottler may be based on a ladybird pupa and a radome, hence its category name. Its eyes also resemble laboratory goggles. Dottler may also be inspired by a disco ball, due to its shape and the blue spots on its shell being able to light up.", "/wiki/Dialga": "Dialga may be derived from diamond. It may also involve día (Spanish for day, referring to the unit of time) or dial of clock dial and sundial.", "/wiki/Drakloak": "Drakloak may be a combination of dragon or drake and cloak. It may have also been derived from the Sanskrit word lok, which represents other planes of existence or realms of the afterlife in Indian religions.", "/wiki/Dusclops": "Dusclops can be seen as a parallel to Banette. Both are Generation IIIGhost-type Pokémon that evolve from their pre-evolved forms at level 37. Both also have the same base stat total. Wild Dusclops are exclusive to Pokémon Ruby, while wild Banette are exclusive to Pokémon Sapphire.", "/wiki/Drizzile": "Jimereon may be a combination of じめじめ jimejime (damp, humid, clammy) and chameleon.", "/wiki/Dudunsparce": "Nokokocchi may be derived from a partial repetition of ノコッチ Nokocchi (Dunsparce), for the same reasons mentioned above.", "/wiki/Darmanitan": "Hihidaruma may be a combination of 火 hi (fire), 緋 hi (scarlet), 狒々 hihi (baboon), Daruma, and 火達磨 hidaruma (the state of being on fire).", "/wiki/Drifloon": "Fuwante may be a combination of ふわふわ fuwa fuwa (soft, airy, and light; or an onomatopoeia for floating), 風船 fūsen (balloon), and 不安定 fuantei (unstable).", "/wiki/Ditto": "Metamon may be a combination of metamorphose (to undergo a physical transformation) or meta- (prefix meaning \"encompassing\" or \"transcending\", which may refer to Transform allowing Ditto to take on the shape of every other Pokémon) and monster.", "/wiki/Dubwool": "Baiwooluu may be a combination of 倍 bai (twice), wool, and Wooluu (Wooloo's Japanese name).", "/wiki/Dodrio": "Dodorio may be a combination of ドードー dodo, 鳥 tori (bird), and トリオ trio.", "/wiki/Dedenne": "PAL: This Electric- and Fairy-type Pokémon's round shape and antennae-like whiskers make it very distinctive. It has a habit of sticking its tail into sockets to absorb electricity that it fires from its whiskers. Its Discharge attack shoots off in four directions, passing through obstacles and stunning any fighters it hits along the way.", "/wiki/Dusknoir": "Yonoir may be a combination of 妖魔 yōma (ghost) or 夜 yoru (night) and noir.", "/wiki/Diancie": "Diancie may be a combination of diamond, fancy, pixie, and 石 ishi (stone). The -cie could also come from メレシー Melecie (Carbink's Japanese name), reflecting Diancie’s status as a mutated Carbink.", "/wiki/Doublade": "Nidangill may be a combination of 二 ni (two), 断 dan (to sever), and 斬る kiru (to slay with a blade) or kill.", "/wiki/Ducklett": "Koaruhie may be a combination of 子 ko (child) or 小 ko (small) and a corruption of 家鴨 ahiru (duck).", "/wiki/Drilbur": "For a portion of the first day of the round of the Wild Area News for April 28 to May 11, 2020, ★ Drilbur raids originating from Shield came with the illegal move Hydro Pump. The same raids for the rest of the event's duration, or hosted from Sword, come with the correct move, Scratch. Players who caught a Drilbur with Hydro Pump cannot trade or battle online with it unless that move is deleted. These erroneous Drilbur otherwise function like other Drilbur, and can evolve into Excadrill with Hydro Pump. Additionally, while Dynamaxed, these Drilbur and Excadrill also have access to Max Geyser, which is typically unobtainable as neither can legitimately learn any Water-type attacks.", "/wiki/Diglett": "On the \"Compare\" screen of Pokémon X and Y's Pokédex, if the player taps the menu sprite of Diglett, Dugtrio, or MegaGengar, the Flying-type Pokémon will give up and disperse before even trying to lift it.", "/wiki/Emboar": "Appearance-wise, Emboar looks much like a wild boar with elements of a British Saddleback in a wrestling singlet. The swirl pattern around its abdomen resembles the patterns on a ding or ancient Greek pottery. The fire in its Shiny coloration may refer to blue fire, which generally indicates a higher temperature than an orange fire but may also be caused by certain chemicals burning at a normal temperature.", "/wiki/Espeon": "Eifie may be a combination of エスパー ESPer (one who has extrasensory perception) and フィール feel. It is also similar to イーブイ Eievui (Eevee's Japanese name).", "/wiki/Excadrill": "Doryuzu may be a combination of ドリル doriru (drill), 土竜 doryū (mole), and 渦 uzu (spiral or swirl).", "/wiki/Entei": "Entei visually resembles an erupting volcano. Its red faceplate and yellow crown resemble lava, its neck shape and brown coloration are reminiscent of the base of a volcano, and it has a cloud of flowing smoke. Its face also resembles a kabuto and the backplates resemble mountains.", "/wiki/Eelektrik": "Shibibeel may be a combination of 痺れ shibire (numbness) or 痺鰻 shibire-unagi (electric eel), ビリビリ biribiri (onomatopoeia for an electric shock), and eel.", "/wiki/Elgyem": "Elgyem seems to be based on greys, one of the more popular kinds of alien. Its rocky physical appearance may be a reference to the stone circles of Europe, which were allegedly created by visiting extraterrestrials; or Japanese Dogū, statues which have often been confused for alien artifacts. The depressions in place of its ears look like craters on faraway planets. The round, colored fingers on its hands resemble the colorful faces of the invaders in the 1953 War of the Worlds film; however, the aliens in the film had green, blue, and red dots while Elgyem has red, green, and yellow. The flashing patterns of its fingers may have been inspired by the 1977 sci-fi film Close Encounters of the Third Kind, particularly the iconic scene where flashing color and sound patterns are used to communicate with the alien mothership.", "/wiki/Exploud": "Bakuong may be a combination of 爆音 bakuon (sound of an explosion) and 音楽 ongaku (music), king, or gong (a loud percussion instrument).", "/wiki/Espathra": "Espathra appears to be based on an ostrich. Based on its appearance and names in every language, it also seems to take inspiration from the Egyptian queen Cleopatra. The connection between ostriches, psychic powers, and Egyptian motifs may ultimately reference Maat, the personification of truth in ancient Egyptian mythology whose symbol was the ostrich feather. The feathers on Espathra's head may be inspired by a nemes or a mantilla. Its body plumage may be inspired by Rococo fashion in the 17th century, which featured multilayered and frilled dresses for women. Cleopatra along with other historical figures used to be depicted in the contemporary fashion in late Renaissance and early-modern art. The shiny coloration of Espathra further refers to reimagined Egyptian costumes in modern media.", "/wiki/Exeggcute": "Five Exeggcute appeared in Securing the Future!, with two under the ownership of different Trainers and the other three being wild. They joined the rest of Alola in showering Necrozma with light so it could return to its true form.", "/wiki/Espurr": "Espurr appears to be based on a kitten, particularly the Scottish Fold breed due to its curled ears and lilac coloring. It may also be inspired by nekomata, who were inspired by cats who live many years until their tail splits and they gain supernatural powers, much like when Espurr evolves into Meowstic.", "/wiki/Electrode": "Marumine may be a combination of 丸 maru (circle) and mine, as in landmine.", "/wiki/Emolga": "If you heard someone talk about \"a cute little rodent Pokémon with electric pouches in its cheeks,\" you'd probably think they meant Pikachu, but that description would fit Emolga, too! Much like Pikachu, Emolga is more than just a cute face. It glides down from treetops on its cape-like membranes to really shock its foes!", "/wiki/Electivire": "Elekible may be a combination of electric, エレキ eleki (electric), or electricity and cable.", "/wiki/Empoleon": "Emperte may be a combination of emperor penguin and Bonaparte (Napoleon's surname).", "/wiki/Ekans": "Ekans seems to be based on various snakes. Its venomous bite and tail rattle are similar to a rattlesnake, while its lack of visible teeth and diet of eggs are similar to an egg-eating snake. The single yellow stripe around its neck is reminiscent of the ring-necked snake, and the line connecting its eyes is reminiscent of the marking on the back of the Indian cobra's hood. The fact that it is in the Dragon Egg Group and its ability to learn Glare may be a reference to the legendary basilisk, a venomous, serpentine dragon said to be able to kill people with its stare.", "/wiki/Eldegoss": "Watashiraga may be a combination of 綿 wata (cotton) and 白髪 shiraga (white hair).", "/wiki/Electabuzz": "Eleboo may be a combination of electric or エレキ eleki (electric) and ブンブン bunbun (buzz).", "/wiki/Eiscue": "Eiscue may be a combination of Eis (German for ice or ice cream) and ice cube.", "/wiki/Eelektross": "Shibirudon may be a combination of 痺れ shibire (numbness) or 痺鰻 shibire-unagi (electric eel) and don (Spanish for lord) or -don (common suffix in dinosaur names derived from the Ancient Greek word for tooth).", "/wiki/Elekid": "Elekid and Magby can be considered counterparts. Both are Baby Pokémon introduced in Generation II who evolve starting at Level 30 and whose evolved forms evolve via trading with an item containing the suffix \"-izer\" . Both have the same gender ratio (75% male, 25% female), and both are typically exclusive to one version of a pair of games. They both have similar status-inducing Abilities in Flame Body and Static, as well as the same Hidden Ability, Vital Spirit. They also learn moves at the same level that have equal chances of causing a status condition.", "/wiki/Escavalier": "Escavalier may be a combination of escargot (French for snail) and cavalier (French for mounted soldier) or chevalier (French for knight), as well as pun of Excalibur.", "/wiki/Enamorus": "In Therian Forme, Enamorus may be based on reptiles, namely a softshell turtle and a snake. It may also draw inspiration from the Black Tortoise (Chinese: 玄武 Xuánwǔ) of the Chinese Four Symbols; like Enamorus, the Black Tortoise is usually depicted with a snake wrapped around it. However, despite Enamorus being associated with spring, the Black Tortoise represents winter. Therian Forme Enamorus's Pokédex entry, which mentions it punishing those who disrespect life, may be inspired by stories of turtle eaters being revenged by demonized softshell turtles in Edo-era literary sketches, such as Hokuetsu Kidan and Kaidan Tabi no Akebono. Its form difference could also draw inspiration from the Edo-era superstition that softshell turtles are capable of shapeshifting.", "/wiki/Eternatus": "Mugendina may be a combination of 無限大 mugendai (infinity), ダイマックス Daimax (Dynamax) and possibly dynamic.", "/wiki/Electrike": "Electrike may be a combination of electric and strike or tyke (slang word for dog or small child).", "/wiki/Eevee": "Eevee and Eievui are the pronunciations of E-V, the first two letters in the word evolution.[3]", "/wiki/Exeggutor": "Nassy may be a combination of ココナッツ kokonattsu (coconuts) and 椰子 yashi (palm tree).", "/wiki/Fidough": "Pupimocchi may be a combination of puppy and もっちり mocchiri (doughy, springy) or 餅 mochi (Japanese rice cake).", "/wiki/Flaaffy": "Storing too much electricity caused Flaaffy to lose the wool over most of its body, but the bare, rubbery skin protects it from the electricity stored in its fleece. The quality of Flaaffy's fleece can change to generate more electricity with less wool. The orb will light up when Flaaffy's mane is fully charged, and it can attack by firing electrified hairs at opponents. Flaaffy typically inhabits grassy meadows and fields, though it can also be found in farms, where its wool is used to create high-quality clothing.", "/wiki/Fearow": "Onidrill may be a combination of 鬼 oni (demon), 鳥 tori (bird), and ドリル doriru (drill).", "/wiki/Fuecoco": "Hogator may be a combination of 火 ho (fire), ほげー hogē (onomatopoeia for being dumbfounded), fogata (Spanish for campfire) or hoguera (Spanish for bonfire), and gator. It may also involve malagueta (type of chili pepper) or melegueta (grains of paradise; a spice).", "/wiki/Feraligatr": "Feraligatr opens its powerful jaws to intimidate its foes and viciously shakes its head once it clamps down on foes or prey. Because it has difficulty supporting its weight out of the water, it has been known to move on all fours. However, when hunting or fighting, it is agile and fast, due to its powerful hind legs. Feraligatr can rarely be found living near the water's edge.", "/wiki/Florges": "Florges appears to be based on fairies and nymphs, in particular Anthousai due to its floral \"hair\". Its ornate, flowery \"hair\" may also be a reference to the 18th century pouf hairstyle, which was notable in that the style would commonly use decorative items within the hair itself to convey mood and uniqueness. Its body structure resembles that of the hyacinth flower, which has large sturdy leaves projecting from the base of the stalk. Its design may also draw inspiration from mermaids.", "/wiki/Fennekin": "Fokko may be a combination of fox, fuoco (Italian for fire), 狐 ko (fox), and 子 ko (child).", "/wiki/Frigibax": "Frigibax mostly resembles a baby dinosaur, perhaps specifically the Concavenator, a theropod dinosaur which had a crest on its back and quills on its forelimbs. Fossils of the genus were first discovered in Spain, and the crest is hypothesized to have functioned as a tool of thermoregulation. Frigibax may also draw inspiration from kaiju.", "/wiki/Foongus": "Foongus's Shiny form's coloration is reminiscent of that of the Master Ball. It shares this trait with its evolved form.", "/wiki/Floette": "Pokémon X and Y: 3,000 years ago, AZ befriended a special Floette who died in the ancient Kalos war. AZ created a giant machine to bring his friend to life, and while he succeeded in granting his friend eternal life, his immeasurable grief led him to turn the machine into an immensely powerful weapon. The weapon decimated the armies of both sides, and brought an end to the war. However, upon learning that the weapon drew upon the life of other Pokémon, the Floette left him in disgust. Through the player's actions, however, AZ's grief is lifted, and the two old friends reunite during the credits of the game.", "/wiki/Fraxure": "Fraxure is very violent and territorial. Fights over turf often break out between it and another Fraxure. After a fight, it sharpens its tusks on river rocks, as they do not regenerate. It lives alongside rivers. Fraxure engages in violent confrontations with Bisharp for the locations of sharping stones. Fraxure uses its tusks only when necessary. The reason is once its tusks break, Fraxure will be unable to use it again. Fraxure uses its tusks to cut the prey in two different food portions, one for eating now and the second portion for later.", "/wiki/Falinks": "It may also take inspiration from eusociality, a kind of social animal behavior found in certain insects, crustaceans, and mammals characterized by, among other things, the division of labor of the members of the colony, which are sometimes called castes, like soldiers, workers, and the queen. In Falinks's case, the castes are the troopers and the brass.", "/wiki/Flutter_Mane": "In an article from a May issue of Occulture magazine, it is stated that Flutter Mane's name was taken from a strange creature with a matching description appearing in the Scarlet Book. It is said to float around the sky at night with its long hair writhing about it. According to the magazine, eyewitness accounts initially described it as resembling a giant Misdreavus, albeit a highly fierce and aggressive one, and that some believe it to be a ghost of a pterosaur from a long-gone era.", "/wiki/Forretress": "A Forretress was seen in Crossing Crobat, under the ownership of Janine. She used it to escape from the security guards with its Spikes after she tried to steal a Big Pearl from the Goldenrod Museum as a security test.", "/wiki/Ferrothorn": "Ferrothorn may be a combination of ferrous (containing iron) and thorn.", "/wiki/Farigiraf": "Rikikirin may be derived from 力 riki (power) and 麒麟 kirin (giraffe) with the name being an anagram of キリンリキ Kirinriki (Girafarig). It not being a palindrome may reflect that Farigiraf’s tail now surrounds its head.", "/wiki/Finneon": "If you see the pink patterns on Finneon’s tail fins shining at night, that means it stored up plenty of sunlight during the day. Isn’t Finneon beautiful when it flutters its fins like a pair of delicate wings?", "/wiki/Fletchling": "PAL: Fletchling, the Tiny Robin Pokémon. This Normal- and Flying- Pokémon is often seen in cities in the Kalos region. It's popular with trainers due to its friendly personality and beautiful voice. However, they can be very territorial, and if you bring one out in battle, it won't hesitate to use Peck on one of your opponents.", "/wiki/Flareon": "Booster is literally booster, possibly referring to the booster rocket.", "/wiki/Finizen": "Finizen is able to sense the emotions of other creatures by using ultrasonic waves. It lives in pods, competes with Barraskewda for food, and is preyed upon by Dragalge.", "/wiki/Flamigo": "Flamigo lives near bodies of water and in wetlands. Flocks of Flamigo are known to attack together in perfect harmony, via a behavior known as \"synchronizing\". Flamigo is the only known Pokémon that can have Costar as an Ability.", "/wiki/Frillish": "Frillish's design is inspired by the image of princes and princesses,[2] perhaps specifically of the Victorian-style monarch attire. Frillish and its evolved form also have traits in common with sea monsters like the Kraken, most notably their rumored penchant for destroying ships and feeding on the crew.", "/wiki/Floatzel": "Floatzel has a yellow flotation sac, which seems to behave similar to rubber. The flotation sac goes in a kind of ring behind its head, down in front of its arms, then back behind its rear above the tails. Floatzel's sac developed as a result of chasing prey in the water. To help it dive, Floatzel can deflate its flotation sac, and then inflate it once again when it wishes to surface. Floatzel's sac allows it to not drown, even in stormy seas. Along with hunting for food, Floatzel can use its swimming capabilities to assist in the rescues of drowning people, by carrying them like a raft. It is often seen near fishing hamlets.", "/wiki/Floragato": "Nyarote may be a combination of ニャー nyā (onomatopoeia for meowing) and brote (Spanish for sprout or plant bud).", "/wiki/Frogadier": "Frogadier was shown in the anime to be able to run on the surface of water, which could be a reference to ninjas supposedly being able to walk on water using mizugumo.", "/wiki/Ferroseed": "From Generation VI onward, Ferroseed's Hidden Ability is the same as its first Ability, Iron Barbs, unlike its evolved form, which has a different Hidden Ability, Anticipation. A Ferroseed with Iron Barbs as its Hidden Ability can evolve into an Anticipation Ferrothorn and can be bred to produce more Ferroseed with Iron Barbs as their Hidden Ability.", "/wiki/Froakie": "Keromatsu is a combination of ケロケロ kerokero (onomatopoeia for a frog's croaking) and 沫 matsu (bubble or foam) or 飛沫 himatsu (spray or splash).", "/wiki/Frosmoth": "Frosmoth may be based on the Gynaephora genus of alpine or Arctic moths. One particular species, the arctic woolly bear moth, can enter a dormant state that allows it to endure temperatures as low as −94 °F (−70 °C).", "/wiki/Farfetch%27d": "Farfetch'd may be derived from far-fetched, meaning unbelievable, perhaps relating to Farfetch'd's rarity or the \"far-fetched\" theme of its Japanese name.", "/wiki/Flapple": "Flapple's Gigantamax form appears to be based on a caramel apple or a candy apple, and its ability to make Pokémon faint due to its sweetness may be a reference to a diabetic coma. Flapple and Appletun having identical Gigantamax forms may be a reference to convergent evolution, which can lead to separate organisms independently developing identical characteristics and body plans.", "/wiki/Fezandipiti": "Kichikigisu may be a combination of 吉 kichi (fortune) and 雉子 kigisu (archaic reading of pheasant).", "/wiki/Flittle": "Flittle spends most of its time roaming wastelands and mountainous regions. Flittle is also known to be quite vengeful. Should anyone steal Flittle's berries, it will chase after them for revenge.", "/wiki/Flab%C3%A9b%C3%A9": "Flabébé may be a combination of フラワー flower and bébé (French for baby).", "/wiki/Furret": "Despite its short limbs, Furret is very quick and agile. Its speed allows it to catch prey such as Rattata. It tends to burrow under the ground of meadows and other temperate grasslands. Its narrow burrows are well-suited for its slim body and are very difficult for other Pokémon to enter. The burrows also become more maze-like deeper inside, which makes it even harder to find Furret's nest. A mother Furret curls itself around its offspring to help them sleep. In Lental, Mightyena is a natural predator of Furret.", "/wiki/Fletchinder": "Fletchinder has a flame sac in its belly. It hunts by igniting tall grass and swooping down on bug Pokémon that attempt to escape the blaze. Once captured, the prey is cooked before being consumed. As its internal fire gradually heats up, it can fly at increasingly faster speeds. It is aggressive and territorial, even against its own kind. It often fights with its own kind for the right to feeding grounds. Its territory range has a radius of over one mile, or around 2-3 km.", "/wiki/Froslass": "Froslass lives in snowy areas and has the ability to freeze foes with its -58 degrees Fahrenheit breath. It is thought to display its victims secretly after freezing them. It enjoys preying on handsome men climbing in the mountains, but has also been known to take Pokémon. Its favorite food is frozen souls. Froslass is known to bring its frozen prey back to the cave it lives in before lining them up neatly. It also goes down to human homes to knock on doors during nights of cold blizzards. There is a legend that Froslass will place curses on any men that misbehave. As evidenced in the anime, it can create illusions to manipulate others. Froslass is a female-only species and is said in legends to have been formed when the spirit and lingering regrets of a woman who was lost in the mountains possessed an icicle.", "/wiki/Fomantis": "In order to achieve evolution, Fomantis stores up energy gathered by photosynthesis. It is nocturnal, so during the day, it spreads its leaves wide to catch the sunlight. During the night, it spends its time searching for a new spot to sleep for the next day. It will not stay in the same spot for more than a day due to the danger involved. If anything bothers it while it is gathering sunlight, Fomantis will fiercely attack it. The reason is that Fomantis hates its naps being disturbed. When regularly exposed to sunlight, it grows up with vivid coloration. Though it excels at long-range attacks, it will rarely use those that require it to use its stored photosynthetic energy.[1] Fomantis can give off a sweet and refreshing scent. Bug Pokémon like Cutiefly are known to gather near it due to its scent. Trainers who own Fomantis tend to give it a flowerpot, allowing it to sunbathe in peace.", "/wiki/Furfrou": "In Kangaskhan...Kangascan't, an illusion of a Furfrou appeared to belong to Celosia, disguised as a Furfrou stylist. Shauna encountered it in an alleyway, which she mistakenly believes to be her missing one. She quickly realizes it actually belongs to the stylist who trims it into the Pharaoh, Debutante, Dandy, and Matron Trims. It disappears after Shauna had been possessed by Celosia's Honedge.", "/wiki/Flygon": "Flygon appears to be based on the winged, adult stage of the antlion. Oftentimes, the adult antlion and dragonfly are confused with one another, and Flygon could draw inspiration from both. In fact, some species of dragonflies are commonly called \"sand dragons\", which could account for Vibrava and Flygon's type combination. In keeping with its Dragon type, it also possesses a dragon-like build and reptilian features such as its arms and tail. Its goggle-like lenses hiding a small eye could be inspired by mantids and similar insects, which have large compound eyes with pseudopupils - commonly mistaken for a true pupil.", "/wiki/Feebas": "Feebas may be a combination of feeble (weak) and bass. It also sounds similar to phoebus (Latin for shining one), possibly alluding to its evolved form.", "/wiki/Gloom": "Gloom may be derived from gloom (a state of depression) and bloom. It may also involve glume (a leaf-like structure).", "/wiki/Gogoat": "Gogoat is based on a goat, possibly a bharal, dwarf bharal, bilberry, or ibex due to its horns, though they also resemble the horns of various gazelles and antelopes. It is also based on a motorcycle, as it can be ridden and has beach bar-like horns. The grass that grows upon it may originate from Pan or Faunus, gods of nature who are half-goat, half-human. The grass could also be a reference to the traditional yule goat figures in northern Europe made of hay.", "/wiki/Greavard": "Bochi may be derived from 墓地 bochi (graveyard). It may also derive from ポチ Pochi (a common name for a pet dog in Japan) or ひとりぼっち hitoribocchi (loneliness).", "/wiki/Gible": "Gible has tremendously strong jaws that it uses to bite enemies and prey alike, dragging the latter back into its nest. However, even while biting, it often hurts itself because of clumsiness. This sometimes causes its teeth to chip and fall off in the process, but Gible is never bothered by this because the teeth will grow back after a few days. As shown in the anime, Gible is capable of eating through most types of metal.", "/wiki/Grookey": "Sarunori may be a combination of 猿 saru (monkey) and ノリ nori (excitement, rhythm).", "/wiki/Grotle": "Grotle has the ability to sense where pure water wells up, and will carry other Pokémon on its back to these sources. It lives in forests but leaves during the day to allow more sunlight on its trees. Grotle has also been observed living near clean spring water. Berries grow on the trees, attracting some species of Pokémon. The berries it grows are said to be sweet and very delicious. In the anime, Grotle is seen to produce acorn-like nuts instead.", "/wiki/Grimmsnarl": "Grimmsnarl may be a combination of grim and snarl. The spelling of Grimm- may also indicate Grimmsnarl was named after the Brothers Grimm, a duo of brothers who traveled Europe gathering folklore and oral fairy-tales and cataloging them all into a singular book, Grimms' Fairy Tales. Its name could also incorporate the words gnarly, referring to its mangled appearance or unpleasant behavior; grimoire, a type of spellbook; Grímnismál, a mythological poem in the Poetic Edda; and grimace, a term for a twisted facial expression which Grimmsnarl bears.", "/wiki/Glastrier": "Blizzapos may be a combination of blizzard and ἵππος híppos (Greek for horse) or horse.", "/wiki/Golurk": "Golurk and its pre-evolved form are based on golems.[2] The crack and strap on its chest may be a reference to the golem in the Jewish story The Golem of Prague. The golem in this story was also believed to be able to summon the spirits of the dead, which was likely the reasoning for Golurk's Ghost type.", "/wiki/Garbodor": "Garbodor is based on a garbage bag that is bursting with garbage. It and Trubbish were created as a way to represent city pollution.[1] Its visual design may be a reference to the phrase \"dust bunny\" (clumps of lint). As Garbodor seems to be a conscious pile of garbage, it might be based on tsukumogami, objects that have been possessed by spirits in Japanese folklore.", "/wiki/Gossifleur": "Gossifleur prefers living in lands with clean water and air. The pollen it produces has a healing effect, and it used to be made into a tea as a common folk remedy given to sick children in the Galarregion. Gossifleur can travel long distances by riding the wind, controlling which direction it goes by twisting its body and petals.[1] While it travels, it starts to sing a joyous song that is said to charm many people into raising it. Gossifleur can anchor itself to the ground to bask in the sunlight. When it absorbs enough sunlight, it blooms brilliantly. Cutiefly are drawn in by Gossifleur's pollen.", "/wiki/Geodude": "In the Japanese game Pokémon Blue, Geodude weighs 2.0 kg instead of 20.0 kg (as it does in all other games). This has no mechanical significance, as no game mechanics use weight in the handheld Generation I games.", "/wiki/Gholdengo": "Surfugo may be a combination of surf, 富豪fugō (wealthy person), gold, and possibly go.", "/wiki/Gothorita": "Gothorita may be a combination of goth and señorita (Spanish for the title of miss) or a corruption of gothic lolita.", "/wiki/Greninja": "As its species name implies, Greninja is also based on a ninja. Japanese culture associates frogs and toads with ninjas based on the folk story The Tale of the Gallant Jiraiya (Japanese: 児雷也豪傑物語 Jiraiya Gōketsu Monogatari), about a ninja who can shapeshift into a large toad. Greninja and its pre-evolutions may also draw inspiration from the thief or rogue character class in role-playing games, which are generally ranged combatants that often rely on speed and stealth, focusing more on dodging attacks rather than withstanding damage.", "/wiki/Gourgeist": "Gourgeist appears to be based on both gourd and modern pumpkin jack-o'-lanterns. Its multiple sizes may be a reference to the tradition of trying to grow the largest pumpkin for Halloween. Its upper body may also be based on the candles within jack-o'-lanterns themselves, with the curl being its wick and its hair-like extensions its dripping wax. It could also be viewed as a mere extension of the shape and the curl on top being its stem. The lower body's different color might also reference the tradition of decorating gourds with paint. It also has potential connections with the famous Japanese story, Yotsuya Kaidan, in which a woman transforms into a paper lantern yōkai with long hair.", "/wiki/Girafarig": "Kirinriki is a palindrome which may be derived from 麒麟 kirin (giraffe). It may also involve 念力 nenriki (telekinesis).", "/wiki/Gligar": "Its tail is tipped by a thick, horrible stinger. To bring down prey, it will first obscure their vision by covering their faces with its body, and then it will use the stinger to inject them with venom.", "/wiki/Gastly": "Gastly seems to be based on general ghosts and spirits as depicted by cartoons, or even a will-o'-the-wisp. It may also have been based on the Japanese yōkaisōgen bi, the decapitated head of a monk whose head is doomed to wander the Earth, consumed by fire. Its Poison type is most likely a reference to poisonous or polluted gases.", "/wiki/Goodra": "Numelgon may be a combination of 滑る numeru (to be slippery), gel, and dragon.", "/wiki/Gothita": "Gothimu may be a combination of Gothic and 予知夢 yochimu (precognitive dream).", "/wiki/Graveler": "Alolan Graveler seems to have dark structures made of piezoelectric crystals or magnetite, a subset of iron ore known for its black crystalline appearance and magnetic properties. The golden gems may be also inspired by piezoelectric materials or by amber and its electrostatic characteristics. This could possibly be an allusion to ἤλεκτρονēlektron (Ancient Greek for amber).", "/wiki/Golbat": "Golbat seems to be based on a bat, particularly vampire bats, which bite other animals to feed on their blood. Its Poison type may be inspired by either the anticoagulant properties of vampire bat saliva or the fact that bats are infamous for spreading deadly diseases such as rabies. Its gaping maw could be a caricature of mythological vampires.", "/wiki/Gengar": "Gengar and Gangar may be derived from Doppelgänger (ghostly double of a living person). It may also involve 幻 gen (phantasm).", "/wiki/Glaceon": "Glaceon may be a combination of glacier (a large, slow-moving mass of ice on land) or glace (French for ice) and eon (an immeasurably long period of time, possibly referring to how long evolution takes naturally). Eon is a suffix all Eeveeevolutions share and was Eevee's English prototype name. Incidentally, its name is also an anagram of congeal (to become solid, usually by cooling).", "/wiki/Gardevoir": "Gardevoir seems to be based on a feminine principalballet dancer as well as the concept of empathy. The long, white frills surrounding its body resemble a floor-length dress, and its thin, pointed legs make it appear as if it is standing en pointe and wearing white tights. Its hair is styled into a bob cut, and the short spikes behind its eyes resemble a masquerade mask. Its red horns resemble half of a heart symbol and seem to pierce its chest, implying that its ability to sense emotions is even stronger than its pre-evolved forms since the horns are connected directly to its heart.", "/wiki/Genesect": "Genesect is generally based on the giant insects of the Paleozoic era, which existed for 300 million years, making it as old as the cockroach. Its Steel-type features that give it a somewhat robotic appearance may be a reference to alien robots or cyborgs in science fiction media, but this may be due to Team Plasma's modifications. Its design might also be inspired by the \"artillery mech\" vehicles in various mecha anime and manga while also resembling the enlarged pronona of treehoppers (family Membracidae). They also share a similar head shape with many treehoppers.", "/wiki/Golisopod": "Golisopod was designed by Kensaku Nabana. According to Nabana, it took him over six months to fully design and create Golisopod; this is an average amount of time for a Pokémon to be fully created, which includes determining its habitat, behavior, moveset, and Abilities.[1]", "/wiki/Granbull": "Granbull and Granbulu may be a combination of grand, grumble, and bulldog or bully.", "/wiki/Glalie": "Glalie appears to be based on human features, like those of a cold, distant person or facial expression. It also looks somewhat similar to an ice hockey mask. Due to its Japanese name, horns, and teeth, it may be based on an oni or Tsurube-otoshi. The oni-like features and mask-like appearance may reference the Namahage, demons portrayed by men wearing oni masks and straw capes (mino) as part of a ritual in northern Japan. Glalie's pre-evolution Snorunt appears to wear a mino. It may also be based on onigiri (rice ball), as its Japanese name suggests. It also resembles a hailstone.", "/wiki/Groudon": "Groudon may be a combination of ground and don (Spanish for lord) or -don (common suffix in dinosaur names derived from the Ancient Greek word for tooth). It may also involve 土 do (earth) or ドン don (onomatopoeia for booming or crashing sound).", "/wiki/Guzzlord": "Akuziking is a combination of 悪 aku (bad, evil) and king.[4] It may also involve 悪事 akuji (evil deed, crime) or 悪食 akujiki (consumption of repulsive things).", "/wiki/Galvantula": "In Team Plasma's Pokémon Power Plot!, Colress used a Galvantula as a test specimen. It appeared to be one of Colress' favorites, as he called it his \"star test subject\", but it passed out when Colress attempted to increase the intensity of the EM waves. After it recovered, it was forced to fight Pikachu and Axew. It was eventually released from Colress's control when Team Rocket stole his data and deactivated the machine.", "/wiki/Growlithe": "Gardie may refer to its abilities as a guard dog, as a corruption of guard or guardian.", "/wiki/Glameow": "Glameow has sharp claws and a powerful helical tail, and its eyes are capable of using hypnotic powers. It tends to be spiteful, fickle, and even cowardly, having a tendency to hook its claws into the nose of its trainer if it's not fed. When it's happy and purring with affection, it demonstrates movements with its tail, like a dancing ribbon. As it has a domesticated quality, it tends to appear in urban areas. Glameow is rather popular amongst trainers due to its fickle nature. Glameow is also known to be a very cunning opponent to face in battle, which occurs only if it was provoked. Because of its craven nature, Glameow has a high chance of fleeing trainers when encountered in the wild.", "/wiki/Gliscor": "Gliscor appears to be based on a combination of gargoyles, scorpions, and vampires, which in turn share traits with bats. It may also be based on the scorpionfly. Additionally, it shares features with the amikiri, a yokai with lobster or scorpion claws and the ability to fly.", "/wiki/Golett": "Golett is believed to burn energy inside its core in order to move; this energy also emanates light through the holes near Golett's arms and legs. However, this energy has yet to be identified by researchers. Allegedly \"active for thousands of years\", Golett's animating energy is speculated to run out soon. For unclear reasons, Golett have been reported to continually line up boulders.", "/wiki/Giratina": "Giratina may be derived from platina (Spanish for platinum). It may also involve guilty, guillotine, ギラリ girari (onomatopoeia for glaring), girare (Italian for to turn around or to wander), and possibly girasol (a type of opal).", "/wiki/Glimmet": "Kirame may be a combination of キラキラ kirakira (onomatopoeia for glittering) or 煌めく kirameku (to glitter), killer, and 芽 me (bud).", "/wiki/Grapploct": "Otosupus may be a combination of 落とす otosu (to take someone down) and octopus.", "/wiki/Garchomp": "Gaburias may be a combination of がぶり gaburi (with a big bite) and Carcharias or アース āsu (earth).", "/wiki/Grubbin": "Grubbin may be a combination of grub and grubbing, to scavenge or dig.", "/wiki/Grafaiai": "Taggingru may be a combination of tagging (form of graffiti signature) and 猿 saru (monkey). It may also involve ジャングル janguru (jungle).", "/wiki/Grimer": "↑Samson Oak: \"Did you know that Alolan Grimer are in fact not native to the region at all, but instead are what we would call naturalized Pokémon? There is not so much sludge and pollution for Grimer to feed on here in Alola, though, so they have grown to feed on garbage instead. They do not give off a foul stench, thanks to the way they contain any poisons within their bodies, but their crystals are terribly poisonous!\"", "/wiki/Gurdurr": "Pokémon Mystery Dungeon: Gates to Infinity: Gurdurr is a major character where it was recruited to help build Paradise but due to past history where a customer refused to pay for the work and tore it down, Gurdurr refused to help anyone else but after a battle with the player and partner and was defeated, Gurdurr and its two pals the Timburr Brothers agreed to help.", "/wiki/Gallade": "Erureido may be a combination of elbow or earl, and blade. It may also involve 居合道 iaidō, a Japanese martial art of responding to attacks with swift swordplay.", "/wiki/Goldeen": "Tosakinto may be derived from 土佐金 tosakin (curly fantail goldfish), a distinctive breed of goldfish.", "/wiki/Grovyle": "Grovyle may be a combination of grove (a group of trees), reptile, and possibly vine or ivy.", "/wiki/Gimmighoul": "Collecurei may be a combination of collect, 霊 rei (spirit), and a pun on the phrase これくれ kore kure (\"Give me this\").", "/wiki/Gulpin": "Gokulin may be derived from ゴクリ gokuri (in one gulp). It may also involve toxin.", "/wiki/Gorebyss": "Although Gorebyss is the very picture of elegance and beauty while swimming, it is also cruel. When it spots prey, this Pokémon inserts its thin mouth into the prey's body and drains the prey of its body fluids.", "/wiki/Golem": "Golem, as the name suggests, is based on a golem, more specifically on representations in modern role-playing games, which usually are ogre-like creatures whose bodies are covered in, or made of, stones. It could also have been inspired by the tsuchikorobi, a Japanese yōkai known as the 'tumbling monster', for its habit of rolling over travelers and crushing them, as Golem does.", "/wiki/Gabite": "Appearance-wise, Gabite resembles a theropod dinosaur and a shark, especially the hammerhead shark, who uses the sensory organs on its head to sense its surroundings much like Gabite does. Gabite's behavior of collecting gems and treasures is reminiscent of European dragons, which are commonly depicted guarding a treasure hoard.", "/wiki/Golduck": "Golduck may be a combination of gold and duck. While Golduck itself is not colored gold, gold is often used to symbolize the psychic abilities: the Gold Gummi is the Gummi variety loved by Psychic-type Pokémon, and the Marsh Badge's Japanese name is \"Gold Badge\".", "/wiki/Greedent": "Yokubarisu may be a combination of 欲張り yokubari (greed) and 栗鼠 risu (squirrel).", "/wiki/Glimmora": "Kiraflor may be a combination of キラキラ kirakira (onomatopoeia for glittering), killer, and flor (Spanish and Portuguese for flower).", "/wiki/Garganacl": "Kyojiohn may be a combination of 巨人 kyojin (giant), 塩 shio (salt), and geo- (prefix for earth).", "/wiki/Gumshoos": "Gumshoos's Ultra Sun Pokédex entry seems to reference how the small Indian mongoose was introduced to Hawaii in order to counter the rat problems on sugar cane plantations, although the mongoose later became an invasive species.", "/wiki/Gothitelle": "Gothiruselle may be a combination of Gothic and mademoiselle (French for the title of miss).", "/wiki/Gigalith": "Gigalith debuted in Ash Versus the Champion!, where it was rampaging around a town. Alder managed to stop it with his bare hands, and then, he found out that the reason for Gigalith's rampage was a nail that had gotten stuck in the bottom of one of its feet.", "/wiki/Great_Tusk": "Great Tusk has a savage nature. The Scarlet Book, which named the creature, describes how it attacked an expedition team with its large body and tusks, fatally injuring one of the explorers in the process.[1] An article from a September issue of Occulture magazine describes Great Tusk as a mysterious life-form resembling Donphan, albeit one with gigantic tusks, tough scales, and an aggressive disposition. There is an unproven theory that Great Tusk is a living relic of the dinosaur era.", "/wiki/Gastrodon": "Tritodon may be a combination of Tritoniidae (family of shell-less marine gastropod molluscs) or Triton snail (marine gastropod mollusk named after Triton, Greek god of the sea), and don (Spanish for lord) or -don (common suffix in dinosaur names derived from the Ancient Greek word for tooth). It may also be derived from torito (Spanish for little bull).", "/wiki/Goomy": "Numera may be a combination of 滑る numeru (to be slippery) and ぬらぬら nuranura (onomatopoetic word for slimy).", "/wiki/Grumpig": "In VS. Grumpig I, a herd of wild Grumpig attacked Ruby and Sapphire, only to be promptly defeated by the former's Mightyena, Nana. This would turn out to be a critical development in the manga's plot, as it is through this that Sapphire grows aware of Ruby's real strength.", "/wiki/Gyarados": "Mega Gyarados' appearance bears similarities to the aforementioned koinobori. It also, specifically its large dorsal fins, resemble those of the unnamed \"legendary water Pokémon\" seen in the Pokémon anime episode Enlighten Up!, first aired on April 18, 2002. This creature may have inspired the design of Mega Gyarados when it was eventually created 10 years later.", "/wiki/Heliolisk": "Elezard may be a combination of elekiter, 襟巻蜥蜴 erimaki tokage (frill-necked lizard), and lézard (French for lizard).", "/wiki/Hydreigon": "Sazandora may be a combination of 三 san (three), 残忍 zannin (brutal) or 残酷 zankoku (cruel), and dragon or hydra.", "/wiki/Horsea": "Tattu may be derived from 竜 tatsu (dragon) or 竜の落し子 tatsu-no-otoshigo (seahorse, lit. \"illegitimate child of a dragon\").", "/wiki/Hitmonlee": "Sometimes referred to as the Kick Master, this flexible Fighting-type Pokémon can extend each leg to nearly twice its natural length. It can often be seen rubbing its legs down after a battle. In the original Super Smash Bros., it would shout to get itself pumped up and then launch fighters directly upward with a powerful kick.", "/wiki/Hatenna": "Each Pokémon in each evolutionary line has the same base stat total, base experience yield and catch rate as their counterpart (e.g. Hatenna and Impidimp both have a base stat total of 265), except for Hatenna and Impidimp's catch rate.", "/wiki/Hoppip": "Hanecco may be a combination of 葉 ha (leaf), 跳ねる haneru (to jump or hop), or 羽 hane (wing), and 根っ子 nekko (root). Its name may also be a pun on 猫 neko (cat), given its cat-like ears and tail.", "/wiki/Huntail": "Huntail may be a combination of hunt, 斑点 hanten (speck or fleck), and tail.", "/wiki/Hariyama": "Its ability to learn Brine and signature moveSmelling Salts may be a reference to the ritual of throwing salt before a match to purify the dohyō (wrestling ring), and ability to learn Whirlwind could be a reference to the god of thunder, Takemikazuchi, who is believed to have fought in the first recorded sumo wrestle. Many behaviours of Hariyama - attempting to derail trains with its punches, challenging larger Pokémon, and elderly Hariyama training younger Makuhita - is comparable to the Great Gama, a wrestler famed worldwide for his Herculean strength and 50-year win streak, who fought people much larger and older than himself from a young age, and, after retiring, threatened to stop a moving train with his bare hands in protest for free travel fees for impoverished people, and went on to train his nephew during his retirement years.", "/wiki/Hoopa": "Hoopa may be derived from hoop. It may also involve hoopla (something loud, attention-grabbing, and possibly misleading).", "/wiki/Ho-Oh": "Ho-Oh and Houou may be derived from 鳳凰 Hōō, Japanese reading of the Fènghuáng (Chinese phoenix). It may also be derived from 皇 ō (emperor) or 王 ō (king).", "/wiki/Herdier": "Herdier is very loyal, smart, friendly, and it will help its Trainer raise other Pokémon. However, it will not obey anyone who disrespects it. It has helped Trainers since long ago. Herdier has been theorized to have been the first Pokémon to have been partnered with humans based on what was discovered on the walls of caves. Its dense fur continues to grow endlessly. As Herider's fur grows, it becomes more springily and impervious. Any claws or fang attempting to penetrate its fur would just bounce off. However, the fur makes Herider difficult to train due to how much it costs to groom its dense fur.", "/wiki/Hypno": "Hypno was one of the first four Pokémon designs revealed when the Pokémon 151 brand was first announced. The shirt design features an image of Hypno swinging its pendulum from the left side of the shirt.", "/wiki/Hawlucha": "Hawlucha debuted in The Forest Champion!. Prior to his capture by Ash, Hawlucha was the champion of a forest. Later, Ash challenged Hawlucha to battle with the condition that if he wins, Hawlucha will join his team. Although Hawlucha didn't lose the battle, he decided to join Ash's team anyway.", "/wiki/Helioptile": "A very timid Pokémon that makes its home in arid deserts. The necktie-like frills on either side of its head can be stretched out to absorb sunlight, which Helioptile then uses to generate electricity. Thanks to this energy source, it can even survive without food. If your phone runs out of battery in the desert, why not ask this guy for help?", "/wiki/Heatmor": "Durant are the preferred prey of Heatmor. Heatmor expels flames from its mouth and uses it like a tongue, allowing it to burn through Durant's steel bodies before consuming their insides. It uses the hole in its tail to absorb air in order to keep its fire burning. Should the hole get blocked, Heatmor will become ill. In Generation VII, Fire Lash was its signature move.", "/wiki/Heatran": "Heatran may be derived from heat transfer. Its Japanese name may involve ドラゴン dragon.", "/wiki/Hatterene": "Hatterene's relatively small body, as well as the \"windows\" in its hair-like tentacles in its Gigantamax form, resemble the common fairy tale motif of a girl locked away in a tower; in particular, it may reference Rapunzel, a fairy tale recorded by the Brothers Grimm about a girl who was locked by a sorceress in a tower, and whose hair was long enough to reach the ground from the top of her tower.", "/wiki/Hoothoot": "Hoothoot is derived from hoot (the sound an owl makes).[2] It may also involve cuckoo, as in a cuckoo clock.", "/wiki/Houndour": "Houndour may be a combination of hound and dour (grim, dreary, severe).", "/wiki/Hitmonchan": "Based on its Japanese name and boxer aspects, Hitmonchan may represent the boxer Hiroyuki Ebihara. The colors of Hitmonchan's gloves in its normal and Shiny colorations might be a reference to the red corner and blue corner in boxing. Its Gold, HeartGold, Generation V, and XPokédex entries mention that it needs a short break after fighting for three minutes, which is a reference to the duration of rounds in boxing.", "/wiki/Houndstone": "Houndstone may be based on various long-haired dog breeds such as the Komondor or the Bearded Collie. Houndstone's skeletal appearance and typing may be based on depictions of the undead. The protrusion on its head resembles a headstone and a bone, while the raised portion of its body resembles a tumulus, a pile of earth placed over burial grounds. Houndstone may also be based on various of the numerous dogs from Spanish mythology and folklore, such as the Pesanta or the Dip, dog-shaped spirits from Catalan mythology known for draining human vitality.", "/wiki/Houndoom": "Hellgar may be a combination of hell and gar (Old English for spear; referring to its tail). It could also refer to Garmr, a hellhound in Norse mythology.", "/wiki/Honedge": "Hitotsuki may be a combination of 一つ hitotsu (one) and 突き tsuki (stab, lunge, or thrust) or 憑き tsuki (spirit possession).", "/wiki/Haxorus": "Haxorus may be a combination of hack (to chop or cut down), axe, -saurus (common suffix in names of dinosaurs and extinct reptiles derived from the Ancient Greek word for lizard), and possibly hazardous.", "/wiki/Hitmontop": "Kapoerer may be derived from capoeira, a Brazilian martial art that often involves spinning one's legs in the air.", "/wiki/Hippowdon": "Hippowdon may be a combination of hippopotamus, power, powder (as in sand), or pow (onomatopoeia for a bodily hit), and don (Spanish for lord; Ancient Greek for tooth).", "/wiki/Happiny": "All moves Happiny can learn by leveling up in Pokémon Legends: Arceus are moves it could not legally learn before by any means. The only other Pokémon with this distinction is Burmy, which only learns Struggle Bug by level-up in Legends: Arceus.", "/wiki/Haunter": "Haunter may be derived from haunt and the agentive suffix-er or possibly hunter.", "/wiki/Hippopotas": "Because of the spout upon its back that spits sand, Hippopotas and its evolved form may be based upon the legendary Bahamut; in some accounts of the myths behind it, it is said to support a bed of sand and have the head of a hippo.", "/wiki/Hattrem": "Hattrem resembles a witch, especially the common depictions wearing a witch hat. The fact that its \"hat\" is made of its hair may be based on the common belief in folklore that a witch's power is connected to their hair. Its appearance may also be based on a witch's ladder, which features knotted, corded, and/or beaded hair used to form a magic charm.", "/wiki/Hakamo-o": "Jyarango may derive from ジャラジャラ jarajara (onomatopoetic sound for jingling) and dragon.", "/wiki/Honchkrow": "Dongkarasu may be a combination of don (mafia boss) and 烏 karasu (crow).", "/wiki/Heracross": "Heracross and Heracros may be a combination of Hercules beetle (species of rhinoceros beetle named after the hero in the classical Greco-Roman mythology for its great strength), Ἡρακλῆς Hēraklēs (divine hero in Greek mythology who lent his name to his Roman mythological analogue), and cross.", "/wiki/Igglybuff": "Pupurin may be a combination of プチ puchi (petite) and プリン purin (pudding; referring to its soft body).", "/wiki/Iron_Bundle": "There are only two reported sightings of Iron Bundle. According to an article from an October issue of Occulture magazine, Iron Bundle was described in the Violet Book as a being that resembled Delibird possessing a spherical apparatus from which it would fire huge blasts of ice to propel itself through snowy lands. An unproven theory suggests it is the product of a long-gone civilization, as supported by ancient writings that describe the design and usage of machines resembling Iron Bundle.", "/wiki/Iron_Treads": "At some point, an Iron Treads escaped Area Zero and consumed some Herba Mystica, which caused it to become the Quaking Earth Titan, one of the Titan Pokémon found in the Paldea region.", "/wiki/Impidimp": "Beroba may be a combination of ベロ bero (tongue) and ベロベロバァ beroberobā (peekaboo).", "/wiki/Iron_Hands": "According to an article from a May issue of Occulture magazine, Iron Hands got its name from an iron-handed entity described in the Violet Book. It is said to have fists that move independent of its body and to be capable of throwing large, fast-moving vehicles. An unproven theory claims that Iron Hands was once an athlete who became mortally wounded but was kept alive by being made into a cyborg. It strongly resembles Hariyama, though why this is remains unanswered.", "/wiki/Iron_Moth": "Tetsunodokuga can be taken literally as 鉄の毒蛾 tetsu no dokuga (iron venomous moth).", "/wiki/Indeedee": "Yessan may be a combination of yessir and ～さん -san (honorific title). It may also be derived from \"yes, and...\".", "/wiki/Iron_Valiant": "According to an article from an April issue of Occulture magazine, Iron Valiant's name is borrowed from that of an object described in the Violet Book. An unproven theory claims that it is a robot built as the product of a mad scientist's efforts to create the most powerful psychic Pokémon. According to eyewitnesses, Iron Valiant is similar in appearance to both Gardevoir and Gallade. It is also said to be a cruel Pokémon, willing to take its shining blade and cut down anyone confronting it without hesitation.", "/wiki/Iron_Thorns": "According to an article from a June issue of Occulture magazine, Iron Thorns has been sighted in a certain cave in Paldea. It bears a strong resemblance to Tyranitar, although it is said to be coolheaded and prefers to avoid unnecessary fights. It appears to be highly intelligent and is speculated to be a Tyranitar as it would appear a billion years in the future. Its name is said to come from a similarly described entity appearing in the Violet Book.", "/wiki/Iron_Jugulis": "An article from a July issue of Occulture magazine describes Iron Jugulis as a flying life-form resembling Hydreigon that has allegedly been seen in a certain corner of Paldea. It was reported to have razed an entire building with a high-energy blast before flying off as if to find its next objective. Iron Jugulis is theorized to be a sort of machine-Hydreigon hybrid, as it combines Hydreigon's ferocity with the ruthlessness of a machine. It is said that it takes its name from a similarly described entity in the Violet Book.", "/wiki/Incineroar": "Official confidential art featuring Decidueye, Incineroar, Primarina, and Mallow was leaked on the Internet on June 4, 2016. This leak happened 145 days before these Pokémon were officially revealed on October 27, 2016.[2] From the leaked material, it is known that Incineroar's code name was \"トラ 3\", or \"Tiger 3\" during development.", "/wiki/Infernape": "Infernape may also be based on the Vanara — a race of monkey-like humanoids in the Hindu epic Ramayana — specifically Hanuman, who was granted immunity to fire and is believed to have influenced Sun Wukong. It may also be based on Monkey Kung Fu.", "/wiki/Illumise": "Illumise may be a combination of illuminate and luciferase (class of enzymes that produces bioluminescence).", "/wiki/Ivysaur": "Fushigisou may be a combination of 不思議 fushigi (strange; mysterious) and 草 sō (grass), as well as a pun of the phrase 不思議そう Fushigi sō (\"It seems strange\").", "/wiki/Inteleon": "Inteleon and Intereon may be a combination of intelligence and chameleon.", "/wiki/Iron_Leaves": "A part of each of their names could be considered a pun on their respective eras of existence: \"Wake\" can also refer to an emergence from sleep, or a beginning of time, while \"Leaves\" can also refer to an action of departure, or an ending of time.", "/wiki/Inkay": "In addition to Inkay's evolutionary method being unique, it would have been impossible in any of the previous core seriesPokémon games, because the Nintendo 3DS is Nintendo's first handheld system with an internal gyroscope.", "/wiki/Jumpluff": "The English names of Jumpluff and its pre-evolved forms were partially coined by Nob Ogasawara.[1][2]", "/wiki/Jigglypuff": "Purin may refer to プリン purin (pudding; referring to its soft body). It may also involve プチ puchi (petite) and pretty.", "/wiki/Jellicent": "Burungel may be a combination of ブルンブルン burunburun (onomatopoeia for shaking) and ゲル gel.", "/wiki/Jangmo-o": "While Jangmo-o trains diligently and remains humble, it has the pride of a warrior. It employs the scale on its forehead for both attack and defense, so it never shows its back to its foe. Many Trainers take this behavior as proof of this Pokémon's valiant nature. Jangmo-o lives and trains with others of its kind in harsh areas that are far away from other Pokémon and people.[1] The scales on its body make a metallic sound when struck and are used to express emotion, communicate with others of its kind, and intimidate opponents.", "/wiki/Jirachi": "Jirachi may be derived from желать zhelatʹ (Russian for to wish). It may also involve jinn or 幸 sachi (Japanese for fortune).", "/wiki/Jynx": "Jynx's revised coloring may be based on purple discoloration of the skin, a common symptom of frostbite. This fits with Jynx's Ice type and how it is found in very cold places.", "/wiki/Jolteon": "Jolteon may be a combination of jolt and eon (an immeasurably long period of time, possibly referring to how long evolution takes naturally). Eon is a suffix all Eeveeevolutions share and was Eevee's English prototype name.", "/wiki/Joltik": "At 4 inches (0.1 meters) tall, Joltik is one of the shortest Pokémon in existence. In fact, it is too small to generate its own electricity, so it attaches itself to larger Pokémon and feeds off their static electricity. More than often it prefers sticking on Yamper's hindquarters. It will also make its way into houses and feed off electricity in electrical sockets. All of the energy it absorbs it stores in an electric pouch on its body. As seen in the anime, Joltik is not especially aggressive, but will defend itself if bothered. It has been demonstrated that if Joltik is unable to find a source of energy, it will be unable to move and in serious danger.", "/wiki/Kricketot": "Korobohshi may be a combination of 蟋蟀 koorogi (cricket) and 起き上がり小法師 okiagari-kobōshi (traditional roly-poly Japanese doll).", "/wiki/Kabuto": "Omanyte and Omastar, Kabuto and Kabutops. It is believed these Pokémon became extinct tens of thousands of years ago. The detail of their behavior is shrouded in mystery. Though some have speculated that they may still exist, none of these Pokémon have ever been seen alive.", "/wiki/Kricketune": "Korotock may be a combination of 蟋蟀 koorogi (cricket) and tock (onomatopoeia of a ticking clock or metronome).", "/wiki/Kingambit": "Dodogezan may be a combination of ど do (very much), 土下座 dogeza (kneeling down on the ground), and 斬 zan (to cut or slay). ドゲザン Dogezan is also the Japanese name for its signature move, Kowtow Cleave.", "/wiki/Keldeo": "Keldeo may be a combination of kelpie (a water horse from Celtic folklore), kelda (Old Norse for well, spring), and rodeo (a sport involving skills with horses, cows, and other livestock). It may also involve dio (Italian for god).", "/wiki/Kakuna": "The \"arms\" on Kakuna seen in its Red and Blue sprite are commonly mistaken to be a sprite error, as they are rarely shown in any other media. They have so far only been shown on its Red and Blue sprite and a Pocket Monsters Bandai card.", "/wiki/Karrablast": "Kaburumo may be derived from 蝸牛被 maimaikaburi (Carabus blaptoides) and 甲虫 kabutomushi (beetle).", "/wiki/Kingler": "Its Gigantamax form may be based on Japanese spider crabs with a bubble beard, which may be a reference to the fact that crabs blow bubbles to keep oxygen flowing to the gills when they are out of the water. It also resembles a bearded king.", "/wiki/Koraidon": "Tsubasano'ou, its alternate name in Japanese, can be taken literally as 翼の王 tsubasa no ō (winged king).", "/wiki/Klefki": "Klefki may be a combination of clef (French for key), key, and possibly kleftis (Greek: Κλέφτης), (Greek for thief).", "/wiki/Klinklang": "PAL:From Klink to Klang to Klinklang, this Pokémon gets noisier with each evolution! It has a nice ring to it, though. Maybe all Pokémon should be named this way! Abra, Kadabra, Abrakadabra? Gible, Gabite...Gigabite? Err...Moving on! When it charges up energy, Klinklang spins the small cog with the red core at very high speeds.", "/wiki/Komala": "Komala appears to be based on a koala and their tendency of sleeping up to twenty hours a day. Given its constant sleep, the log it holds is likely meant to represent a body pillow or dakimakura. The log held by a Shiny Komala closely resembles a forest red gum, a common habitat for koalas.", "/wiki/Kirlia": "Kirlia may be derived from Kirlian photography (a special way of taking pictures that supposedly reveals psychic energy auras around subjects).", "/wiki/Koffing": "Considering its looks, its ability to float, and its tendency to explode, Koffing may have been based upon a floating naval mine or living meteorite. It is also based on smog and other forms of air pollution. Koffing may also be based on the imagined fear that heavy pollution, caused by the leakage and/or improper disposal of toxic and/or radioactive waste, may result in the creation of new and undesirable lifeforms. The symbol under its face resembles the skull and crossbones, a hazard symbol for poison.", "/wiki/Kartana": "Kamiturugi may be a combination of 紙 kami (paper), 神 kami (deity), and 剣 tsurugi (sword).", "/wiki/Krokorok": "Krokorok seems to be based on a crocodile, more specifically a slender-snouted crocodile and the nile crocodile. It could also be based on the Baryonyx, a fish-eating, slender-snouted dinosaur which heavily resembled a crocodilian. Its eyes, pose, and stripes make it appear to be a criminal, which is supported by its Dark type. It could also be a reference to Sobek, a half-crocodile deity also associated with violence and even robbery.", "/wiki/Kubfu": "Kubfu first appeared in PASS32. It was the \"secret armor\" of the Master Dojo, and was given to Trainers who complete the dojo's three trials. Despite this, Mustard decided to let it see the world alongside Casey, but she rejected the offer as she already had a full team. Mustard then allowed it to walk with Henry instead. Once Kubfu had finished its training and evolved into Urshifu, it officially joined Henry's team.", "/wiki/Kommo-o": "Kommo-o may be a combination of commotion (in reference to the noises produced by its scales) and mo'o (Hawaiian for lizard or dragon). It may also incorporate combat, commander, and komodo as in the Komodo dragon.", "/wiki/Kingdra": "Kingdra may be a combination of king and dragon or Hydra (a mythological sea creature).", "/wiki/Klang": "Klang debuted in White—Victini and Zekrom and Black—Victini and Reshiram alongside Klink and Klinklang; they are all under the ownership of Mannes. He used the three for various tasks, such as powering the music machine at Eindoak Town's Harvest Festival, doing yard work on his property, and powering his helicopter in the climax of the films.", "/wiki/Klawf": "Gakegani may be a combination of 崖 gake (cliff) and 蟹 kani (crab) or 毛蟹 kegani (horsehair crab).", "/wiki/Kilowattrel": "Kilowattrel may be based on a frigatebird. Like frigatebirds, Kilowattrel has a hooked beak, angular wings, and forked tail. Its large wingspan and size might also reference the fact that frigatebirds have the largest wing area to body ratio of any bird. Kilowattrel's throat sac also resembles the gular sac found on male frigatebirds. Much like its pre-evolution, it may also take inspiration from storm petrels.", "/wiki/Kabutops": "Kabutops may be derived from 兜蝦 kabutoebi (Triops), 兜 kabuto (helmet), Triops and -ops (common suffix in names of prehistoric animals derived from the Ancient Greek word for face).", "/wiki/Kadabra": "For possibly the same reason, Kadabra had not made any anime appearances since Fear Factor Phony aired in the United States in 2006, except a small cameo in the \"World of Pokémon\" opening of Kyurem vs. The Sword of Justice. Kadabra finally made its media reappearance in the Pokémon Evolutions episode The Show, its first animated appearance in over 16 years, excluding its cameo in the aforementioned movie. Notably, when Ash and his friends met Mira in the anime, she was seen using an Abra, whereas she has a Kadabra in the games, despite the fact that the other Stat Trainers in the anime own the same Pokémon as they do in the games.", "/wiki/Kecleon": "In an official trailer showcasing Kecleon's debut, Kecleon uses Meltan's cry even though the trailer does not use actual game footage.[3]", "/wiki/Kleavor": "Basagiri may be a combination of バッサリ bassari (with a single stroke), ばさら basara (acting without restraint; a term used during medieval Japan describing the disregard for the higher ranks), a corruption of berserker, 鉞 masakari (broadaxe), and カマキリ kamakiri (mantis).", "/wiki/Krookodile": "Krookodile may be a combination of corruptions of crook and crocodile.", "/wiki/Krabby": "In the wild, Krabby lives near the edge of water in both fresh and salt water. Krabby is most commonly found on beaches where it burrows in the sand. In times of scarce food sources, it may eat sand to regain nutrients and will be very aggressive in defending its home. Its main form of defense is creating foam to shroud its body, in order to confuse opponents into thinking that it is bigger than it actually is. As seen in the anime, Krabby generally keeps to itself, but will quickly defend itself if provoked. Prior to Generation III, Crabhammer was its signature move.", "/wiki/Kyogre": "Kyogre is a combination of 海 kai (sea) or 海王 kaiō (king of the sea) and ogre.[2] It may also involve orca (killer whale).", "/wiki/Kyurem": "Kyurem may be a combination of 冷 rei (cold), 零 rei (zero), 急冷 kyūrei (rapid cooling), or 雪 yuki (snow) with the kana reversed, and 無 mu (nothing). Rem may also mimic the rom of Zekrom and the ram of Reshiram.", "/wiki/Kangaskhan": "It may also be based on a tree-kangaroo given its stockier build, wider face, and larger nails in comparison to a terrestrial kangaroo, or the procoptodon, an extinct prehistoric genus of terrestrial kangaroo known for their short faces, specifically the species of P. goliah, the largest known kangaroo species to have ever lived.", "/wiki/Klink": "In Generation V games, Klink's battle animation shows that its faces spin at a greater speed than its gear teeth. This is inconsistent with its evolutions, whose gears and faces rotate at equal speeds.", "/wiki/Lugia": "Lugia may be derived from ἄργυρος árguros (Ancient Greek for silver). It may also involve beluga, deluge, and Lutīyā (early name for the Bahamut).", "/wiki/Linoone": "Massuguma may be a combination of まっすぐ massugu (straight, as in a line) and アライグマ araiguma (raccoon) or 穴熊 anaguma (badger). Guma (from 熊 kuma, \"bear\") as a suffix is often used for mammals that resemble bears.", "/wiki/Larvesta": "Larvesta's eyelids have been portrayed inconsistently throughout the series. In the anime, Larvesta's eyelids have a circular outline where their eye would be, something that is not present in any games. Mainline Pokémon games show Larvesta with black eyelids, while their portrait in Pokémon Super Mystery Dungeon instead features white eyelids.", "/wiki/Liepard": "Lepardas may be a combination of leopard and λεόπαρδος leopardós (Ancient Greek for leopard) or leopardus (Latin for leopard).", "/wiki/Lurantis": "Lurantis both looks and smells like a flower, a trait that it exploits to lure foes in for a surprise attack. Its brilliant coloration and elegant moves have earned it acclaim as the most glamorous Grass-type Pokémon. However, it does disguise itself as a Bug Pokémon for protection. Maintaining its appearance requires detailed grooming. If a Trainer does a good job caring for it, Lurantis will have an easier time trusting them than a lazy Trainer and have gorgeous, brilliant colors.[1]", "/wiki/Leafeon": "Leafeon may be a combination of leaf and eon (an immeasurably long period of time, possibly referring to how long evolution takes naturally). Eon is a suffix all Eeveeevolutions share and was Eevee's English prototype name.", "/wiki/Loudred": "Loudred seems to be based on a boombox (a portable music system that can play music at a relatively high volume) with ears resembling loudspeakers. It may also be based on a megaphone or an electronic amplifier since its tail resembles an input/output port. The curved yellow markings on its back resemble the stylized sound waves on a volume icon. Its mouth and teeth are reminiscent of the jaws of a hippopotamus.", "/wiki/Ledyba": "Ledyba and Rediba may be a combination of ladybug or ladybird and red.", "/wiki/Lileep": "Lileep may be based on crinoids (also known as sea lilies), extant marine animals. Crinoid fossils are particularly abundant, possibly inspiring Lileep's status as a fossil Pokémon. Its tentacles may be based on those of the sea anemone.", "/wiki/Ledian": "Ledian sleeps wrapped in leaves or grass in temperate and tropical forests during the day. At night, it flutters around scattering a glowing powder that is thought to bring good luck. It is believed to use starlight as energy and the patterns on its back grow larger or smaller depending on the number of stars in the sky. In addition to starlight, it loves to eat Berries. A weak fighter, it tries for quantity over power by throwing a barrage of punches with all four of its arms.", "/wiki/Litwick": "Hitomoshi may be derived from 火点し hi-tomoshi, which literally means \"lighting a lamp\" but can also refer to a person who leads a funeral procession with a torch. The name can also be interpreted as 人燃し hito-moshi (to burn a man to death).", "/wiki/Latios": "Latios may be a combination of lateō (Latin for I conceal, I lie hidden) and -os (Latin masculine suffix).", "/wiki/Lucario": "Lucario may be derived from the reverse of the Japanese transcription of orichalcum (a mythical metal) or oracle (referring to its supernatural abilities involving aura). It may also involve Canis lupaster lupaster (Egyptian wolf), λύκος lúkos (Greek for wolf), and possibly luchar (Spanish for to fight).", "/wiki/Lickilicky": "Berobelt may be a combination of べろ bero (colloquial term for tongue), ベロベロ berobero (onomatopoeia for licking), and べろっと berotto (licking or sticking out one's tongue).", "/wiki/Lycanroc": "The coloration of Dusk Form Lycanroc appears to be based on sunrises and sunsets. Its orange fur resembles the sky during these times, and its green eyes are possibly inspired by the rare optical phenomenon known as the green flash, a brief flash of green light that can sometimes be seen above the sun. This is supported by Dusk Form Lycanroc’s evolution method, and Ash’s Lycanroc in the anime evolving during a sunset in which a green flash is visible.", "/wiki/Lokix": "Lokix may be a combination of locust and kicks or crickets, or a pun on low kicks.", "/wiki/Litleo": "Litleo is a hot-blooded Pokémon that is curious by nature and is quick to start fights. In battle, its short mane radiates heat. The stronger its opponent, the more heat it produces. Litleo live in prides, where they are raised and taught to hunt by female Pyroar. When a wild Litleo is capable of hunting on its own, it is kicked out of the pride and begins to live alone. It lives in grassy plains and along cliff sides. In Generation VI, Noble Roar was its signature move.", "/wiki/Litten": "Nyabby may be a combination of ニャー nyā (meow), tabby, and 火 hi (fire).", "/wiki/Luvdisc": "Luvdisc is based on the discus fish and certain other species of fish that appear to kiss each other, such as the kissing gourami. It is shaped like a heart symbol. Its Shiny colors may be a reference to having a heart of gold, which signifies a person or being completely without malice, whose nature is loving or caring.", "/wiki/Lanturn": "Lanturn may be a combination of lantern and turn (as in \"turn on the light\").", "/wiki/Lillipup": "A Lillipup was one of the Pokémon employed by White in her BW Agency. Since the director asked for a Pokémon that can do stunts and Lillipup's silhouette showed up, Lillipup presumably is a stunt Pokémon for the Agency. It first appeared in Lights, Camera...Action.", "/wiki/Lechonk": "Lechonk may be a combination of lechón (Spanish for suckling piglet), oink (onomatopoeia for a sound pigs make), and possibly chonk (slang term for a fat or large animal).", "/wiki/Lickitung": "Lickitung may be based on lungless salamanders, some of which have projectile tongues and may secrete a sticky, irritating substance. It could also be based on lizards with long extending or projectile tongues like chameleons. Additionally, it may draw inspiration from the Akaname, a mythical yōkai with a single claw on each foot and a gigantic tongue. Akaname are known to lick filth out of bathhouses, similar to Lickitung's habit of licking dirty things clean.", "/wiki/Lopunny": "Lopunny may be a combination of lop (a breed of rabbit with ears that flop over rather than stand erect) and bunny.", "/wiki/Luxio": "Luxio may be a combination of lux (Latin for light), lynx, and lion or leo (Latin for lion). Incidentally, the Karnak temple complex in Luxor, Egypt has a famous avenue of sphinxes.", "/wiki/Lampent": "Lampent can sense when someone is about to die, whom it visits and steals the spirit from the person's body. Though most often found in deep forests, it quietly wanders through cities and hangs around near hospitals to absorb the spirits of the fallen. It also pretends to be a lamp while in cities. Because of this, Lampent is feared as the emissary of death. It uses the spirits it has absorbed to fuel its fire. On occasion, it has been known to work with Litwick to lead people to the Ghost World while stealing life energy.", "/wiki/Luxray": "Rentorar may be derived from レントゲン Röntgen (alternate name for the X-ray, named after its discoverer Wilhelm Röntgen) and 虎 tora (tiger).", "/wiki/Larvitar": "In Pinch Healing, a Larvitar was being babysat by a Poké-Sitter named Matt. Ash and his friends decided to help him with his job. The Larvitar was particularly shy and would use Sandstorm when confronted. By the end of the episode, however, it warmed up to the group, particularly May.", "/wiki/Lapras": "Laplace may be a reference to Pierre-Simon Laplace, a mathematician who wrote several books on the mathematical properties of the sea and tides. Alternatively, Laplace may be derived from la place (French for seat), referring to how passengers sit on its back like a seat to be ferried across bodies of water.", "/wiki/Landorus": "Landorus is considered the \"Guardian of the Fields\", due to helping crops grow. In Hisui, it had the title of god of fields due to it bringing life to the region along with Enamorus. Its tail causes the soil to gain nutrition. The energy from the tail is created by combining lightning and wind. It can also create powerful sandstorms on the few occasions it does fight. Landorus seems to live above the skies. Sometimes it stops on the Abundant Shrine in the Unova region or the Hisui region, but only when Tornadus and Thundurus are in the same place. Landorus can also stop and calm the two Forces of Nature whenever the two fight or cause destruction, thus being referred to by the grateful people as \"Great Landorus\". It is also known as the god of fields for bringing bountiful harvests in Therian Forme whenever it appears, usually after stopping Tornadus and Thundurus. It can travel through an entire region such as Hisui in just a few hours. Landorus can unleash mini sandy whirlwinds along with surrounding itself with a cloud shield to protect itself from harm.", "/wiki/Lilligant": "Lilligant is based on a lily. Atsuko Nishida mentioned in an interview that she came up with Lilligant while looking at lilies in her home.[1] Furthermore, Lilligant's design was intended to give the impression of an \"extravagant princess.\"[2] Its crown and dress may be derived from Western high-class women's fashion during 1750–1775. It could also be based on a ballroom dancer since its lower body resembles a ball gown, and several of the moves that it learns by leveling up contain the word \"Dance\".", "/wiki/Lunala": "Lunala may be a combination of luna (Latin for moon), ala (Latin for wing), and possibly lunula (which means something crescent-shaped).", "/wiki/Lumineon": "Lumineon are known to travel in schools, and although it can be found near the water's surface, it usually makes its home deep in the ocean, where it walks along the seafloor using the fins on its chest. This behavior helps it to avoid predators. Lumineon attracts its prey by flashing the patterning on its wing-like fins, although this behavior also attracts ferocious fish Pokémon that Lumineon itself is prey to. It typically competes with Lanturn for food, such as Staryu and Starmie.", "/wiki/Lunatone": "Lunatone seems to be based on a crescentmoon, as well as a meteorite. It might also pull from depictions of the Man in the Moon, a figure imagined from the patterns on the moon's surface, especially those of the crescent moon.", "/wiki/Latias": "Latias may be a combination of lateō (Latin for I conceal, I lie hidden) and -as (Latin feminine suffix).", "/wiki/Lotad": "In Oh Do You Know The Poffin Plan!, Forsythia's Lotad was the only one that knew her normally shy Roserade was the one secretly and fearlessly protecting her Berry garden. It later saved Forsythia from Team Rocket's mecha and then convinced Roserade to continue fighting Team Rocket without its red scarf — the only thing that gave it the confidence to act.", "/wiki/Ludicolo": "Runpappa may be a combination of ルンルン runrun (happy or bouncy) or rumba (a Cuban dance) and 河童 kappa or papaya (a green fruit native to Mexico).", "/wiki/Lairon": "Lairon smashes its steely body against others when battling over territory, and shows off its strength with the size of sparks it creates by ramming into rocks. Close inspection of Larion has revealed scratches and dents left on the armor from its conflicts. It drinks nutritious mineral spring water and feeds on iron contained in rocks. However it has gotten into conflict with humans over these territories in the past. It builds its nest on mountains where iron ore is buried, which results in it clashing with humans that are iron mining.", "/wiki/Leavanny": "Hahakomori may be a combination of 葉 ha (leaf), 母 haha (mother), and 子守 komori (babysitting).", "/wiki/Lombre": "Lombre is nocturnal - it will get active after dusk. It is also a mischief-maker. When this Pokémon spots anglers, it tugs on their fishing lines from beneath the surface and enjoys their consternation.", "/wiki/Mismagius": "Mumargi may be a combination of 夢魔 muma (nightmare; demon in a dream) and 蠱 maji (to bewitch), mage, or magic.", "/wiki/Mr._Mime": "Galarian Mr. Mime appears to be based on both tap dancers and ice skaters. The soles of its feet resemble tap shoes, the blue spots on the sides of its head resemble earmuffs, its fingers resemble mittens, and the ice on its chest resembles a necktie. Its round body is also reminiscent of a snowman.", "/wiki/Manectric": "Livolt may be a combination of 雷 rai (thunder), lion, live (electrically charged), and volt or bolt.", "/wiki/Minior": "Minior may be derived from meteor, and may involve any mixture of the words mini, minor, junior, armor, ore, and core.", "/wiki/Mankey": "Mankey may be a combination of man and monkey. It may also involve mad and cranky.", "/wiki/Meowth": "Meowth may be a combination of meow (the sound a cat makes), mouth, and wealth, alluding to the Maneki-neko's capacity to bring good fortune. The -th may also be borrowed from Nyarth, as both meow and nyā are onomatopoeia of a cat's cry.", "/wiki/Munchlax": "Gonbe may be a combination of カビゴン Kabigon (Snorlax), baby, and possibly a play on 権兵衛 Gonbē (common placeholder name for peasants in the old days).", "/wiki/Morgrem": "Gimoh may be a combination of 欺罔 gimō (deception), 毛 mō (hair, fur), and demon.", "/wiki/Magby": "Magby seems to be a combination of a booby or duck with a mythical salamander. The spike on its back gives it a resemblance to a baby iguana. Its face may also be based on Hyottoko masks, which resemble a man blowing fire through a bamboo pipe.", "/wiki/Meloetta": "Meloetta's Pirouette Forme resembles a ballerina wearing a tutu, with its \"hair\" curled up in a bun, or possibly the headdress worn by Nefertiti in her namesake sculpture. This Forme also has elements of Spanish Flamenco dancers.", "/wiki/Morpeko": "Morpeko may be a combination of モルモット morumotto (guinea pig) and 腹ペコ hara peko (hungry, starving).", "/wiki/Medicham": "Medicham resembles a primate of some sort, like its pre-evolved form. It appears to have been based on a practitioner of yoga. It may have also been based on Arabian belly dancers, as its pants resemble traditional badlah pants and its headgear resembles a shawl. One headpiece growth, the longest one, resembles a ponytail, which can be seen on Persian genies in most American fiction, such as Jeannie of I Dream of Jeannie, who also wear bedlahs.", "/wiki/Munna": "Munna may be a combination of 夢 mu (dream) and luna (Latin for moon). It may also involve mana, 花 hana (flower), muna (Finnish for egg), or むにゃむにゃ munya munya (Japanese onomatopoeia for indistinct mumbling, as if talking in one’s sleep).", "/wiki/Miraidon": "Tetsuno'orochi, its alternate name in Japanese, can be taken literally as 鉄の大蛇 tetsu no orochi (iron serpent).", "/wiki/Meganium": "Meganium has the appearance of a sauropod, particularly an Apatosaurus. Its flower seems to be based on a type of hybrid daylily with ruffled edges and its long neck makes it similar to the titan arum. It may also draw inspiration from geraniums, as suggested by its name. Meganium's design may have also been influenced by Aachenosaurus, an ancient plant whose fossils were once believed to belong to a dinosaur.", "/wiki/Mudbray": "Mudbray can be kept happy by giving it time to frolic in and consume mud. Mudbray's diet consists of eating dirt in order to create mud. It then regurgitated the mud in order to cover itself in it. Mudbray's mud won't dry out, even when exposed to sun for long periods of time. Denying it this will cause it to become stressed and disobey its Trainer. This Pokémon boasts immense strength for its size and is able to drag or carry loads up to 50 times its own weight. Mudbray are known to be skilled at using mud. The mud that collects around its hooves enhance its grip and power. Notably, it allows Mudbray to travel rough terrains without slipping. Because it was hunted nearly to extinction when it lived all over the world, it was believed for a time to run wild only in Alola.[1] Despite this, Mudbray have been seen roaming in Galar and Paldea, suggesting that its population is slowly recovering from near extinction.", "/wiki/Masquerain": "Masquerain seems to be based on a variety of insects. Although rarely shown, it apparently has the ability to walk on the surface of water using its wings as if they were legs, so it may be based on a water strider. Its Japanese name suggests inspiration from moths, many of which use eyespots to frighten would-be predators. Its habitat, translucent wings, and hovering flight pattern are reminiscent of dragonflies and damselflies. Its raindrop-shaped head resembles some lanternflies. Its mimicry of an angry face is similar to a mask or cat face.", "/wiki/Mudkip": "\"A Mud Fish Pokémon. It has fins on its head and tail. The fin on its head acts like a radar dish to read its surroundings, and its tail fin increases its swimming speed. The gills on its cheeks allow it to move about in water. It's very strong for its size--it can even lift big boulders. It burrows into muddy watersides to sleep. Mudkip evolves into Marshtomp.\"", "/wiki/Murkrow": "Yamikarasu may be a combination of 闇 yami (darkness) and 烏 karasu (crow).", "/wiki/Mareanie": "Mareanie is able to regenerate any body part overnight, except its head. The lost limbs have a very bitter, astringent flavor, and thus they cannot be eaten as food. Bruxish feeds on Mareanie, which in turn eats the branches of Corsola — except in Galar, where it has not yet learned to prey on them. Mareanie also eats broken-off Pincurchin spines, despite the risk of getting electrocuted. It uses the spike on top of its head to poison its prey and uses its tentacles to either trap its prey or deal the final blow. In the anime, it has also been seen attaching itself with all of its tentacles and releasing poison through its spines. The poison causes numbness and intense itching. Mareanie live in groups and are found in beaches and the bottom of oceans.", "/wiki/Meowscarada": "Masquernya may be a combination of masquerade and ニャー nyā (onomatopoeia for meowing).", "/wiki/Magearna": "Magearna may be a combination of machina (Latin for machine), mana, and gear.", "/wiki/Marowak": "Alolan Marowak's design may draw inspiration from a fire dancer holding a fire staff or a fire knife, a Samoan traditional dance implement. It may have also drawn inspiration from the Polynesian concept of mana, a spiritual essence that exists in all objects and people. It also allows people to imbue their \"spirit\" into other people and objects for protection or vengeance. In addition, Alolan Marowak may have been inspired by Nightmarchers, ghosts from Hawaiian mythology that march at night, are feared by the living, and traditionally are known for carrying torches as they march.", "/wiki/Metapod": "In the Space World '97 Super Game Boy demo version of Pokémon Gold, Metapod has a unique orange sprite that is exclusive to the demo.", "/wiki/Muk": "Alolan Muk may be based on an oil slick, particularly the rainbow colors that are produced when a thin layer of oil floats on top of water; this is due to a phenomenon called thin-film interference. In the real world, oil spills are a major threat to ecosystems in the world's oceans and particularly in Hawaii, which Alola is based on.", "/wiki/Mantyke": "Mantyke is the only Pokémon that requires a specific Pokémon (Remoraid) to be in the party in order to evolve it. This is based on the aspect of mutualism, a form of symbiosis in which two organisms depend on each other for survival.", "/wiki/Manaphy": "Manaphy may be a combination of mana (spiritual life force in Polynesian culture) and fay (fairy).", "/wiki/Mienfoo": "According to Ken Sugimori, Mienfoo and its evolution were created after the game planners requested for Fighting-type Pokémon based on animals, since most pre-existing Fighting-type Pokémon had been humanoid in appearance. Based on this, Mienfoo was designed after an ermine and a user of kung fu.[1] It may also be based on the kamaitachi, a weasel yōkai with sharp claws.", "/wiki/Magnemite": "In Generation V, Magnemite was the most traded Pokémon on the GTS. This is probably due to what is known as the Magnemite chain/coil: a scheme by which players could increase the number of visitors to their Join Avenue in Black 2 and White 2 by trading Magnemite on the GTS. The scheme originated with Japanese players and became popular worldwide.", "/wiki/Miltank": "Miltank acts as the milklady of Lively Town in Pokémon Super Mystery Dungeon and can often be found making her rounds in the city. After the story is cleared, she can be connected with the player and will be usable. It is also revealed that she has hired both Krookodile and Krokorok though the two often slack off during work.", "/wiki/Machoke": "In The Official Pokémon Handbook, Machoke is described as being extremely narcissistic; \"Machoke, [...]likes its own body way too much. Sometimes it's too busy looking at itself in the mirror to train\", which is exactly the opposite of the description given in Pokémon Stadium; \"Although it is incredibly strong, it is always modest\".", "/wiki/Magneton": "Magneton is a cluster of three Magnemite, which in turn seems to be based on the objectification of electromagnetism, one of the four fundamental interactions of nature, and it also seems to be inspired by an air drone. They are likely linked through strong electromagnetic force.", "/wiki/Mr._Rime": "Barrikohru may be a combination of barrier (referring to the invisible walls it can create) and 凍る kōru (to freeze).", "/wiki/Magmortar": "Magmortar may be a combination of magma and mortar (an artillery weapon).", "/wiki/Maushold": "Ikkanezumi may be a combination of 一家 ikka (family) and 鼠 nezumi (mouse).", "/wiki/Meowstic": "Nyaonix may be a combination of ニャー nyā or ニャーオ nyāo (meow) and onyx or ὄνυξ ónyx (Greek for claw), psionics, or Nyx (Greek goddess of the night).", "/wiki/Misdreavus": "Misdreavus may be a combination of mischievous and dream. It may also involve mistress, miscreant, dread, and dreary.", "/wiki/Mabosstiff": "Mabosstiff's appearance, combined with its name, Dark type, and protective nature towards its family, may be derived from the archetypal looks and behaviors of leaders in organized crime families, such as the Italian mafia and the Japanese yakuza. It also slightly resembles an old person because of the grey eyebrows and fur on its head and back.", "/wiki/Malamar": "Malamar may be a combination of mal- (Latin-derived prefix for bad), μαλάκιο malákio (Greek for mollusk), calamari, and mare (Latin for sea).", "/wiki/Magnezone": "Magnezone may be derived from magnetic zone, an alternative name for a magnetic field.", "/wiki/Mantine": "Mantain may be a combination of manta and brine or tine (point on an implement; branch on a horn).", "/wiki/Minun": "\"Cheering Pokémon. Plusle and Minun produce positive and negative energy, respectively. They both love cheering on their partners and place the encouragement of their partners over their own safety. To cheer, they short their electric currents to produce sparks that grow in intensity as their partners get into trouble.\"", "/wiki/Meltan": "Meltan may be a combination of melt, metal, and たん -tan (diminutive Japanese suffix). It may also be derived from molten.", "/wiki/Mamoswine": "Mammoo may be a combination of mammoth and ブーブー būbū (onomatopoeia for oinking).", "/wiki/Machop": "In Mashing Makuhita, a Machop was one of Brawly's Pokémon, which he sent out against Sapphire's Combusken, but it ended up overwhelmed by its speed. Much later, in Volume 20, Brawly was shown to own a Machoke, which appeared to have evolved from the same Machop.", "/wiki/Mienshao": "↑Creator profile on Megumi Mizutani in the Pokémon Trading Card Game Illustration Collection, p. 178: \"She was in charge of the design for Mienshao and Pancham, among other Pokémon, as well as the design of and official illustrations for Gym Leaders, Pokémon Trainers, and other human characters.\" (archive)", "/wiki/Mew": "Mew may be a combination of mutant or mutation and new. It may also involve 妙 myō (wonderful, exquisite).", "/wiki/Machamp": "Kairiky may be derived from 怪力 kairiki (superhuman strength), which is the name of its category in Japanese.", "/wiki/Maractus": "Maractus appears to be based on a flowering cactus, most likely the prickly pear, and a maraca. It also physically resembles a rabbit and may be a visual pun on the bunny ears cactus. It also seems to be based on traditional Mexican dress styles and, due to the fact that it dances and makes maraca-like sounds, may be based on Spanish dances, possibly the Mexican version of the Cuban son cubano.", "/wiki/Milotic": "Milokaross may be a combination of Venus de Milo and κάλλος kállos (Greek for beauty) or Charis (Greek goddesses of grace and beauty).", "/wiki/Mesprit": "Emrit may be a combination of M of the acronym UMA (Unidentified Mysterious Animal, wasei-eigo for cryptid) and spirit.", "/wiki/Mareep": "Mareep's wool grows continuously and stores electricity, rubbing together and building a static charge. Its volume increases when it builds up with electricity. Touching the wool when it is charged will result in a static shock. During the summer, the fleece is shed, but it grows back in a week. Air is also stored in its fur, which allows it to stay cool during summer and warm during winter. It tends to avoid battles in the wild and has a mild disposition. Mareep is most often found in grassy fields, though it can also be found in farms where its wool is used in high-quality clothing.", "/wiki/Mandibuzz": "Mandibuzz and Vullaby can be seen as counterparts to Braviary and Rufflet. Mandibuzz and Braviary share a base stat total of 510, evolve from their pre-evolved forms starting at level 54, and are both part Flying. Mandibuzz and Vullaby are exclusive to Pokémon Black, Black 2, Moon, Ultra Moon, and Shield, while Braviary and Rufflet are to Pokémon White, White 2, Sun, Ultra Sun, and Sword. Whereas Mandibuzz and Vullaby can only be female, Braviary and Rufflet can only be male.", "/wiki/Moltres": "Moltres may be a combination of molten and tres (Spanish for three, indicating that it is the third in the trio of KantoLegendary birds). It may also derive from molt.", "/wiki/Morelull": "Given that some of the foreign names of its evolution include the word \"lamp\", and that Morelull shine lights and put people to sleep, it may also be based on a nightlight. The connection between fungi and lights may be a pun on the homophonous Japanese words 発酵 hakkō (fermentation) and 発光 hakkō (luminescence) — Morelull and Shiinotic's Japanese category is はっこうポケモン Hakkō Pokémon.", "/wiki/Mightyena": "Mightyena's design appears to be based on a hyena — possibly a brown hyena — and also shares some similarities with wolves. The design may have been influenced by domestic breeds of dogs such as the German Shepherd and the Australian Kelpie, a breed with personalities that are heavily influenced by their owners. German Shepherds are also commonly colored black and gray.", "/wiki/Musharna": "Musharna may be a combination of ムシャムシャ mushamusha (onomatopoeia for eating), 夢 mu (dream), and luna (Latin for moon). It may also involve mana and 花 hana (flower).", "/wiki/Marshadow": "In Pokémon Scarlet and Violet, Shiinotic is defined internally as a Mythical Pokémon instead of Marshadow. This is likely due to a typo between their internal names, with マシェードMASHEEDO (Shiinotic) being mistaken for マーシャドーMAASYADOO (Marshadow).[1]", "/wiki/Marshtomp": "Marshtomp, the Mud Fish Pokémon. Marshtomp is the evolved form of Mudkip. Its body is enclosed in a membrane, allowing it to live on land. Its lower body is well-developed, so it's capable of walking on two legs.", "/wiki/Munkidori": "Mashimashira may be a combination of 増し mashi (better, improving) and 猿 mashira (archaic word for monkey or ape).", "/wiki/Magikarp": "Magikarp may be a combination of magic (referring to its drastic power increase upon evolving into Gyarados) and carp.", "/wiki/Monferno": "The flame on Monferno's tail has several purposes. Primarily, it can be controlled to keep opponents at an ideal distance or stretched in order to make Monferno appear larger. The size of its flame, in combination with the brightness of its facial marking, indicates this Pokémon's position in its pack. The bigger the flame and the brighter the pattern, the higher the Pokémon's position. In addition to using its flaming tail as a weapon, Monferno can also leap from ceilings or walls to perform aerial attacks.", "/wiki/Magmar": "Boober may be a combination of booby (another type of seabird) and a corruption of burn.", "/wiki/Mime_Jr.": "Mime Jr. is also reminiscent of an ice cream cone, with its pointy legs resembling a cone, its pink body and head resembling scoops of strawberry ice cream, its hat resembling a swirl of whipped cream, and its red nose and button resembling maraschino cherries.", "/wiki/Mudsdale": "Mudsdale is known for both its powerful body and emotional fortitude, which prevents it from becoming agitated. Regardless of the trouble it is in, it will never cry out and defeats opponents with a single blow.[1] The mud around its legs gives its kicks extra force; one kick can turn a car or large truck into a scrap pile. When galloping, its hooves can dig holes in asphalt. While it is not swift, it has excellent stamina and can continue on for three days and three nights while dragging over 10 tons. It will mix dirt and saliva to create a special mud with resistance to both wind and water. The mud is also harder than even stone. Because of its unique qualities, the walls of some old houses were coated with Mudsdale's mud. Mudsdale is highly treasured for both physical labor and pottery made from its high-quality mud.", "/wiki/Mawile": "Mawile may be a combination of maw (jaws of a voracious animal) and wile (cunning stratagem) or smile.", "/wiki/Mothim": "While Mothim represents the adult stage of a bagworm moth, which only fully matures if it is male, both its appearance and honey-thieving tendencies suggest that it may draw more inspiration from death's-head hawkmoths. It may also draw some inspiration from the Pyraloidea, a superfamily of moths known for their nose-like palps.", "/wiki/Meditite": "Asanan may be derived from asana (body posture in yoga) and possibly 軟 nan (soft, flexible).", "/wiki/Mimikyu": "Mimikyu and Mimikkyu may be derived from mimic and きゅうきゅう kyūkyū (onomatopoeia for squeaking, similar to Pikachu). It may also involve a corruption of 迷宮 meikyuu (mystery).", "/wiki/Maschiff": "Orachifu may be a combination of オラつく oratsuku (slang word to describe a rude or irreverent person) and マスチフ masuchifu (mastiff).", "/wiki/Metagross": "Metagross is the result of two Metang achieving fusion. When hunting, this Pokémon pins the prey to the ground under its massive body. It then eats the helpless victim using the large mouth on its stomach.", "/wiki/Milcery": "Rainbow Swirl Alcremie after spinning counterclockwise for more than 10 seconds during the evening (between 7:00 and 7:59PM in real-time in Pokémon Sword and Shield).", "/wiki/Magcargo": "Magcargo and Magcargot may be a combination of magma, escargot (French for snail), and cargo.", "/wiki/Mewtwo": "In Pokémon Gold, Silver, and Crystal, wild Mewtwo are programmed to always be holding a Berserk Gene, but since Mewtwo can't be found in the wild in those games, the item cannot be obtained that way. Even if it could be found in the wild, the item would be consumed immediately, so it still wouldn't be obtainable from Mewtwo.", "/wiki/Marill": "Marill and Maril may be a combination of mar (Spanish and Portuguese for sea) or 丸い marui (round or circular) or 鞠 mari (ball), 瑠璃 ruri (lapis lazuli), and possibly rill (a small river or brook) and マリンブルー marine blue.", "/wiki/Minccino": "Minccino may be a combination of mini (referring to its miniature size), mink (an animal known for its fur and its use in women's clothing), or mince (to make smaller), and chinchilla or chino cloth. The suffix -ino or -cino is also a diminutive to denote something small.", "/wiki/Metang": "Although it is said that Metang is made up of two Beldum, there is no visible evidence of this. In Saved by the Beldum, the only anime episode to date showing a Beldum evolution, when Morrison's Beldum evolves into Metang, it \"creates\" another Beldum and newly developed main body to evolve, instead of fusing with another Beldum. Likewise, if a Metang evolution is shown, it is highly unlikely it would involve two Metang evolving together. This is similar to the games.", "/wiki/Melmetal": "Melmetal has similar design aesthetics to its pre-evolution, Meltan. Its head and features resemble hexagonal nuts, and its tail resembles an exposed wire. Its body may be based on either gallium or mercury; both are metallic elements with relatively low melting points (gallium melting at 86 °F (30 °C) and mercury being liquid at room temperature), both can conduct electricity, and both can easily react with many other metals to form alloys and amalgams. Additionally, Melmetal and its Gigantamax form may have been based on the Cyclops.", "/wiki/Makuhita": "Makuhita and Makunoshita may be corruptions of 幕下 makushita (the third-highest sumo division).", "/wiki/Nidoqueen": "Nidoqueen may be a combination of needle and queen. It may also involve 二度 nido (twice).", "/wiki/Naclstack": "Naclstack attacks by pressing the rock salt inside its body into hardened pellets, which it then shoots out with enough force to puncture an iron sheet. Naclstack also uses its salt to dry out and cure its prey. Naclstack leaves behind bits of salt on its footprints as it walks; these salt grains are gathered by people and used as seasoning for sandwiches.", "/wiki/Necrozma": "Necrozma may be a combination of νεκρός nekrós (Ancient Greek for dead), 黒 kuro (black), and πρῖσμα prîsma (Ancient Greek for prism) or plasma (state of matter most commonly found in stars). It may also involve Project Ozma, an experiment made to search for extraterrestrial life.", "/wiki/Nidoking": "In A Pyramiding Rage!, Paul used a Nidoking to battle Brandon's Registeel. Although Nidoking was powerful and versatile, Registeel was still able to hold its own and eventually brought down Nidoking.", "/wiki/Ninjask": "Ninjask appears to be based on an adult cicada, with its colors resembling a bush cicada. As its species name implies, it may also be based on a ninja due to its name, quick movement, and natural ability to learn Double Team by leveling up (a common ninja technique in Japanese media) and various cutting attacks. This combination may be further inspired by stories of ninjas using cicadas to mask their own sounds, or a reference to the utsusemi no jutsu (cicada skin technique), a technique using decoys to misdirect opponents.", "/wiki/Numel": "Numel's evolutionary line may be considered a counterpart of Carvanha's evolutionary line. Both of them are dual-type Pokémon, both lines have identical base stat totals per evolutionary stage, both of their final evolutions are used by Team Magma Leader Maxie and Team Aqua Leader Archie, respectively, and both of their final evolutions can Mega Evolve.", "/wiki/Nincada": "Nincada appears to be based on a cicadanymph. Its association with ninjas may be inspired by stories of ninjas using cicadas to mask their own sounds, or a reference to the utsusemi no jutsu (cicada skin technique), a technique using decoys to misdirect opponents.", "/wiki/Nacli": "Kojio may be a combination of 小 ko (small) or 子 ko (child), 塩 shio (salt), and geo- (prefix for earth).", "/wiki/Nidoran%E2%99%80": "Nidoran♀ may be derived from needle with ♀ as an indication of its female gender. It may also involve 二度 nido (twice).", "/wiki/Nickit": "Kusune may be a combination of くすねる kusuneru (to pilfer) and 狐 kitsune (fox).", "/wiki/Noibat": "Noibat may be based on a bat, and the design of its ears may be based on speakers.", "/wiki/Natu": "In The Escape, Will is seen to have a Natu during Silver's flashback of his escape from the Masked Man. It is probably a pre-evolution of the Xatu he used many volumes earlier.", "/wiki/Nidorino": "Nidorino debuted in A Glimpse of the Glow, where Red caught him to show to the Pallet Town children how to catch a Pokémon. As well as another one appeared in Red's explanation fantasy about Pokémon to them.", "/wiki/Ninetales": "Kyukon may be a combination of 九 kyū (nine) or 九尾狐 kyūbiko (nine-tailed fox) and こん kon (onomatopoetic sound of a fox's cry). It may also involve 旧恨 kyūkon (old grudge) and 焜炉 konro (gas stove).", "/wiki/Nymble": "When threatened, Nymble can jump to a height of over 30 feet (10 meters). Its jumping capabilities allow it to dodge attacks while dealing damage.", "/wiki/Nidorina": "Nidorina is a gentle Pokémon, and it is known to be a caring mother that chews food for its young. It seems to display close family bonds with others of its kind, and becomes nervous when separated. Nidorina prefers not to fight since its horn grows slowly, but if forced or enraged, it prefers physical attacks such as clawing and biting. Nidorina prefers to chew its food into a paste before spitting it out and feeding its children. It also emits ultrasonic cries to befuddle foes. Nidorina live in burrows at hot savannas and plains.", "/wiki/Noctowl": "Noctowl seems to be based on a horned owl, particularly the Eurasian eagle-owl due to its red eyes. The feathers that make up its \"horns\" also resemble a pair of large, bushy eyebrows, which can be interpreted as a sign of age and wisdom, traits that are sometimes associated with owls. This association with wisdom may also explain its ability to learn various Psychic-type moves.", "/wiki/Naganadel": "Naganadel may be based on a Western dragon or wyvern, a kind of dragon that possesses two arms and wings. Its abdomen resembles that of a wasp. Specifically, it could be based on the tarantula hawk or Ichneumonidae family of wasps. Its Shiny coloration may reference wasps such as the yellowjacket. Like its pre-evolution, its needle-like appendages resemble the needle of a syringe, with the abdomen representing the barrel or tube and the venom representing the liquid inside.", "/wiki/Nosepass": "Nosepass may be a combination of nose or a corruption of north and compass. NOSE is also a mnemonic for the cardinal directions in French (nord, ouest, sud, est).", "/wiki/Nuzleaf": "Konohana may be a combination of 子 ko (child), 木の葉 konoha (leaves), and 鼻 hana (nose).", "/wiki/Nihilego": "Uturoid may be a combination of 虚ろ utsuro (void), void, and id. It might also refer to 鬱 utsu (depression), 移ろい utsuroi (transience), and the suffix -oid (meaning \"of similar form\").", "/wiki/Nidoran%E2%99%82": "Nidoran♂ may be derived from needle with ♂ as an indication of its male gender. It may also involve 二度 nido (twice).", "/wiki/Noivern": "A Noivern appeared in the Hoopa's Surprise Ring Adventures short Wake Up, where it was among the Pokémon summoned by Hoopa to use their sound-based attacks to wake Ash, but to no avail. Two other Noivern appeared in the short In the Dark, where they were among the Pokémon rudely awakened by Hoopa's summoning of multiple Litwick.", "/wiki/Omastar": "Omastar may be a combination of its Japanese name, a phonetic anagram of ammonite, and star, for its body shape and five-pointed shell.", "/wiki/Omanyte": "Omanyte and Omastar, Kabuto and Kabutops. It is believed these Pokémon became extinct tens of thousands of years ago. The detail of their behavior is shrouded in mystery. Though some have speculated that they may still exist, none of these Pokémon have ever been seen alive.", "/wiki/Orthworm": "Orthworm is a long, worm-like Pokémon with a six-segmented metal body. Its body is red on top and light orange on the bottom, except for its second segment, which is steel-colored. The first segment is its head, which contains its small, pale blue eyes and a large, toothless mouth. There are pairs of cyan ovals lining either side of its body from its third to fifth segments, while its second segment has three of such pairs. Tendrils can extend from the ovals on its second segment, which resemble simple fists. When threatened, Orthworm uses these tendrils to punch its opponents. Orthworm lives in dry deserts, and eats iron from the soil to maintain its body. It is sometimes seen buried in the ground, with only its head visible.", "/wiki/Oranguru": "Yareyuutan may be a combination of やれ yare (\"Do it\") and オランウータン oran'ūtan (orangutan).", "/wiki/Oricorio": "Odoridori may be a combination of 踊り odori (dance), 鳥 tori (bird), and 色とりどり irotoridori (varicolored).", "/wiki/Octillery": "Octillery is normally found in oceans and caves. For a long time, people refused to believe Octillery was an evolution of Remoraid, because of the extreme physical differences between the two. It is thought to be a distant relative to Omastar. In New Pokémon Snap, an Octillery can be seen about to be preyed on by a Seviper.", "/wiki/Oshawott": "Mijumaru may be a combination of 水 mizu (water) or 未熟 mijuku (naive or immature) and 丸 maru (round; a common suffix in male Japanese names). According to Ken Sugimori, suffixes such as -maru or -suke were considered for Oshawott's Japanese name to make it sound more typically Japanese.[5]Miju may also refer to an otter named Mijbil, the subject of an autobiographical novel and movie called Ring of Bright Water.", "/wiki/Oddish": "Oddish may be derived from oddish (somewhat odd) or a combination of odd (strange) and radish.", "/wiki/Oinkologne": "Oinkologne may be a combination of oink (the sound a pig makes) and cologne. It may also involve bologna, a type of pork meat.", "/wiki/Okidogi": "Iineinu may be a combination of いいね ii ne (interjection to express approval) and 犬 inu (dog).", "/wiki/Obstagoon": "Tachifusaguma may be a combination of 立ち塞ぐ tachifusagu (to obstruct) and 穴熊 anaguma (badger). Guma (from 熊 kuma, \"bear\") as a suffix is often used for mammals that resemble bears.", "/wiki/Ogerpon": "Ogerpon may be derived from ogre and ～ぽん-pon, a cutesy suffix applied to names as a form of endearment.", "/wiki/Overqwil": "Haryman may be derived from ハリーセン Harysen (Qwilfish) or 針千本 harisenbon (porcupinefish), with the 千 sen (thousand) part replaced with 万 man (ten thousand or myriad), continuing the numerical theming.", "/wiki/Onix": "Onix's design may be a visual pun on a rock python or an earthworm. Its great size could have been inspired by the Mongolian death worm, an earthworm-like creature noted for its colossal length (compared to regular worms) of up to 7 feet. The Onix lifestyle, living underground and ingesting massive amounts of soil while tunneling, is much closer to the earthworm lifestyle than the snake lifestyle. Earthworms eat soil and digest the organic material it contains (plant matter, living protozoa, rotifers, nematodes, bacteria, fungi, and other microorganisms).", "/wiki/Orbeetle": "The mind control aspect specifically could reference Dinocampus coccinellae, a wasp that lays its eggs on ladybugs. As the wasp's larva hatches and pupates, it releases a virus that paralyzes its host ladybug, controlling the ladybug into protecting it from predators; the ladybug in this state is often compared to \"zombies\" in many studies. Additionally, the adult of this wasp has bright blue-green eyes and a thin body, like Orbeetle but unlike ladybugs.", "/wiki/Pidgey": "In File 1: Red, a Pidgey was in Professor Oak's introduction; Red encountered a second and, using his Charmander, tried battling it, but it managed to get away; and a third was shown getting registered in Red's Pokédex.", "/wiki/Pignite": "Ken Sugimori has said that Tepig, Pignite, and Emboar were designed in a Chinese style.[1] Because of this, they may be based on Zhu Bajie, a pig demon from the Chinese tale Journey to the West. Servine, Pignite, and Dewott's evolutionary lines are collectively based on Western, Chinese, and Japanese culture respectively, to represent the diversity of the Unova region.[1]", "/wiki/Piplup": "Pochama is derived from ぽちゃぽちゃ pochapocha (the sound of a pebble splashing in water).[2] It may also incorporate 坊っちゃま botchama (young master).", "/wiki/Passimian": "Nagetukesaru may be a combination of 投げつける nagetsukeru (to throw) and 猿 saru (monkey).", "/wiki/Pidove": "Pidove is not particularly intelligent. While it always listens to its Trainer's commands, it does not always understand them. Pidove are so forgetful that they will wait for new orders from their Trainers even if it received one right before; in Detective Pikachu, their forgetfulness extends to them not even remembering their own names, while in the anime, it extends to forgetting whatever scared them. Many Trainers love Pidove due to its friendliness and sincere nature. Pidove loves to follow people. Having no fear of people, flocks of Pidove are often found in city parks and plazas, though they can also be seen in grasslands and rural areas. The cooing of these flocks can be very noisy. About several hundred Pidove are known to gather when food is scattered on the ground for them.", "/wiki/Pinsir": "Pinsir can also be seen as a counterpart to Heracross. Both are Bug-type Pokémon based on beetles and lack an evolutionary family. Pinsir is not part Fighting like Heracross, but it learns several Fighting-type moves by leveling up. Both Pokémon and their Mega Stones are version exclusives in X and Y: Pinsir and Pinsirite are exclusive to X while Heracross and Heracronite are exclusive to Y. Each Mega Stone can be found in Santalune Forest in its respective version. The heights of both Pokémon are the same, even when Mega Evolved. The Pokémon are also version exclusives in the Pokémon Sword and Shield Expansion Pass. Pinsir can be found on the Isle of Armor if playing Sword, whereas Heracross can be found in its place when playing Shield.", "/wiki/Plusle": "\"Cheering Pokémon. Plusle and Minun produce positive and negative energy, respectively. They both love cheering on their partners and place the encouragement of their partners over their own safety. To cheer, they short their electric currents to produce sparks that grow in intensity as their partners get into trouble.\"", "/wiki/Poliwhirl": "Nyorozo may be a combination of ニョロニョロ nyoronyoro (onomatopoeia for wriggling) and 小僧 kozō (youngster).", "/wiki/Parasect": "The fungus on Parasect is identified as tochukaso. Tochukaso is the Japanese name of the real-world fungus Ophiocordyceps sinensis, an endoparasitoid that replaces the host tissue and can affect its behavior. It may also draw inspiration from Massospora, a genus of fungi which include species that specifically infect cicadas.", "/wiki/Pineco": "Kunugidama may be a combination of 椚木 kunugi (sawtooth oak) and 玉 tama (ball).", "/wiki/Porygon2": "Representing the next step in technological progress, this Virtual Pokémon is a higher-powered version of the man-made Pokémon, Porygon. Compared to the sharp edges of its relative, Porygon2's body is extremely smooth and rounded. In battle, it utilizes a special move called Conversion 2 to alter its type.", "/wiki/Pansear": "Pansage, Pansear, and Panpour were specifically created as partner Pokémon for Cilan, Chili and Cress, the Gym Leaders of Striaton Gym. As Striaton Gym doubles as a restaurant, these Pokémon were designed around cooking as a theme, and their hands were designed to resemble oven mitts.[1] Additionally, Pansear, along with its two contemporaries, seems to be inspired by the three wise monkeys motif; with its hand by its ear, Pansear represents \"hear no evil\".", "/wiki/Pidgeot": "Pidgeot is depicted with red-and-yellow tail feathers in its official Generation I artwork, while the Generation III artwork depicts red ones only. This discrepancy is expressed in numerous ways in Pidgeot's in-game sprites and anime depictions.", "/wiki/Pangoro": "↑Creator profile on Megumi Mizutani in the Pokémon Trading Card Game Illustration Collection, p. 178: \"She was in charge of the design for Mienshao and Pancham, among other Pokémon, as well as the design of and official illustrations for Gym Leaders, Pokémon Trainers, and other human characters.\"", "/wiki/Prinplup": "Prinplup has a high sense of self-pride, which prevents it from forming groups of its own kind. This Pokémon can be found in icy waters, where it hunts for prey. Prinplup can swim gracefully in the cold seas. Its singing voice has been compared to a roaring tide.", "/wiki/Purugly": "Purugly attempts to make itself look larger and more intimidating by cinching its waist with its forked tail. It barges into the nests of other Pokémon and frightens them off so Purugly can claim the nest as its own. It does this by glaring with its eyes ceaselessly. It can be found in both urban areas and heavily wooded forests. Despite its disrespectful and scary nature, Purugly is rather popular. The reason is due to its beautiful fur, more comfortable than even velveteen.", "/wiki/Poliwag": "Generation V changed Poliwag's base Experience yield from 77 to 60, making it the only Pokémon whose base Experience yield is the same as its National Dex number.", "/wiki/Porygon": "In a 1997 interview with the magazine Famimaga 64, Satoshi Tajiri stated that Porygon was created out of irony. According to him, during the development of Pokémon Red and Green, people kept telling him that he was too late on making a game for the Game Boy, and that he should start making games with 3D polygonal graphics for next generation consoles. As a result, he included Porygon, a Pokémon made out of polygons, in the sprite-based Pokémon Red and Green, hence the irony.[2]", "/wiki/Pikachu": "Nishida named the Pokémon Pikachu \"without giving it much thought\", and while it wasn't originally intended to be based on a mouse, Game Freak CEO Satoshi Tajiri made the decision to base it on such. During the process of making Pikachu \"cuter\", as per the instructions of game designer Kōji Nishino, Nishida added cheek pouches for it to store electricity in. These were inspired by squirrels, which store food in their cheeks. Pikachu's yellow colouration and lightning bolt-shaped tail were given to express Pikachu's electrical attributes and make its type easier to recognise and understand. According to Nishida, Pikachu's stripes aren't based on anything in particular, and were added to fill the empty space on Pikachu's back, as it is always visible during battle.[5][10]", "/wiki/Pawniard": "Komatana may be a combination of 駒 koma (a piece in the board game Shogi), 細切れ komagire (small pieces), and 刀 katana (sword) or 小刀 kogatana (knife).", "/wiki/Paras": "Paras may be derived from parasite, referring to the parasitic mushroom growing on its back.", "/wiki/Phione": "Phione may be a combination of Manaphy and Clione (genus of floating sea slugs).", "/wiki/Pincurchin": "Bachinuni may be a combination of バチン bachin (onomatopoeia for crackling electricity) and 海胆 uni (sea urchin). It may also be derived from バフンウニ Bafun uni (Hemicentrotus pulcherrimus), which is one of the most popular species of sea urchins.", "/wiki/Poliwrath": "Nyorobon may be a combination of ニョロニョロ nyoronyoro (onomatopoeia for wriggling) and 坊 bon (boy).", "/wiki/Palafin": "Irukaman may be a combination of 海豚 iruka (dolphin) and man, which is often used as a suffix for superhero codenames.", "/wiki/Pawmi": "Pamo may be a combination of パチパチ pachipachi (onomatopoeia for electric crackling), palm, marmot, dynamo, and mho (unit of electric conductance).", "/wiki/Petilil": "Petilil and Cottonee can be seen as counterparts. They both evolve once using a Sun Stone and share a base stat total of 280. Additionally, Petilil is exclusive to Pokémon White, White 2, Moon, and Ultra Moon, while Cottonee is exclusive to Pokémon Black, Black 2, Sun, and Ultra Sun. They also have similar movesets.", "/wiki/Phantump": "Bokurei may be derived from the on readings of the kanji in 木霊 kodama, resulting in a combination of 木 boku (wood, tree) and 霊 rei (spirit, ghost).", "/wiki/Pichu": "Pichu may be a combination of ピカピカ pikapika (onomatopoeia for sparkling), チューチュー chūchū (onomatopoeia for the squeak of a mouse), and possibly プチ puchi (petite), as well as being a contraction of Pikachu.", "/wiki/Primarina": "Official confidential art featuring Decidueye, Incineroar, Primarina, and Mallow was leaked on the Internet on June 4, 2016. This leak happened 145 days before these Pokémon were officially revealed on October 27, 2016.[2] From the leaked material it is known that Primarina's code name was \"アシカ 3\", or \"Sea Lion 3\" during development.", "/wiki/Pupitar": "While its arms and legs are developing inside the shell, Pupitar uses compressed gas to propel itself around, and can generate enough force to knock down mountains. Pupitar lives and moves freely around harsh mountain ranges.", "/wiki/Palossand": "Palossand has been referred to as the \"Beach Nightmare\". Palossand has the power to control the sand, and each grain of its body has a will of its own. It controls adults to make them build its sand castle body, which provides it a disguise and defense. However, unlike Sandygast, Palossand is able to replenish any sand it loses on its own. The shovel on Palossand's head rotates when it searches for prey and is believed to function as a radar. Palossand enjoys the life force of Pokémon, and creates a sandy vortex to capture small Pokémon before draining their vitality. The bones of Palossand's victims are kept buried beneath it, and traces of its victims' ill will are left wherever it passes. These traces of negative energy are said to be the genesis of new Sandygast.[1] Palossand is able to fire the bones it keeps within from the hollows in its arms. As seen in the anime, Palossand can manipulate its size and grow to the size of a building. Palossand can be found at beaches; however, it hates the water. It cannot maintain its castle-like shape during heavy rain storms.", "/wiki/Porygon-Z": "Porygon-Z is a combination of a corruption of polygon and the letter Z, the latter referring to either the Z axis in a 3D coordinate system, or the fact that it is the final stage in its evolutionary line, with Z being the final letter of the Latin alphabet. Z could also be a corruption of the number 2, referring to its status as a glitched evolution of Porygon2.", "/wiki/Pachirisu": "When it sleeps, Pachirisu likes to curl its big, fluffy tail round to the front of its body and uses it as a pillow. It also likes to chase and groom its tail. When a Pachirisu sheds its fur it shapes them into furballs, which have static charges just like its fur. It hides its favorite foods—which mainly consist of berries—in these static puffs and stores them in tree holes. It does this to protect the food; if a human or another Pokémon tries to take the food, they will get shocked from the static. It may rub cheek pouches with another Pachirisu to share stored electricity. It is generally found in treetops in forests, as well as the outskirts of a forest and near power plants.", "/wiki/Poipole": "Bevenom is a combination of baby or bébé (French for baby) and venom.[5]", "/wiki/Psyduck": "A herd of Psyduck appeared in Suffering Psyduck, where they were blocking the route to Celestic Town. However, included among them were Psyduck belonging to Trainers, and this was all a ruse by Team Galactic, which Cynthia catches on to shortly after calming them.", "/wiki/Perrserker": "Perrserker appears to be based on a cat and the stereotypical image of Vikings. Its behavior may be based on that of the berserker. It may also be based on Freyja's cats gifted by Thor, commonly named Bygul (honey) and Trjegul (amber), which pulled her chariot. Both its regular and Shiny coloration could be a reference to these names. Its Steel-typing may refer to the Vikings' use of iron in their weapons and helmets. Another possible basis, considering its horn-like ears and connection to Vikings, may be the Norwegian forest cat, a breed of cat from Scandinavia noted for its long, tufted ears and fluff. The creature's grin also brings to mind the Cheshire Cat.", "/wiki/Palpitoad": "Palpitoad and Tympole's designs were worked backwards from Seismitoad's design.[1]", "/wiki/Polteageist": "Polteageist's forms may be based on porcelain forgeries. One way porcelain makers historically combatted forgeries was to create a stamp of authenticity on their products, hence the stamp under Antique Form Polteageist.", "/wiki/Pumpkaboo": "Bakeccha may be a combination of お化け obake (ghost) and 南瓜 kabocha (pumpkin).", "/wiki/Phanpy": "Phanpy is found in rocky terrain. To make its nest, it digs a vertical pit near the edge of a river. It displays ownership of this area by marking it with its trunk. In the deserted morning hours, Phanpy uses its trunk to shower in the river. Sometimes, groups of this Pokémon form and soak each other thoroughly. Afterwards, it can be seen drying its body near the edge of the river. The reason is Phanpy won't settle down until it is clean.", "/wiki/Ponyta": "Ponyta may be a combination of pony and bonita (pretty in various Iberian languages).", "/wiki/Pawmo": "Pawmo is a stout, bipedal, rodent-like Pokémon. Compared to Pawmi and Pawmot, its fur is almost entirely light orange, with tan colorations on its forepaws, snout, and long, fluffy tail, and green on the insides of its ears. Its face has beady brown eyes, a tiny nose, and yellow electric sacs on its cheeks. It has tufts of fur on its forehead and near its ears. Pawmo has five fingers on its forelimbs which are considerably large, and stretches down to its tiny feet. Pawmo's forepaws contain yellow pads that turn teal-blue when releasing electricity. It uses these paw pads for its signature fighting technique, where it simultaneously strikes and zaps foes with its forepaws. Pawmo are known to travel in groups. When attacked, Pawmo will be the first to fight back, defeating foes with its electricity.", "/wiki/Probopass": "Its nasal compass may be based on the expression \"follow one's nose\", meaning \"to trust to one's instincts\". Alternatively, it may be a pun on the English words \"nose\" (Japanese: ノーズ nōzu) and \"north\" (Japanese: ノース nōsu). It also could be based on the ethmoid bone that is located between the nasal cavity and the brain, and is known to give some species their sense of direction via magnetoreception.", "/wiki/Panpour": "Panpour may be a combination of Pan (the genus of chimpanzees) and pour.", "/wiki/Pyroar": "Kaenjishi may be a combination of 火炎 kaen (flame) and 獅子 shishi (lion).", "/wiki/Primeape": "In addition, Primeape's arms, hands, legs, and feet are similar to those of boxers.", "/wiki/Purrloin": "Prior to Unforgettable Memories, Hugh received a Purrloin from his grandfather, and later gave it to his younger sister for her birthday. It was stolen by Team Plasma when Hugh and his sister were out battling.", "/wiki/Patrat": "The BW Agency have three Patrat hired to appear in different media such as advertising and movies, one of them is named Alain. They first appeared in Lights, Camera...Action, where they did an Xtransceiver commercial with a girl.", "/wiki/Pheromosa": "Pheroache may be a combination of pheromone, feroce (Italian for fierce), and cockroach.", "/wiki/Piloswine": "Pryce's Piloswine first appeared in As Cold as Pryce, thus also marking the species' main series debut. Pryce thought that it abandoned him when he was a young Trainer after the two of them got hit by a Magmar's Fire Blast, and thus became cold and bitter. When Pryce found his Piloswine in a cave and frozen solid with a Burn-Healing Herb, Pryce let go of his coldness. Pryce used Piloswine in his Gymbattle against Ash in the following episode.", "/wiki/Pikipek": "A Pikipek appeared in Dewpider Ascending!, where it kept attacking a wild Dewpider with Peck. It eventually popped the Dewpider's bubble helmet and forced it to retreat into the lake from which it came.", "/wiki/Pawmot": "Although Pawmot's reaction speed is normally low, it is able to strike opponents with fast movements when battling. The fluffy fur on its body acts like a battery, allowing Pawmot to store as much electricity as in an electric car.", "/wiki/Politoed": "In I Politoed Ya So, Tammy owns a Politoed nicknamed Bean and uses it and other Pokémon for a cheerleading squad. Bean is distinctive from other Politoed by the red band it wears around its head. It had a falling-out with Tammy, prompting her to ask Misty to lend her own Politoed to her for a while. Later, she and her Politoed made amends, and Tammy returned Misty's Politoed to her.", "/wiki/Popplio": "Popplio is able to snort bubbles of water from its nose, which it uses as part of its battle strategy. On land, it uses the elasticity of its bubbles to perform acrobatic stunts and jumps. It practices daily with increasingly larger water bubbles. It can swim at 25 mph (40 km/h)[1]", "/wiki/Pyukumuku": "Namakobushi may be a combination of 海鼠 namako (sea cucumber) and 拳 kobushi (fist).", "/wiki/Palkia": "Palkia's Origin Forme appears to be based on Arceus. It bears similarities to a centaur and Pegasus, a winged horse in Greek mythology. As Arceus seems to take inspiration from the qilin, this influence is seen with Origin Forme Palkia as well with its mix of equine and draconic qualities (including Palkia's Dragon typing).", "/wiki/Persian": "Persian may refer to Persian cats. It could also be related to purr, the onomatopoeia for the noise a cat makes when content.", "/wiki/Pancham": "↑Creator profile on Megumi Mizutani in the Pokémon Trading Card Game Illustration Collection, p. 178: \"She was in charge of the design for Mienshao and Pancham, among other Pokémon, as well as the design of and official illustrations for Gym Leaders, Pokémon Trainers, and other human characters.\" (archive)", "/wiki/Pansage": "Pansage, Pansear, and Panpour were specifically created as partner Pokémon for Cilan, Chili and Cress, the Gym Leaders of Striaton Gym. As Striaton Gym doubles as a restaurant, these Pokémon were designed around cooking as a theme, and their hands were designed to resemble oven mitts.[1] Additionally, Pansage, along with its two contemporaries, seems to be inspired by the three wise monkeys motif; with its mouth open, Pansage represents \"speak no evil\".", "/wiki/Pidgeotto": "Pidgeotto claims a large area as its own territory. This Pokémon flies around, patrolling its living space. If its territory is violated, it shows no mercy in thoroughly punishing the foe with its sharp claws.", "/wiki/Poochyena": "Poochyena is an omnivore—it will eat anything. A distinguishing feature is how large its fangs are compared to its body. This Pokémon tries to intimidate its foes by making the hair on its tail bristle out.", "/wiki/Pelipper": "Pelipper may be a combination of pelican and skipper (boat captain), flipper, or possibly propeller (device used for propulsion by both boats and planes).", "/wiki/Quaxly": "Kuwassu may be a combination of クワック kuwakku (quack) and an anagram of ワックス wakkusu (wax).", "/wiki/Quilava": "Magmarashi may be a combination of magma and 山荒 yama-arashi (porcupine).", "/wiki/Qwilfish": "Harysen may be derived from 針千本 harisenbon (porcupinefish). The character 千 sen in 針千本 harisenbon means thousand, and this numerical theming is continued with Overqwil's Japanese name.", "/wiki/Quaquaval": "Quaquaval may be a combination of quá-quá (Portuguese onomatopoeia for duck sounds), aqua, and carnaval (Spanish and Portuguese for carnival). The name also appears to draw from the adjective quaquaversal, referring to a pattern that radiates in all directions from a common center; such is the case for the water plumes that fan out from Quaquaval's tail during battle.", "/wiki/Quilladin": "Quilladin, the Spiny Armor Pokémon and the evolved form of Chespin. The hard shell covering Quilladin's body is so tough, a direct hit from a large truck wouldn't even dent it. Quilladin uses this shell to deflect foes' attacks, and it strikes back with its sharp quills.", "/wiki/Quagsire": "Pokémon Mystery Dungeon: Gates to Infinity: Quagsire appears as the landlord of Paradise as well as an important character in the storyline. The player's partner buys land from him at the beginning of the game that would become the headquarters for the player's exploration team. He also runs an area similar to the Chimecho Assembly from the previous games. Like some members of Wigglytuff's Guild, he has a catchphrase, which is \"hmm\". He is also responsible for dealing with captured outlaws, much like Magnezone before him. He is known to be a hard taskmaster to these Pokémon. Quagsire reappears in Pokémon Super Mystery Dungeon where he is now a resident of Lively Town.", "/wiki/Quaxwell": "Quaxwell has a serious, stoic personality. It learns and practices dance routines by observing the movements of people and Pokémon from various regions. Quaxwell is a hard worker, and constantly trains its strength and technique. Flocks of Quaxwell train by running their legs through shallow waters, and then compete with each other for the most graceful kicks.[1]", "/wiki/Rillaboom": "Rillaboom's Gigantamax form appears to draw inspiration from modern rock drummers.", "/wiki/Regigigas": "Regigigas may be a combination of regis (Latin for royal) and gigas (Latin for giant).", "/wiki/Remoraid": "Remoraid's talent for shooting attacks is similar to an archerfish's. Considering its relationship with Mantyke and Mantine, it also appears to be based on a remora. Its shooting abilities, general shape, and appearance make it similar to firearms, more specifically, revolvers.", "/wiki/Revavroom": "Burororoom may be a combination of ぶろろろ burororo (onomatopoeia for engine sounds) and vroom. It may also involve roam.", "/wiki/Rotom": "In Pokémon Platinum, an old notebook in Rotom's Room describes how a person discovered and named the first known Rotom. It appeared out of a lawn mower's motor, and the person named it Rotom due to this origin.", "/wiki/Runerigus": "The method to evolve a Galarian Yamask may be inspired by funeral rites in different culture. The fact that Galarian Yamask evolves into Runerigus after taking at least 49 HP in damage could be a very subtle reference to the antarābhava, a Buddhist concept of Purgatory after death and before reincarnation; this process of Buddhist Purgatory is said to last 49 days. The location of evolution, namely the stone arch in Dusty Bowl, resembles a dolmen, while the arrangement of surrounding monoliths resemble that of a stone ship.", "/wiki/Rhydon": "According to interviews with Ken Sugimori, Rhydon was one of the first Pokémon ever created;[1][2] this is evidenced by early sketches of the Capsule Monsters game concept featuring Rhydon, Lapras, and others. Moreover, Rhydon's index number is 001 in Generation I.", "/wiki/Regidrago": "Regidrago and Regidorago may be a combination of regis (Latin for royal) and dragon.", "/wiki/Rhyperior": "Dosidon may be a combination of 土 do (ground, soil), 怒 do (anger), or ど do- (prefix for very much), 犀 sai (rhinoceros), and -don (common suffix in dinosaur names derived from the Ancient Greek word for tooth).", "/wiki/Riolu": "From Lucario with the first and last syllables reversed and the ca omitted, or possibly ripple", "/wiki/Regieleki": "Regieleki also seems to be based off the concept of an electric charge being restrained by electrical insulation. Its overall shape resembles an incandescent light bulb, its restraints resemble electrical coils, its arms resemble electric arcs, and its legs resemble a power plug. As an electric generator found in ancient ruins, its inspiration may also be drawn from an out-of-place artifact (OOPART), such as the Baghdad Battery.", "/wiki/Roaring_Moon": "According to an article from an April issue of Occulture magazine, Roaring Moon is named after a similarly described being in the Scarlet Book. It looks similar to Salamence when they undergo Mega Evolution, but it's unclear if there is any connection. It's said that Roaring Moon scatters feathers as it flies around at high speeds seeking prey. It's thought to be more savage than Salamence and that it should be avoided at all costs.", "/wiki/Ralts": "Ralts may be a partial anagram of astral (relating to its Psychic powers). It may also involve waltz (referring to its dancer-like evolved forms).", "/wiki/Reshiram": "Reshiram is derived from 白 shiro (white). Ken Sugimori has also stated that Re was used because it was a softer sound than Zekrom's Ze, as Reshiram is a less physically powerful character.[4]", "/wiki/Rellor": "Shigaroko may be derived from a partial backward spelling of 糞転がし funkorogashi (colloquial term for dung beetle).", "/wiki/Rowlet": "Rowlet, the Grass Quill Pokémon. A Grass and Flying type. It stores energy during the day from photosynthesis. It swoops down without making a sound and unleashes a powerful kick without being noticed.", "/wiki/Relicanth": "Relicanth may be a combination of relic (something old that has survived the passage of time), relict and coelacanth.", "/wiki/Raikou": "Raikou may be derived from 雷 rai (thunder) or 雷光 raikō (lightning) and 公 kō (lord) or 皇 kō (emperor), where the former forms a reference to 雷公 Léigōng (god of thunder in Chinese mythology).", "/wiki/Rabsca": "Beracas may be derived from スカラベ sukarabe (scarab) spelled in reverse.", "/wiki/Rockruff": "Rockruff with the Ability Own Tempo is a separate form that can only evolve into Dusk Form Lycanroc. It evolves into this form when leveled up during the evening: from 5:00 to 5:59 PM in in-game time in Ultra Sun and Ultra Moon (equating to 5:00 to 5:59 PM in real-time in Ultra Sun and 5:00 to 5:59 AM in real-time in Ultra Moon), from 7:00 to 7:59 PM in real-time in Sword and Shield, and for a period lasting 3 minutes out of the 72-minute day/night cycle in Scarlet and Violet.", "/wiki/Roselia": "Roselia is likely based on rose bushes. Its humanoid design, connection to flowers, and one of its Egg Groups suggest that it is also based on fairies. While red and blue are known rose colours, these two specifically together could be referencing hydrangeas, which produce red or blue flowers depending on the pH level of the soil.", "/wiki/Raichu": "Raichu may be a combination of 雷 rai (thunder) and チューチュー chūchū (onomatopoeia for the squeak of a mouse).", "/wiki/Regice": "The five Legendary titans may be collectively themed after historical epochs, with Regice representing the Ice Age.", "/wiki/Rampardos": "Its strength lies within its fierce head-butting attacks. A charging Rampardos can knock down virtually anything with one hit. 100 million years ago, it lived in jungles, where it ruthlessly chased its prey while tearing down trees in its path. It enjoys barging into objects with its head to train its strength and reflexes. This resulted in its skull growing a foot thick and harder than steel, which prevents it from fainting if it crashes into anything, even another charging Rampardos. Long after its passing, ancient people would dig up its well-developed skull fossil and use it as a helmet. However, because its skull grew so thick, its brain became even smaller than that of Cranidos, leading to theories that its stupidity led to its extinction. Its fossils have been found near those of Bastiodon, suggesting that these two lived in the same habitat, likely as enemies.", "/wiki/Rayquaza": "Rayquaza's mikado organ refers to 帝 mikado (emperor), another name for the Emperor of Japan.", "/wiki/Raboot": "Raboot usually practices its footwork by kicking Berries from a tree's branches and then juggling them with its feet. While training its kicking attacks, Raboot tries to avoid using its arms, tucking them under its fur. This effectively prevents Raboot from losing body heat.[1]", "/wiki/Roserade": "Roserade may be a combination of rose and masquerade (due to the appearance of wearing a mask).", "/wiki/Registeel": "The five Legendary titans may be collectively themed after historical epochs, with Registeel representing the Iron Age.", "/wiki/Rapidash": "Rapidash may be a combination of rapid and dash (referring to the high speed at which it runs) or ash (referencing its Fire type).", "/wiki/Raticate": "Raticate appears to be based on a rat, as well as a semi-aquatic rodent such as a muskrat or a coypu due to its large size and webbed feet. Its scruffy ears are similar to a guinea pig.", "/wiki/Reuniclus": "Reuniclus may be a combination of reunite and homunculus, nucleus, or cluster.", "/wiki/Rhyhorn": "Rhyhorn's design appears to be inspired by an Indian rhinoceros, which has similar plated armor; and an Uintatherium, from whom it may have taken its flat head and horn. Its design also has elements of ceratopsids.", "/wiki/Rufflet": "As a child, Black caught Brav, his first caught Pokémon, when Brav was a Rufflet. Bianca agitated the Eaglet Pokémon by accidentally stepping on his food, and he attacked her. Black battles him with the help of Musha, who was then a wild Munna, until Black managed to catch him. He first appeared as a Rufflet in a flashback in A Nickname for Tepig.", "/wiki/Rookidee": "Rookidee are feisty and territorial Pokémon and will bravely fight against anybody, no matter how big and strong that opponent is. They are able to store some of their own energy after every battle, so they can grow a bit stronger even if they lose. Using their legs, they are able to jump nimbly from place to place to confuse Pokémon bigger than themselves. Female Rookidee are fussier than the males, and will relentlessly attack anyone who dirties its wings. Rookidee preys on Grubbin.", "/wiki/Rolycoly": "Rolycoly was first discovered around 400 years ago in coal mines. It races around on grassy plains and the rough, rocky terrain in coal mines and caves, burning through the coal that sustains it. Rolycoly's diet also includes grass that gets tangled in its \"wheel\". Until about 100 years ago, every household in Galar had a Rolycoly, using the coal that it drops for cooking and heating up homes. Rolycoly's popularity continues even into the modern-day, as it is used for outdoor activities.[1]Dwebble is Rolycoly's natural enemy, as the former tends to think that Rolycoly is an inanimate rock to turn into a home. In Generation IX, Heat Crash is its signature move.", "/wiki/Ribombee": "Ribombee uses its fluffy hair to hold pollen it collects from flowers. Rain turns its hair dirty and its pollen damp, so it only visits fields if the weather will remain clear. When storms are on the horizon, Ribombee hide in tree hollows and wait stock-still. The pollen and nectar its collects is used to form balls called \"Pollen Puffs\". These balls can be used as food or relieve tiredness with a soothing effect. The Alolan people sell Pollen Puffs as valuable nutritious supplements.[1] In Generation VII, Pollen Puff was its signature move.", "/wiki/Roggenrola": "In Gotta Catch A Roggenrola!, fourteen Roggenrola were targeted by Team Rocket. However, they were rescued by Ash and his friends, with the help of a fifteenth Roggenrola who was part of their group. They reappeared in a flashback in Explorers of the Hero's Ruin!.", "/wiki/Regirock": "The five Legendary titans may be collectively themed after historical epochs, with Regirock representing the Stone Age.", "/wiki/Rattata": "Rattata may be a combination of rat and attack, as indicated by its beta name. It may also incorporate rat-a-tat (a tapping sound).", "/wiki/Swalot": "Swalot may be based on a myriad of various organs or glands, such as a stomach, a gallbladder, or a single, giant poison gland. It may also be based upon a generic organism that uses pseudopodia. Its general shape resembles a slug.", "/wiki/Sneasler": "Ohnyula may be a combination of 大 ō (big) or 大入道 ōnyūdō (big monk) and ニューラ Nyula (Sneasel).", "/wiki/Simisear": "Simisear is a simian Pokémon that is primarily red. Its ears are broad with orange insides, and it has oval eyes and a small black nose. It has a swirled, flame-like tuft on its head with a smaller tuft on either side of it. Simisear has white shoulder ruffs; and a cream-colored face, chest, fingers, and toes. Its hands have five fingers, and its feet have three toes. Its fluffy, swirled tail resembles a flame. There is a flame flickering inside its body, which it fuels with sweet foods. It is also capable of scattering embers from its tail and the tufts on its head.", "/wiki/Skwovet": "Using its special cheeks, which can stretch to many times its normal volume, Skwovet can stuff a tremendous amount of food such as Berries. If it is feeling full, it can temporarily keep the extra food in its tail fur. Skwovet's habit of eating Berries nonstop has made it more resilient than it appears. If its cheeks are ever completely empty of Berries, it becomes very uneasy; it may even stuff its cheeks with pebbles if it can't find any Berries nearby. Skwovet will appear on farms, looking for more Berries to eat. When they are not eating Berries, they spit out the seeds in the rich soil in order to cultivate Berry trees. It has a habit of hiding and adding to its food storage, as it is always anxious about getting hungry. Gumshoos is its natural predator.", "/wiki/Snivy": "Snivy is based on a snake. Designer Reiko Tanoue mentioned that the idea for Snivy's design came from a picture book which mentions snakes that have the appearance of vines;[1] the specific snake may be the vine snake, tree snake, or green snake. Unlike real snakes, Snivy was designed with arms and legs to make it appear non-threatening, so as to not put off players; it gradually becomes more snake-like as it evolves.[2] Additionally, some of Snivy's features may be inspired by legless lizards, grass lizards, Asian grass lizards, or skinks. The shape of Snivy's head, body, and the protrusions on its shoulders may be based on the bird of paradise or false bird of paradise flowers.", "/wiki/Sandshrew": "Sandshrew may be based on the armadillo or pangolin, mammals with hard scales and sharp claws, can curl up into a ball, and live in desert regions. Both Sandshrew and Sandslash are mentioned to have poisonous claws, similar to how some species of the shrew are venomous.", "/wiki/Spearow": "Onisuzume may be a combination of 鬼 oni (demon) and 雀 suzume (sparrow).", "/wiki/Staryu": "Staryu may be a combination of star and you (in opposition to the me in Starmie).", "/wiki/Suicune": "Suicune may be a combination of 水 sui (water), 水晶 suishō (crystal), and 君 kun (monarch).", "/wiki/Spewpa": "Scatterbug and Spewpa each have 20 forms internally, one for each Vivillon pattern. This determines the form of Vivillon they will eventually evolve into, and is determined when they are first generated.", "/wiki/Sandaconda": "Sandaconda appears to be based on an anaconda, though it may also be based on various desert-dwelling snakes, such as the sidewinder, a snake that uses coiling and rippling motions to travel across sandy dunes. As its Pokédex entries state that it blasts sand out of its nose, it also may be based on a double-barreled gun. Sandaconda may also be based on the ball python, a snake that gets its name from its tendency to curl into a ball to hide its head.", "/wiki/Staravia": "In the Hoopa's Surprise Ring Adventures short Flying in the Air, Hoopa summoned multiple Staravia to create wind for Ash and Pikachu, but their combined Gust was too much for them and sent them blasting off.", "/wiki/Scrafty": "Scrafty may be a combination of scrappy (feisty), scruffy, or scraggy (scrawny), and crafty (being skilled at deceit to achieve one's goals).", "/wiki/Skiploom": "Skiploom's flower blossoms when the temperature rises above 64 degrees Fahrenheit. How much the flower opens depends on the temperature. For that reason, this Pokémon is sometimes used as a thermometer.", "/wiki/Seaking": "Azumao may be derived from 東錦 azuma nishiki (a breed of goldfish) and 王 ō (king).", "/wiki/Spectrier": "Wraithpos may be a combination of wraith, 霊 rei (spirit), and ἵππος híppos (Greek for horse) or horse.", "/wiki/Sprigatito": "Sprigatito is capricious and attention-seeking, and it tends to sulk if ignored by people. Sprigatito can rub its paws together to unleash a sweet, therapeutic aroma that mesmerizes anyone near it and causes its foes to stop battling. The scent becomes more potent when Sprigatito is exposed to sunlight. Sprigatito can absorb moisture into its fur by grooming it, which helps it to perform photosynthesis.[1] It washes its face regularly to avoid drying out.", "/wiki/Smoochum": "Muchul may be a combination of 夢中 muchū (daze or trance) and ちゅう chu (the sound of a kiss).", "/wiki/Swellow": "Swellow flies high above our heads, making graceful arcs in the sky. This Pokémon dives at a steep angle as soon as it spots its prey. The hapless prey is tightly grasped by Swellow's clawed feet, preventing escape.", "/wiki/Skrelp": "Skrelp is a poor swimmer, and gets easily washed away by storms. Skrelp rides seaweed as a form of traveling the ocean. It camouflages itself as the seaweed to hide from enemies while storing power for evolution. It also uses this technique to hide from prey, which it sprays with liquid poison when approached. However, its main source of food is rotten seaweed, which it uses to create its poison. Skrelp is known to coexist well with Dhelmise.", "/wiki/Seedot": "Seedot is a small, brown Pokémon that resembles an acorn. A beige, mask-like pattern covers its large black eyes, and it has two beige feet. It has a gray \"cap\" with a short stem on top of its head. The stem is used to hang from tree branches in its forest home. While hanging, this Pokémon absorbs moisture and nutrients from the tree until it becomes too heavy and falls to the ground. The more it drinks, the glossier its body becomes. Additionally, Seedot polishes itself with leaves once daily. If it remains still, it can be mistaken for a nut and startles others by moving suddenly. Pidgey is a natural predator of Seedot.", "/wiki/Sableye": "Sableye may be based on the Hopkinsville Goblin, a creature from an alleged Kentucky alien encounter described as having shining eyes, small legs, clawed arms and swaying hips (a movement that Sableye imitates in the 3D Pokémon games). The Hopkinsville aliens are most famous in Japan, where they have appeared in several media.", "/wiki/Spinarak": "Itomaru may be a combination of 糸 ito (thread) and 丸 maru (circle; suffix in young boy's names).", "/wiki/Serperior": "Serperior may be a combination of serpent, superior, and possibly warrior and emperor.", "/wiki/Sawk": "Dageki may be a combination of 打撃 dageki (blow, strike) and 鬼 ki (demon).", "/wiki/Seviper": "Seviper may be a combination of sever (to cut and detach), severe (intense) or serpent and viper.", "/wiki/Scyther": "Scyther may be a combination of scythe and the suffix -er (something that does an action).", "/wiki/Snorunt": "Yukiwarashi may be a combination of 雪 yuki (snow) and 座敷童子 zashiki-warashi (a spiritual creature found in the folklore of Iwate Prefecture) or 童子 warashi (archaic word for child).", "/wiki/Shieldon": "Byron has a Shieldon that he was unable to befriend even after carrying him outside of his ball for an extended period. As Diamond was able to do so even without knowing him, he decided to give him to the boy before his training on Iron Island, which he nicknamed Don. He evolved into a Bastiodon later in the showdown against Team Galactic. He first appeared in A Big Stink Over Stunky.", "/wiki/Shroodle": "Shirushrew may be a combination of 汁 shiru (juice), しるし shirushi (mark, sign), shrew, and シュルシュル shurushuru (onomatopoeia for rustling).", "/wiki/Sewaddle": "Sewaddle may be a combination of sew and waddle (referring to how a baby walks) or swaddle (to wrap a baby in cloth).", "/wiki/Shuckle": "Tsubotsubo may be derived from 壺 tsubo (jar) and 富士壺 fujitsubo (acorn barnacle).", "/wiki/Swanna": "Swanna is derived from swan and may be a combination of swan and ballerina.", "/wiki/Sandygast": "Sandygast is known to inhabit beaches, and is born from grudges that seep into the sand, such as from Pokémon that suffer defeat in battle or the deceased. It can suck the life force of people or Pokémon through its mouth. Apparently, in the Alola region, sticking a hand into Sandygast's mouth is a way of proving one's courage. A person who grabs Sandygast's shovel or puts a hand in its mouth falls under its control. Sandygast uses this power to make children add sand to its body so it can become bigger. Sandygast cares a lot about the shovel on its head. A Sandygast that loses its shovel may replace it with something like a branch or a flag, but it is said to keep searching for its lost shovel.[1] Sandygast attacks prey by flinging sand into their eyes; however, because Sandygast is very slow, its prey tend to escape before it can approach them.", "/wiki/Shiinotic": "Due to its emphasis on shining light, and some of its foreign names including it, Shiinotic may also intentionally resemble a lamp, especially a bedside lamp with a lampshade. It may also be based on the supernatural interpretation of will-o'-the-wisps, due to its habits of confusing people in the woods with its lights. The connection between fungi and lights may be a pun on the homophonous Japanese words 発酵 hakkō (fermentation) and 発光 hakkō (luminescence) — Morelull and Shiinotic's Japanese category is はっこうポケモン Hakkō Pokémon.", "/wiki/Samurott": "Hisuian Samurott may be based on the extinct Japanese otter and the sea otter. Its anthropomorphic aspect may come from a rōnin, which is a samurai without a lord or master to serve. The kanji 浪 from 浪人 (rōnin) literally means wave, which might have been the inspiration for the wave-like designs all over Hisuian Samurott's body. Being a rōnin was regarded as dishonorable in traditional samurai culture, and many of them end up becoming mercenaries, which may explain Hisuian Samurott's Dark type. The seamitars it keeps on its arms resemble flame-bladed swords, also known as wave-bladed swords, such as the flamberge or kris.", "/wiki/Slakoth": "Slakoth is based on sloths,[1] perhaps specifically the two-toed sloth. It also has some similarities to human infants, such as spending more time sleeping than awake, and primarily lying on its stomach, as babies do not have the muscle mass to hold themselves upright.", "/wiki/Shelmet": "Chobomaki may be a combination of おちょぼ口 ochoboguchi (puckered-up mouth) and 巻貝 makigai (snail; conch).", "/wiki/Sceptile": "Its ability to launch its tail while in its Mega Evolved form may be a reference to autotomy, a method of self-defense in which many animals, like reptiles, shed off their own appendages, which they can later regenerate. It may also be a reference to rocket launchers, with its tree-like tail also resembling a rocket.", "/wiki/Stakataka": "Stakataka may also take inspiration from colonial organisms, with each brick functioning like a zooid. Being an Ultra Beast, it may also reference the science-fiction concept of aliens linked together in a group mind.", "/wiki/Spinda": "In Pokémon Brilliant Diamond and Shining Pearl, this is due to a bug in the game, which causes the encryption constant to be read as a big-endian value (i.e. bytes are read in reverse order), and would allow the possibility to indirectly change Spinda's spot pattern. Spinda is the only Pokémon that cannot be transferred out of these games.", "/wiki/Snorlax": "Kabigon is derived from Kirby (Japanese: カービィ Kābī), the eponymous main character of Nintendo's Kirby video game series. In an interview with Game Informer, Junichi Masuda stated that Kōji Nishino, the main inspiration for Snorlax, used to be called \"Kirby\" during the development of Pokémon Red and Green because of his large appetite.[4] Kabigon may also involve 黴 kabi (mold), noting the fact that Snorlax will eat anything, even moldy food.", "/wiki/Surskit": "Ametama may be a combination of 雨 ame (rain), 水黽 amenbo (water strider), and 玉 tama (sphere). It may also involve 飴玉 amedama (candy; due to its sweet, syrupy secretions).", "/wiki/Shedinja": "Nukenin may be a combination of 抜け殻 nukegara (empty shell) and 忍者 ninja, as well as a pun on 抜け忍 nukenin (fugitive ninja​).", "/wiki/Solosis": "Solosis and the rest of its evolutionary line seem to bear reference to cells, with the head representing the nucleus, the green substance surrounding their bodies resembling cytoplasm and the objects inside their bodies representing organelles. The line down its head also resembles a cleavage furrow in cell biology. It may also make allusion to the embryonary stages, specifically the stage of morula.", "/wiki/Stoutland": "Stoutland has an intelligent, good-natured, valiant, and trustworthy disposition, being a partner of choice for many. Its fur is thick enough to protect itself and others against freezing temperatures. Stoutland found in Alola look fairly uncomfortable, however. Stoutland enjoys spending time with humans and can warm up to them in just three days. It is known to be very proud of its impressive mustache, the reason being due to its length determining Stoutland's social status among its species.", "/wiki/Sylveon": "Nymphia may be derived from nymph, a class of female nature deities in Greek mythology commonly associated with fairies.", "/wiki/Spoink": "The group later met Isaiah, a researcher who specializes in Clamperl. Team Rocket attempted to steal Isaiah's rare blue pearl, but Spoink ended up with the item. Spoink went on to befriend a wild Clamperl and exchanged the blue pearl for Clamperl's pink pearl. Ash, his friends, and Spoink went on to defeat Team Rocket after they stole Clamperl and the blue pearl. Spoink then started to meditate and was able to recover Isaiah's blue pearl in exchange for its pink pearl. However, the kind act left Spoink without a pearl. Realizing the situation, Clamperl gave Spoink the pink pearl as thanks.", "/wiki/Seadra": "Seadra may be a combination of sea or seahorse and dragon, seadragon, or Hydra (a mythological sea creature).", "/wiki/Sealeo": "Sealeo may be a combination of sea or seal and leo (Latin for \"lion\"), in reference to sea lion.", "/wiki/Slowpoke": "Though the species has appeared repeatedly, no Slowpoke has ever been seen using an attack in the anime.", "/wiki/Scovillain": "Scovillain may be a combination of Scoville (as in the Scoville scale, the measurement scale for chili pepper pungency) and villain.", "/wiki/Sentret": "When Sentret sleeps, it does so while another stands guard. The sentry wakes the others at the first sign of danger. When this Pokémon becomes separated from its pack, it becomes incapable of sleep due to fear.", "/wiki/Slither_Wing": "Chiwohauhane can be taken literally as 地を這う羽chi o hau hane (wings slithering on the ground).", "/wiki/Smoliv": "Inside its fruit, Smoliv stores oil made from nutrients it gathers through photosynthesis, which allows it to go for a week without eating or drinking. Smoliv's oil is bitter and astringent enough to make someone flinch, and thus is not suitable for consumption. When startled or attacked, Smoliv will shoot its oil out to slow its opponent, and then it will run away. It prefers dry and sunny climates, and tends to spend its time sunbathing.[1]", "/wiki/Swadloon": "Kurumayu may be a combination of 包まる kurumaru (to be wrapped) and 繭 mayu (cocoon).", "/wiki/Skeledirge": "Laudbon may be a combination of laúd (Spanish lute, a musical instrument), loud, and bone.", "/wiki/Sandile": "Meguroco may be a combination of 目黒 meguro (black-eyed) and crocodile.", "/wiki/Solgaleo": "Solgaleo may be a combination of sol (Latin for sun) and leo (Latin for lion). It may also incorporate Galileo, an Italian astronomer who presented evidence that the Earth rotated around the Sun and advocated Copernican heliocentrism.", "/wiki/Sandy_Shocks": "Sunanokegawa can be taken literally as 砂の毛皮 suna no kegawa (sandy fur).", "/wiki/Scatterbug": "Scatterbug may be a combination of scatter, bug, and possibly litterbug.", "/wiki/Swoobat": "Kokoromori may be a combination of 心 kokoro (heart) and 蝙蝠 kōmori (bat).", "/wiki/Shelgon": "As a result, this Pokémon moves sluggishly and supposedly never eats or drinks, but it never seems to starve or thirst to death for reasons unknown. Inside the shell, its body is busy forming for its next evolution. It stores the necessary energy needed to evolve, and when it does, its shell begins to peel away. Shelgon can be found in caverns, where it stays still until it evolves.", "/wiki/Sizzlipede": "Yakude may be a combination of 焼く yaku (to burn) and 蚰蜒 yasude (millipede) or 百足 mukade (centipede).", "/wiki/Silcoon": "Silcoon, the Cocoon Pokémon. Silcoon is the evolved form of Wurmple. Using its thread to attach itself to a tree branch, it waits to evolve to its next stage. When it grows thirsty, it drinks the dew that collects on its string.", "/wiki/Scream_Tail": "Sakebushippo can be taken literally as 叫ぶ尻尾 sakebu shippo (screaming tail).", "/wiki/Sharpedo": "Sharpedo appears to be based on a shark, but without the rear half of its body. This body shape makes it similar to an ocean sunfish; both sharks and sunfish are known for their sandpaper-like skin. Sharpedo's body shape also resembles a torpedo.", "/wiki/Shroomish": "In Zoroark: Master of Illusions, multiple Shroomish were living in Crown City. A few of them worked together with the other Pokémon in surrounding Zorua in the park with the intention of attacking him in retribution for what Zoroark did to the city. Before a fight could break out, the Shroomish, along with the other Pokémon, were calmed down by Celebi.", "/wiki/Simipour": "Simipour appears to based on a monkey and a fountain; because of this, it may have been inspired by the water dwelling monkey-like creature ahuizotl, or it may be a visual pun on Sea-Monkeys. The ability to store water in its hair may also reference the Kappa, a Japanese reptilian yōkai that stores water on a dish of sorts on its head. The hair itself resembles a common hairstyle among hippies and popular musicians of the late 60s and the 70s. This contrasts with Simisage's pompadour-like hair, common in the 50s.", "/wiki/Sunflora": "Seven Sunflora appeared in The Power of Us, with six under the ownership of different Trainers and the seventh being wild.", "/wiki/Shaymin": "Shaymin is from 謝謝 xièxie (Chinese for thanks).[1] It may also be derived from 蝟 harinezumi (hedgehog) and ם‎שמי‎ Shamayim (Hebrew for heaven) with the latter correlating directly with Shaymin's Sky Forme.", "/wiki/Sobble": "Sobble appears to be based on the veiled chameleon due to its color scheme being similar to that of the males. The way this species collects water droplets from its casque (the helmet-like protrusion on top of its head) into its mouth could resemble tears, which could explain the tear-like patches on Sobble's face, its actual tears when crying, and its Water typing. Additionally, its typing and the crest on its head are features that can also be more loosely related to basilisk lizards.", "/wiki/Stantler": "Stantler may be a combination of startle, stare, or stag (a male deer) and antler.", "/wiki/Slugma": "Slugma is based on a slug with a body of lava. It may also be based on the Cherufe, evil creatures of rock and magma that inhabit the magma pools found deep within Chilean volcanoes. Slugma's Shiny form may be based on cooled, hardened magma, which becomes a dark, metallic color. The form may also be based on solder, a liquid metal that is extremely hot and hardens when it cools, similarly to lava.", "/wiki/Spidops": "Wanaider may be a combination of 罠 wana (trap), spider, and Schneider (German for \"tailor\" and \"long-legged arachnid\").", "/wiki/Simisage": "Its two contemporaries seem to be inspired by the three wise monkeys motif; Simisear has a connection to \"hear no evil\", and Simipour to \"see no evil\". However, there is no obvious connection between Simisage's appearance and the third, \"speak no evil\".", "/wiki/Scizor": "Despite having different base stats, Scizor, Kleavor, and Scyther all have a base stat total of 500 (Scyther has a higher base Speed, whereas Scizor and Kleavor have a higher base Attack and Defense respectively). As such, Scizor and Kleavor are the only Pokémon to not have their base stat total changed upon evolving.", "/wiki/Sirfetch%27d": "The official Pokémon Sword and Shield website mentions a painting depicting Sirfetch'd battling an Escavalier.[1] This may be a reference to the motif of knights fighting snails, which is sometimes found in medieval and Renaissance manuscripts, as well as Escavalier's own references to medieval jousting.", "/wiki/Spiritomb": "Mikaruge may be a combination of 御影石 mikageishi (granite) and 軽石 karuishi (pumice). It may also involve karma.", "/wiki/Scolipede": "Despite the Scolipede and Centiskorch evolutionary families living in different parts of the Galarregion, both Venipede and Scolipede's Pokédex entries speak of their hostile relationship with the latter family.", "/wiki/Salamence": "Salamence may be a combination of salamander and menace, vengeance, vehemence, violence, or immense.", "/wiki/Squirtle": "Zenigame may be a combination of 銭 zeni (money) and 亀 kame (turtle), forming the word 銭亀 zenigame (baby Japanese pond turtle). According to Pokémon Black and White's television program PokéQuiz, \"'Zeni' is an old-fashioned word for money. Squirtle's shells look like old coins, so that's how they got their name!\"", "/wiki/Skarmory": "Pokémon Ranger: Skarmory is Elita's partner Pokémon. The player also sees it at the Grassland Challenge.", "/wiki/Stunky": "Stunky is based on a skunk, likely a hog-nosed skunk. It also bears a resemblance to a cat of some sort, which is fitting as baby skunks are called kits or kittens. Given that both its Japanese name and its cry make reference to flatulence, it is likely that its face is based on the form of the buttocks. Its learning Self-Destruction as well as its ability Aftermath is likely derived from skunks releasing all of their musk at once if hit by moving cars.", "/wiki/Seel": "Seel, as its name implies, seems to be based on an earless seal, particularly a harp seal pup due to its white fur and icy habitat. It also shares characteristics with other aquatic mammals that live in the Arctic Ocean. Its long, white body is similar to a beluga whale, its horn may be inspired by a narwhal, and its tusks may be inspired by a walrus. The shape of its tail resembles a stylized waterspout or geyser.", "/wiki/Servine": "Ken Sugimori has also said that Snivy, Servine, and Serperior are based on Western culture, specifically mentioning the manga series The Rose of Versailles as an inspiration.[1] Additionally, Servine's physical features resemble the acanthus leaf motifs popularized during the Renaissance. Servine, Pignite, and Dewott's evolutionary lines are collectively based on Western, Chinese, and Japanese culture respectively, to represent the diversity of the Unova region.[1]", "/wiki/Seismitoad": "Gamageroge may be a combination of 蟇 gama (toad) and ゲロゲロ gerogero (onomatopoeia for frog croaking).", "/wiki/Stonjourner": "Ishihengin may be a combination of 石 ishi (stone), Stonehenge, and 変人 henjin (weird or eccentric person).", "/wiki/Spheal": "Pokémon Pinball: Ruby & Sapphire: Spheal stars in the Bonus Field Whiscash or Pelipper takes the player to. They will swim in the pool and occasionally try to climb up the ice slide. Hitting a Spheal at this time will send it to a Sealeo's nose, earning five times the points from just bouncing the Poké Ball.", "/wiki/Sudowoodo": "Usokkie may be a combination of 嘘 uso (false) and 木 ki (wood or tree). It could also derive from 嘘つき usotsuki (liar).", "/wiki/Sinistea": "Yabacha may be a combination of やばい yabai (dangerous; terrible) and 茶 cha (tea).", "/wiki/Shiftry": "Shiftry may be a combination of shifty (appearing deceitful) and tree.", "/wiki/Sigilyph": "Sigilyph's English category, \"Avianoid\", may be a combination of avian (pertaining to birds) and -oid (suffix derived from an Ancient Greek word meaning \"form\" or \"likeness\"). The name can be taken to mean \"bird-like creature\".", "/wiki/Shellos": "Karanakushi may be a combination of 殻 kara (shell), 無くした nakushita (to have lost), and 海牛 umiushi (sea slug; nudibranch).", "/wiki/Sawsbuck": "Mebukijika may be a combination of 芽吹き mebuki (to bud) and 鹿 shika (deer).", "/wiki/Stunfisk": "Stunfisk is based on a flounder, a type of flatfish, specifically the righteye flounder family, known as 鰈 (カレイ)karei in Japanese.[2] It may also be based on the electric ray or stargazer, which are fish that bury themselves in the sea bottom and can make electric discharges when disturbed.", "/wiki/Slurpuff": "Peroream may be a combination of ペロペロ peropero (onomatopoeia for licking) and cream.", "/wiki/Snubbull": "Snubbull may be a combination of snub (short nose; to treat with disdain) and bulldog or bully. It may also involve snuggle.", "/wiki/Skiddo": "Meecle may be a combination of メー mē (onomatopoeia of a goat's bleating) and vehicle or bicycle.", "/wiki/Sliggoo": "Sliggoo may be a combination of slick, slither, slippery, slimy, or slug, and goo.\nThe name may also be derived from the Irish word 'sliogán' - meaning shell - in reference to the shell on its back.", "/wiki/Slowbro": "Yadoran was named after the famous Yugoslavian singer-songwriter Jadranka Stojaković, who had worked for Konami during her residence in Japan. Her name is transliterated into Japanese as ヤドランカ Yadoranka, which is dialectal for \"wouldn't you reside?\". A former colleague of hers who later joined Game Freak brought her name to mind while naming Slowbro. [2] The name may also involve 宿借り yadokari (hermit crab), 宿主 yadonushi (parasitic host), and 鈍 don (dull).", "/wiki/Silicobra": "Silicobra may be a combination of silicon (basic constituent of sand) and cobra. It may also incorporate silt.", "/wiki/Silvally": "Silvally may be a combination of silver and ally. In-universe, it was named by Gladion.", "/wiki/Salazzle": "Ennewt may be a combination of 炎 en (flame) or 艶 en (bewitching) and newt.", "/wiki/Starmie": "Starmie may be a combinaton of star and mystery. Its name in English may involve me (in opposition to the you in Staryu).", "/wiki/Snover": "Pokémon Super Mystery Dungeon: The same Snover from Explorers of Sky returns and will have his connection quest available upon connecting with Bidoof. For his connection quest, he will lure the player into a Monster House and will be recruited upon the player's escape. His recruitment allows the player to encounter the same Bagon from Team Rogue within dungeons.", "/wiki/Salandit": "Yatoumori may be a combination of 夜盗 yatō (burglar) and 井守 imori (newt).", "/wiki/Swinub": "Urimoo may be a combination of 瓜坊 uribō (wild boar piglet) and ブーブー būbū (onomatopoeia for oinking).", "/wiki/Shellder": "Shellder is similar to a clam, with its tongue representing a clam's \"foot\". Its ability to move by flapping its shell is likely inspired by scallops. Scallops are also related to the thorny oysters that resemble its evolved form. The fact that it latches onto Slowpoke and produces a beneficial toxin may be inspired by leeches.", "/wiki/Shuppet": "Shuppet appears to be a てるてる坊主 teru teru bōzu, a Japanese paper doll resembling a ghost. It also resembles a hand puppet. It also appears similar to common depictions of ghosts, specifically those that resemble floating cloths with faces.", "/wiki/Skorupi": "Skorupi is likely based on a scorpion. It has some characteristics that resemble a vinegarroon, a similar arachnid. Its Water 3 Egg Group designation may be a reference to the ancient group of arthropods known as sea scorpions that used to inhabit the oceans and may have been the ancestors of modern scorpions.", "/wiki/Sneasel": "Nyula may be a combination of 潜入 sennyū (sneaking in) and 鼬 yū (weasel, an alternate reading of itachi). Alternatively, it may be a combination of new, ニャー nya (the sound a cat makes), and 野良 nora (stray, as in a stray cat, as strays are usually violent and tricky).", "/wiki/Skuntank": "Skuntank and Skutank may be a combination of skunk, stank (past tense of stink), and tank.", "/wiki/Scraggy": "Pokémon Mystery Dungeon: Gates to Infinity: Scraggy originally ran a scheme with Gurdurr, a former local carpenter in Post Town that has been ripping Pokémon off saying that he'll build stuff for them if they get gems for him at Stony Cave. Scraggy would then bump into the client on their way into town and steal the gems. The gullible Pokémon would then keep going out to Stony Cave to get gems for Gurdurr. When the player and partner discovered the scheme at Hazy Pass thanks to Gurdurr's two apprentices, Timburr, they jumped out to engage both Scraggy and Gurdurr in battle. After their defeat, Scraggy ran away, while Gurdurr ventured further up the mountain, where the player, partner, and Timburr would eventually convince him to become a carpenter again. Scraggy was later apprehended, and Quagsire forces him to work for the benefit of the player and partner by opening a shop and helping their team remember moves. Scraggy still holds a grudge against the team for revealing him and started to tease the team with nicknames, only to get reprimanded by Quagsire. He also explains the seasonal V-Wave wind to the player and partner on the day that Victini arrives in town.", "/wiki/Smeargle": "Smeargle is the only Pokémon capable of learning the same move by leveling up more than four times—some Pokémon have the same move available at level 1 as well as by leveling up, while Smeargle has the same move available ten times as it levels up.", "/wiki/Staraptor": "Staraptor is based on the white-cheeked starling, a common species of bird found throughout Asia, combined with a bird of prey. Although it largely resembles the starling in appearance, much of its inspiration comes from hawks and falcons, particularly its predatory nature and aerial speed. It also has strong similarities to the harpy eagle. The feathers hanging over its face are similar to the long-crested eagle.", "/wiki/Scorbunny": "Hibanny may be a combination of 火 hi (fire), 火花 hibana (spark), and bunny.", "/wiki/Swablu": "In the Hoopa's Surprise Ring Adventures short Flying in the Air, Hoopa summoned multiple Swablu to create wind for Ash and Pikachu, but their combined Gust was too much for them and sent them blasting off.", "/wiki/Squawkabilly": "Ikirinko may be a combination of イキり ikiri (slang for a cocky person) and 鸚哥 inko (parrot).", "/wiki/Steenee": "While it has a delectable fragrance, this Pokémon also has a tomboyish personality that can make it hard to get along with. Steenee's scent is a popular antiperspirants used by humans and helps others feel invigorated. Steenee's peeled rind can be used for stomach pains. Its calyx has hardened, allowing it to play with other Pokémon without worrying about being damaged. However, the leaves spin as Steenee moves and often strike nearby objects. It apparently does not care what it hits, and even uses the calyx as a form of attack. Foes are struck with the leaves first, then kicked by one of Steenee's equally hard legs.[1]. It also uses those legs to protect itself from its natural predator Corvisquire. Steenee has are known to bounce around the forests it lives in.", "/wiki/Sandslash": "Alolan Sandslash's hooked claws combined with its ability to ice climb seem to be inspired by ice axes.", "/wiki/Spritzee": "Spritzee may be a corruption of sprite or derived words. It may also be a combination of spritz (a spray of liquid) and Fee (fairy in German and Dutch).", "/wiki/Swirlix": "Peroppafu may be a combination of ペロペロ peropero (onomatopoeia for licking) and puff.", "/wiki/Slowking": "Yadoking may be a combination of 宿借り yadokari (hermit crab), 宿主 yadonushi (parasitic host), and king. Like Slowbro, it is also partially named after the famous Yugoslavian singer-songwriter Jadranka Stojaković, who had worked for Konami during her residence in Japan. Her name is transliterated into Japanese as ヤドランカ Yadoranka, which inspired one of her former colleagues who named Slowbro and Slowking.[3]", "/wiki/Swampert": "Like its pre-evolved forms, Swampert appears to be based on the mudpuppy, axolotl, mudskipper, or the gilled African lungfish. Swampert's portrayal in the anime suggests that it could also be based on common depictions of a swamp monster—a fictional, frequently antagonistic creature imagined to live in swamps and often has some physical humanoid traits. The fins on its head and tail resemble Japanese war fans, also known as tessen. Its stance is reminiscent of sumo wrestlers.", "/wiki/Sunkern": "Sunkern's official artwork more closely resembled its Shiny form in Gold and Silver than its regular form. This was somewhat rectified in Crystal, although the artwork was still more similar to its Shiny sprite; this discrepancy was fully rectified in Generation III.", "/wiki/Starly": "This means that in Generation V, Starly is the only unevolved Pokémon without a Hidden Ability that evolves into a Pokémon with a Hidden Ability.", "/wiki/Snom": "Snom may be based on a jewel caterpillar. It may also draw some inspiration from the larvae of the Gynaephora genus of alpine or Arctic moths. One particular species, the arctic woolly bear moth, can enter a dormant state that allows it to endure temperatures as low as −94 °F (−70 °C). Snom's voracious appetite in Pokémon Camp is likely a reference to Saturniidae biology, in which the caterpillars eat a large stockpile of food due to losing the ability to eat upon becoming moths.", "/wiki/Shinx": "Shinx may be a combination of shock, shine, or shining, and lynx or sphinx.", "/wiki/Skitty": "Shauna owns a Skitty, nicknamed Kitty, that first appeared in An X-cuse to Come Out and Play, where it was seen with its Trainer in Vaniville Town watching Y's failed attempt to get X out of his house. Kitty and the others managed to escape from the town during Xerneas and Yveltal's rampage, and has since then been traveling with its trainer and her friends.", "/wiki/Slaking": "Kekking may be a combination of 欠勤 kekkin (absence from work) and king.", "/wiki/Stufful": "A Trainer's Stufful appeared in League Offenders and Defenders!. Team Rocket encountered it and mistook it for Bewear's child, therefore believing its presence to be a sign of Bewear being on her way to take them home. However, their concerns were assuaged when they saw Stufful's Trainer.", "/wiki/Steelix": "Steelix, like Onix, is most likely based on a combination of a snake and earthworm. It may also be based on the wyrm, a type of dragon that has been presented as limbless and burrowing. Its golden Shiny coloration is likely based on the fact that gold is a very rare metal. Mega Steelix's crystalline body may be a reference to graphite turning into diamonds from compression.", "/wiki/Solrock": "Solrock made its main series debut in Take the Lombre Home. A group of people blamed a wild Solrock for a drought in their village, when it was actually Team Rocket stealing their water. Solrock redeemed its reputation when it helped to get rid of Team Rocket.", "/wiki/Type:_Null": "Type: Null was created by Faba of the Aether Foundation to be an \"Anti-UB Fighting life-form\". Codenamed \"Beast Killer\", Type: Null was developed with cells taken from all known Pokémon types. This was done with the intention of giving it the ability to shift between types by holding a corresponding memory, an ability originally inspired by the myths researched at Canalave Library. This ability led the Aether Foundation to give it the name Type: Full (Japanese: タイプ：フルType: Full). Three known models of Type: Full were created, but all three rejected the RKS System and went berserk. After being subdued, the three Type: Full were given limiter helmets to lessen the effects of the RKS System's rejection and were put into permanent cryogenic stasis. Thus, the Beast Killer Project was deemed a failure, and the creature's name changed to Type: Null. At some point before the events of Generation VII, Gladion was able to free one of the Type: Null, which he adopted as his own in the hopes of finding a way to undo the effects of the limiter helmet and allow it to use the RKS System. Gladion would eventually discover Type: Null's evolution and renamed it Silvally.", "/wiki/Tranquill": "From 鳩 hato, 坊 bō, and possibly イーハトーヴォ Ihatovo (fictional ideal world in some works of Kenji Miyazawa)", "/wiki/Taillow": "Taillow is very gutsy and will stand up to powerful opponents without backing down. During the cold season, this Pokémon will fly over 180 miles (300 kilometers) per day to search for areas that have warm climates. It typically hunts Wurmple, but flocks have also been shown eating crops in the anime. When it is hungry, it will weaken and cry loudly.", "/wiki/Turtonator": "Bakugames may be a combination of 爆発 bakuhatsu (explosion) and 亀 kame (turtle).", "/wiki/Togedemaru": "Togedemaru, the Roly-Poly Pokémon. An Electric and Steel type. Its ability to generate electricity is weak, but its long needle acts as a lightning rod, so it can attract lightning and store the electricity. When happy, it forms a ball and rolls around. But once it starts rolling, it can't control itself.", "/wiki/Tandemaus": "The pair that forms Tandemaus sticks together no matter what. They exhibit great teamwork: they share any food they find equally within the pair, and they build their nest together using materials they've gathered with their incisors. Tandemaus's evolution into Maushold is considered somewhat of a mystery, as the little individuals that form the group seem to appear out of nowhere.", "/wiki/Tarountula": "Tarountula may be based on the orb-weaver spider alongside members of the Uloboridae family, which are non-venomous and wrap their prey in bundles of silk. Its silk-covered abdomen evokes a yarn ball and may serve as a literal take on an \"orb-weaver.\" Tarountula's Shiny coloration resembles the Destiny Knot.", "/wiki/Terapagos": "It may also take inspiration from chitons, marine mollusks with flat disk-shaped bodies and eye-like peripherals composed of rock.", "/wiki/Tepig": "Pokabu may be a combination of ぽかぽか pokapoka (warm) and 豚 buta (pig) or ブー bū (oink).", "/wiki/Toxicroak": "Toxicroak may have been based on the poison dart frog. The claws on its hands may be inspired by the hairy frog, which defends itself by breaking its own toes and projecting sharpened bones from its skin. It may also be based off of a ninja from its claws resembling the knives assassins would wear on their wrists.", "/wiki/Timburr": "Dokkorer may be derived from どっこらしょ dokkorasho (heave-ho). It may also involve δοκάρι dokári (Greek for beam).", "/wiki/Tyranitar": "Another influence it may have is with the Armadillo girdled lizard, a desert-dwelling lizard mainly distinguished by its especially firm scales; or certain theropod dinosaurs.", "/wiki/Togetic": "Togetic can sense the kindness in other people and Pokémon's hearts. Whenever it spots a pure-hearted person, it tends to go to that person and shower them with happiness and glowing down called \"joy dust\". To share its happiness, it is said to fly around the world seeking these people. If it is not with kind people, however, it becomes dispirited and loses energy. Togetic is rare in the wild, but can sometimes be found living within the forests.", "/wiki/Tangela": "Monjara may be a combination of monster, もじゃもじゃ mojamoja (shaggy or unkempt), and 毛むくじゃら kemukujara (densely covered in thick hair).", "/wiki/Toxel": "Toxel may be a combination of toxic, toddle, cell, electric, and little.", "/wiki/Tatsugiri": "Syaritatsu may be a combination of シャリ shari (sushi rice) and 竜 tatsu.", "/wiki/Tentacruel": "Tentacruel may take inspiration from the jellyfish and the Portuguese man o' war, as evidenced by its category and prototype English name, respectively. It also shares some characteristics of a squid. Additionally, Tentacruel resembles several varieties of the bug-eyed monster and other alien invaders from 1950s B-movies, which is reflected in its ability to fire lasers from the gems on its head.", "/wiki/Totodile": "\"A Big Jaw Pokémon. This alligator-like Pokémon stands on two legs. It has a small body but an impressive jaw that boasts potent bite power. It can do serious damage to someone even if it's just playing. Its tendency to chomp down on anything that moves in front of it means Trainers have to be extra cautious around it. When it levels up, it evolves into Croconaw.\"", "/wiki/Talonflame": "Talonflame, the Scorching Pokémon and the evolved form of Fletchinder. During an intense battle, Talonflame expels embers from gaps between its feathers. It reaches speeds of more than 300 mph chasing prey.", "/wiki/Tinkatink": "Kanuchan may be a combination of 鍛冶 kanuchi (blacksmith) and the Japanese diminutive suffix ～ちゃん -chan.", "/wiki/Trapinch": "Because of this, evolving a Trapinch in Pokémon GO will result in its CP going down, a trait otherwise only seen in cocoon Pokémon such as Kakuna.", "/wiki/Tympole": "Although it is simulated as swimming in Pokédex 3D, Tympole does not display the bubble effect that all other Pokémon simulated in an aquatic environment, such as Eelektrik and Stunfisk, display. The reason for this is unknown.", "/wiki/Tadbulb": "Tadbulb can generate and store enough electricity to power cities such as Levincia. It is also capable of using electricity to float in the air; if the weather is stormy, it can float at a higher altitude. Tadbulb are known to inhabit wetlands and riverbanks.", "/wiki/Tapu_Fini": "Kapu-Rehire may be a combination of kapu (Hawaiian for sacred or holy) and 鰭 hire (fin).", "/wiki/Tyrunt": "Tyrunt has some similarities with Amaura. Both are Rock-type Pokémon introduced in Generation VI with a base stat total of 362 and evolve starting at level 39, although Tyrunt evolves at day instead of during the night.", "/wiki/Tropius": "Tropius may be a combination of tropical and -saurus (common suffix in names of dinosaurs and extinct reptiles derived from the Ancient Greek word for lizard). It may also involve tropism (orientation of plants in response to a particular environmental stimulus).", "/wiki/Throh": "It may also draw inspiration from namahage, demons wearing oni masks, replacing the mino with a judogi.", "/wiki/Tapu_Koko": "Kapu-Kokeko may be a combination of kapu (Hawaiian for sacred or holy) and コケコッコー kokekokkō (Japanese onomatopoeia for a rooster's crowing).", "/wiki/Toucannon": "Dodekabashi may be a combination of どでかい dodekai (huge) and 大嘴 ōhashi (toucan).", "/wiki/Trubbish": "Yabukuron may be a combination of 破く yabuku (to tear) or 破ける yabukeru (to get torn), ぶくぶく bukubuku (loose-fitting), and 袋 fukuro (bag).", "/wiki/Torterra": "Dodaitose may be a combination of 土 do (earth or ground), 大 dai (large), 土台 dodai (foundation), and tortoise.", "/wiki/Thwackey": "Thwackey can use its two sticks to create a rhythmic beat. The faster a rhythm Thwackey creates, the more respect it earns from its peers. Often, when it drums out rapid beats in battle, Thwackey will get so caught up in the rhythm that it does not realize its opponent has been knocked out. To further develop its sense of rhythm, it constantly uses it in daily life. It can always feel a beat, and it walks while swaying back and forth to this beat, along with drumming with its sticks.[1] As seen in the anime, Thwackey can groom its friends to cheer them up; this is its way to show friendship and trust. In Generation IX, Branch Poke is its signature move.", "/wiki/Tinkaton": "Dekanuchan may be a combination of でかい dekai (huge), 鍛冶 kanuchi (blacksmith), and the Japanese diminutive suffix ～ちゃん -chan.", "/wiki/Ting-Lu": "Ting-Lu and Dinlu may be a combination of 鼎 dǐng (ancient Chinese cauldron) and 鹿 lù (Chinese for deer). The English name is formatted in Wade–Giles, a romanization system used in the Anglosphere for most of the 20th century.", "/wiki/Toxapex": "Dohidoide may be a combination of ど酷い dohidoi (very cruel) and 海星 hitode (sea star).", "/wiki/Tauros": "Kentauros may be derived from Κένταυρος Kéntauros (Greek for centaur).", "/wiki/Tornadus": "In Therian Forme, Tornadus resembles a bird of prey; it is mostly similar to an eagle, vulture, or other large avian species. It is also loosely inspired by the Vermilion Bird (Chinese: 朱雀 Zhūquè) of the Chinese Four Symbols.[2] It may also draw inspiration from other avian mythological figures, such as Huītzilōpōchtli, a god from the Aztec mythology that resembles a hummingbird; or from Garuda, a mythical birdlike creature with both zoomorphic and anthropomorphic features.", "/wiki/Tapu_Bulu": "This guardian of Ula'ula Island is able to command vegetation to grow and change shape to its will. Despite its fearsome power, it is largely inactive, leading some to consider it a lazy Pokémon. It has a peaceful disposition and does not like to cause unnecessary violence, so it rings the bell on its tail to alert others of its presence. However, it is merciless to those who offend it and it is said to have once repelled thieves from its ruins by swinging trees like clubs.[1] The ruined Tapu Village stands as another example of the guardian's wrath.", "/wiki/Tyrogue": "Tyrogue is a combination of tyro (a beginner) or tyke (child) and rogue (one who is playfully mischievous). Ty may also be referring to Mike Tyson. Rogue may also come from agōgē (the training program of Spartans).", "/wiki/Terrakion": "Terrakion may be a combination of terra (Latin for earth) or terracotta (a clay-based material, as well as its respective color), takin, and champion.", "/wiki/Tangrowth": "Mojumbo may be a combination of もじゃもじゃ mojamoja (shaggy or unkempt) and jumbo.", "/wiki/Thundurus": "In Therian Forme, Thundurus most closely resembles reptiles such as serpents or dragons. It is also loosely inspired by the Azure Dragon (Chinese: 青龍 Qīnglóng) of the Chinese Four Symbols.[2] This inspiration is alluded to in Pokémon Legends: Arceus; the Azure Dragon represents the east, and in Hisui, Thundurus roams the eastern Cobalt Coastlands area. Additionally, Thundurus may be based on the Qilin, a mythical creature from East Asia described as having a horn on its forehead and occasionally associated with lightning.", "/wiki/Tsareena": "Amajo may be a combination of 甘い amai (sweet) and 女王 joō (queen, also Japanese slang for dominatrix).", "/wiki/Tyrantrum": "Tyrantrum may be a combination of Tyrannosaurus or tyrant and tantrum.", "/wiki/Typhlosion": "Bakphoon may be a combination of 爆風 bakufū (blast from an explosion) and typhoon.", "/wiki/Torkoal": "Torkoal digs through mountains in search of coal. If it finds some, it fills hollow spaces on its shell with the coal and burns it. If it is attacked, this Pokémon spouts thick black smoke to beat a retreat.", "/wiki/Teddiursa": "Teddiursa appears to be based on a bear cub, such as the cub of an Asian black bear, whose Japanese name (ツキノワグマ tsukinowaguma) literally means \"ring-of-the-moon bear\". Teddiursa's appearance also resembles a teddy bear, and possibly the cubs of other honey bear species such as the sun bear or sloth bear.", "/wiki/Torracat": "Despite sometimes acting spoiled with those that it trusts, Torracat has a fierce battle spirit. It loves to fight, and its relentless onslaught causes others to lose the will to fight. Its punches are capable of bending iron bars with a single strike.[1]", "/wiki/Togekiss": "Togekiss may be a combination of 刺 toge (spike) and kiss, referencing its kind nature.", "/wiki/Togepi": "Togepi and Togepy may be a combination of 刺 toge (spike) and ピヨピヨ piyopiyo (onomatopoeia for a bird chirping).", "/wiki/Treecko": "Treecko resembles a gecko. Its design specifically shares some similarities with the leaf-tailed gecko, a species of lizard that blends in with plantlike appendages and can also climb up flat surfaces.", "/wiki/Trevenant": "Ohrot may be a combination of 大 ō (big) and ロット rot (as in a root rot).", "/wiki/Trumbeak": "It also appears to be somehow related to various brass instruments: its names reference trumpets, its category is the \"Bugle Beak Pokémon\", and its ability to change its call by bending its beak is similar to that of a trombone, which works by altering the length of the slide.", "/wiki/Turtwig": "\"A Tiny Leaf Pokémon. Despite its animal appearance, Turtwig actually has vegetation sprouting from its head. The shell on its back is made of soil and hardens when it drinks water. Much like a plant, Turtwig performs photosynthesis, absorbing sunlight and making oxygen. It also relies heavily on water to keep its plant healthy and thus spends a lot of time near lakes. Turtwig evolves into Grotle.\"", "/wiki/Tirtouga": "Protoga may be a combination of Protostega and tortuga (Spanish for turtle or tortoise).", "/wiki/Toedscool": "Nonokurage may be a combination of 野 no (field), 木耳 kikurage (jelly ear), and メノクラゲ Menokurage (Tentacool).", "/wiki/Tentacool": "In a flashback in A Cacturne for the Worse, May was scared by multiple Tentacool due to being surrounded by them at one point in her childhood. This had resulted in her mother attempting to catch her after mistaking her for a Tentacool.", "/wiki/Tynamo": "Tynamo has an organ that generates electricity, which it discharges when in danger. A single Tynamo does not generate much power, so groups of Tynamo move in schools and create a shock that is comparable to lightning. The Pokémon Company merchandise artwork and several TCG illustrations depict Tynamo swimming in or leaping out of bodies of water.", "/wiki/Torchic": "Torchic's gender difference may be based on vent sexing, a chick sexing technique that originated in Japan, where feces is squeezed out of the chick in order to open its cloaca, allowing the chick sexer to observe whether it has a bump inside its cloaca. Normally only male chicks have this bump.", "/wiki/Toxtricity": "Strinder may be a combination of strings (of a stringed instrument) and salamander.", "/wiki/Thievul": "Thievul may be a combination of thief, evil, and vulpine (of or pertaining to foxes; foxlike).", "/wiki/Tapu_Lele": "Kapu-Tetefu may be a combination of kapu (Hawaiian for sacred or holy) and てふてふ tefutefu (an old way of writing butterfly).", "/wiki/Tinkatuff": "Tinkatuff carries a large, gray, crude yet sturdy hammer, with loose metal plates for the hammer head and what appears to be the old hammer Tinkatuff had as a Tinkatink on top of the shaft. Tinkatuff makes its hammer using metal it collects from groups of Pawniard and Bisharp, which it preys on. Two Tinkatuff will smash their hammers together in order to test out the hammers' strength. Tinkatuff lives in homes made from piles of scrap metal. It is a female-only species. Tinkatuff largely resides in various ruins across Paldea.", "/wiki/Toedscruel": "Toedscruel may be a combination of toadstool (another name for mushroom), toed (having toes), and Tentacruel.", "/wiki/Urshifu": "Wulaosu may be a combination of wushu (Chinese martial arts), 老師 / 老师 lǎoshī (Chinese for teacher), and possibly ウラー urā (hurrah, battle cry) and 押忍 osu (interjection used in Japanese martial arts).", "/wiki/Ursaring": "Ursaring, Stantler, and HisuianQwilfish's evolution requirements, as well as Scyther's evolution into Kleavor, are all programmed into Pokémon Scarlet and Violet, with the Pokémon being affected by the Eviolite item. However, the methods are disabled, preventing the Pokémon from evolving. Ursaring is programmed to evolve into Ursaluna through usage of a Peat Block, which is unobtainable in Pokémon Scarlet and Violet.", "/wiki/Uxie": "A Knowledge Pokémon. It's said that Uxie's emergence gave humans the wisdom to improve their lives. This Pokémon possesses the ability to erase the memory of those who see its eyes. Uxie uses status-altering moves in battle--its frequent use of Yawn is very effective in putting foes to sleep. Uxie makes its home in Lake Acuity in the Sinnoh region.", "/wiki/Unown": "Unown's appearances are corruptions of the 26 letters of the modern Latin alphabet, as well as the exclamation and question marks. Unown's G form specifically may be based on a double-story lowercase G. The shapes of the Unown are used like graphic symbols in the Pokémon world, although in Hoenn and the Sevii Islands, their place is taken by Braille. Unown being weak alone and strong together may be inspired by the idea that a single letter cannot convey much information, but many letters forming a sentence can communicate a hypothetically infinite number of interpretations and ideas.", "/wiki/Unfezant": "Unfezant are known to be immensely proud and intelligent. It prefers to not feel close to anyone other than its Trainer.", "/wiki/Ursaluna": "Gachiguma may be a combination of 月輪 gachirin (round moon) and 熊 kuma (bear).", "/wiki/Umbreon": "Umbreon may be a combination of umbra (darkest part of a shadow in an eclipse; Latin for shadow) and eon (an immeasurably long period of time, possibly referring to how long evolution takes naturally). Eon is a suffix all Eeveeevolutions share and was Eevee's English prototype name.", "/wiki/Vulpix": "Rokon may be a combination of 六 roku (six), こん kon (onomatopoetic sound of a fox's cry), and 焜炉 konro (gas stove). It may also involve 恨 kon (grudge; from the curse its evolution may cast on its foes).", "/wiki/Varoom": "Varoom attaches itself to rocks that resemble wheels. These rocks constitute Varoom's diet, as it feeds on minerals from the rocks and converts them into energy. Rather than moving on the ground, Varoom is able to levitate and fly around. Varoom is used by Team Star as the rear wheels of the Starmobiles.", "/wiki/Vileplume": "Vileplume may be a combination of vile and plume (object that resembles a feather; cloud of dispersed substance) or bloom.", "/wiki/Venusaur": "According to Ken Sugimori in a Japanese interview discussing the Pokémon franchise, Venusaur and its pre-evolutions were inspired by frogs.[3] In particular, its short legs, stout appearance, ear-like protrusions on its head, and the Thick Fat Ability on Mega Venusaur, together make it resemble horned frogs. Unlike Bulbasaur, Venusaur's \"ears\" have hollows, indicating that they are in fact ears and not glands, as seen in many species of frogs and toads. It also shares similarities with the extinct Pareiasaur.", "/wiki/Vullaby": "Vullaby may be a combination of vulture and lullaby (which are often sung to children) or baby.", "/wiki/Virizion": "Virizion may be a combination of viridian (a bluish-green color) or viridis (Latin for green) and champion.", "/wiki/Vivillon": "Viviyon may be a combination of 美 bi (beauty), vivid, and papillon. It may also involve brillant.", "/wiki/Voltorb": "Biriridama may be a combination of ビリビリ biribiri (sound of electric shock) and 玉 tama (sphere).", "/wiki/Venonat": "Venonat and its evolved form are the Pokémon that went the longest without appearing in a regional Pokédex, excluding their appearances in remakes: prior to the release of Pokémon Scarlet and Violet, their last appearance in a regional Pokédex was in Crystal, almost 22 years earlier.", "/wiki/Vespiquen": "Similar to queen bees in real life, Vespiquen is a female-only species. Vespiquen is the sole queen of a hive of Combee, which it commands by releasing pheromones. The more pheromones Vespiquen produces, the more Combee it will have in its hive. As queen, Vespiquen gives birth to and raises Combee grubs, feeding on flowers to make honey for its progeny; it also controls and protects its hive. It is far more powerful than its Combee, and it will only take direct action if its Combee are unable to protect the hive; even so, the Combee will defend their Vespiquen even to the point of death. Vespiquen will destroy and feed on any outsiders it catches sneaking into its hive. However, if outsiders prove themselves to a Vespiquen by defending its hive, it may repay these acts of kindness with a reward.", "/wiki/Vibrava": "Vibrava may be a combination of vibrate (to shake rapidly) and larva. It may also derive from Vibra.", "/wiki/Vanilluxe": "Vanilluxe is based on a soft serveice cream served in an ice cream cone, with snow for scoops and ice for the waffle cone.[2] Specifically, its double-scoop appearance and head appendage resemble a double 99 cone with a chocolate bar stuck in it. The appendage on its head also resembles a wafer straw cookie. Additionally, Vanilluxe has bits of ice on its heads that resemble sprinkled nut topping. The 'cone' itself resembles icicles.", "/wiki/Vigoroth": "Vigoroth seems to be based on sloths, exhibiting traits most similar to two-toed sloths and ground sloths in particular. It also exhibits some similarities to Old World monkeys, particularly to baboons who have bright red rumps, short tails, and are known for violent outbursts just like Vigoroth.", "/wiki/Victreebel": "Victreebel has a long vine that extends from its head. This vine is waved and flicked about as if it were an animal to attract prey. When an unsuspecting prey draws near, this Pokémon swallows it whole.", "/wiki/Vanillite": "In Thawing an Icy Panic!, a Vanillite had been separated from a Vanillish and a Vanilluxe during their journey. It was taken care of by Nurse Joy in Coumarine City and soon became a minor local celebrity. It was eventually reunited with the Vanillish and Vanilluxe by the end of the episode.", "/wiki/Volcarona": "Ulgamoth may be a combination of ウルカヌス Urukanusu (Vulcanus), 蛾 ga (moth), and moth.", "/wiki/Vikavolt": "Vikavolt produces electricity with an organ in its abdomen and controls it with its huge jaws to fire powerful electric beams. When it clasps a Charjabug in its legs, it is able to utilize it as an extra battery. This allows it to continue firing powerful attacks. However, during fierce aerial fights, it will release Charjabug to make itself lighter and more mobile. It is an adept flier, capable of acrobatic maneuvers such as tailspins and sharp turns. Even as it weaves through complicated tangles of branches in the forest, it is able to maintain high-speed flight.[1] It is known to have a rivalry with Pinsir and Heracross. As shown in the anime, it likes to drink tree sap.", "/wiki/Vanillish": "Vanillish lives in southern, snowy mountains, which it migrated to during an ancient ice age. It creates ice inside its body by drinking water and then expels it to hide itself or freeze opponents. Its icy breath can reach temperatures of −148 °F (−100 °C). It can shatter frozen opponents with powerful headbutts. Vanillish are smaller in hotter regions, and although it can refreeze its body despite melting, this process can leave its appearance warped.", "/wiki/Venipede": "Despite the Scolipede and Centiskorch evolutionary families living in different parts of the Galarregion, both Venipede and Scolipede's Pokédex entries speak of their hostile relationship with the latter family.", "/wiki/Victini": "Victini is derived from victory,[2] and also possibly destiny, teeny, or tiny.", "/wiki/Volcanion": "Volcanion may be a combination of volcano and lion. It may also involve cañón (Spanish for cannon).", "/wiki/Veluza": "Veluza may be a combination of veloz (Spanish and Portuguese for fast) and merluza (Spanish for hake).", "/wiki/Vaporeon": "Vaporeon may be a combination of vapor and eon (an immeasurably long period of time, possibly referring to how long evolution takes naturally). Eon is a suffix all Eeveeevolutions share and was Eevee's English prototype name.", "/wiki/Venomoth": "Venomoth and its pre-evolved form are the Pokémon that went the longest without appearing in a regional Pokédex, excluding their appearances in remakes: prior to the release of Pokémon Scarlet and Violet, their last appearance in a regional Pokédex was in Crystal, almost 22 years earlier.", "/wiki/Volbeat": "Volbeat appears to be based on a lampyridae (also known as a glowworm, firefly, or lightningbug) like its counterpart, Illumise. Its coloring suggests that it may have been based on the subfamily Cyphonocerinae. Its appearance is based on a greaser, a subculture in the 1950s; their Japanese counterparts are the Bōsōzoku. Greasers usually wore black or brown Y-collared trench-coats and/or jackets with under shirts and also had heavily greased hair. This is shown in Volbeat's black colored \"shirt\", striped belly \"under shirt\" and \"collar\". The pose Volbeat takes in its official art may also be a reference to greasers, as they are commonly shown with their hands either holding or popping their jacket collars.", "/wiki/Wurmple": "Wurmple may be a combination of worm and rumple (creased or wrinkled in texture) or simple.", "/wiki/Wyrdeer": "Wyrdeer may be based on a reindeer, or the Yezo sika deer (called ユㇰ yuk by the native Ainu people), a subspecies of the sika deer native to Hokkaido (where Hisui is based on). Much like how Wyrdeer is treasured by Hisuian people because their fur makes for a useful clothing material, the Yezo sika deer is considered important to the indigenous Ainu people of Hokkaido — they are hunted for their meat and hide, the latter of which is used to make clothing. Due to its white beard-like mane and eyebrows, it also resembles an elderly man or Santa Claus, though it may also reflect the beards of Ainu men. Its antlers resemble shishi-odoshi or radio antennae.", "/wiki/Wigglytuff": "Pukurin may be a combination of ぷくぷく pukupuku (cute and chubby), ぷりぷり puripuri (angrily or in a huff; referring to its personality), くりくり kurikuri (big and round), and プリン purin (pudding; referring to its soft body). It may also involve 風船 fūsen (balloon) and 膨れる fukureru (to become inflated).", "/wiki/Wugtrio": "Wugtrio makes its habitat on coastlines and hides within its rock when spotted by humans. It is considered a particularly aggressive Pokémon species, wrapping its three bodies around prey and dragging them down to its lair. It was originally thought to be a regional form of Dugtrio, but this has since been disproven.", "/wiki/Wo-Chien": "Chionjen may be a combination of 蟲 / 虫 chóng (Chinese for bug) and 簡 / 简 jiǎn (Chinese for bamboo slips).", "/wiki/Whimsicott": "Whimsicott's behavior as a windswept wandering plant seems to be based on tumbleweeds. Furthermore, it displays a mischievous side akin to impish creatures from folklore like the Brazilian Saci; both are brown creatures that live in forests, ride on winds, and play pranks.", "/wiki/Wattrel": "Wattrel may be based on a storm petrel. Its design may also be based on either the myth of storm petrels indicating bad weather at sea, or a play on the words \"storm petrel\" as a whole, as lightning is usually present in storms. The shape of its head and eyes resemble an aviator hat. Its Violet Pokédex entry refers to an edible bird's nest, which is a delicacy enjoyed in the eastern parts of Asia.", "/wiki/Wailord": "PAL: With a height of 14.5 metres, Wailord is the largest Pokémon discovered thus far. 14.5 metres - that's roughly the size of a five-storey building! Also, Wailord can dive to a depth of 3,000 metres on only one breath. That's more than twice the height of Ben Nevis! Some remarkable stats for a remarkable Pokémon.", "/wiki/Wishiwashi": "Yowashi may be a combination of 弱し yowashi (weak, the classical Japanese form of 弱い yowai) or 弱々しい yowayowashii (frail) and 鰯 iwashi.", "/wiki/Wynaut": "Other languages' names for the Pokémon in this family, due to the fact that they were introduced in different generations, do not feature this pun.", "/wiki/Wooper": "Wooper and Upah may be derived from wooper looper (Japanese: ウーパールーパー ūpārūpā), a marketing term created in Japan that started a pet salamander raising fad. Wooper loopers are the Japanese term for the axolotl, a species of salamander.", "/wiki/Weezing": "Matadogas may come from 又 mata (again) and 毒ガス doku-gasu (poison gas). It may also be derived from マスタードガス masutādogasu (mustard gas).", "/wiki/Whiscash": "Pokémon Pinball: Ruby & Sapphire: After hitting the button changing the Pokémon bumpers on the Ruby Field a set number of times, Whiscash will appear in the pool. Hitting the ball into Whiscash's mouth will transport the player to the Sealeo Bonus Field. In the unlikely event that the ball hits Whiscash from behind, it will get angry and start an earthquake.", "/wiki/Woobat": "Koromori may be a combination of 心 kokoro (heart) or コロコロ korokoro (onomatopoeia for lightly rolling) and 蝙蝠 kōmori (bat).", "/wiki/Wiglett": "Some researchers initially confused Wiglett for a Paldeanregional form of Diglett due to their physical resemblance, but they are separate species and differ in habitat and diet. It is theorized that the two species ended up having similar body plans as an adaptation to suit their environments and burrowing behavior.[1][2]", "/wiki/Weepinbell": "Sebastian, Platinum's resident butler, has a Weepinbell that he uses to drive burglars out of the Berlitz mansion. When Diamond accidentally sneaked in thinking that he walked into a large park, all of the Pokémon accomplished was getting his clothes wet, though it proved to be an adept battler. It first appeared in Well Met, Weepinbell.", "/wiki/Whismur": "Gonyonyo may be derived from ごにょごにょ gonyo gonyo (onomatopoeia for whispering or mumbling).", "/wiki/Wartortle": "Wartortle may be a combination of war or warrior, water, tortoise, and turtle.", "/wiki/Walking_Wake": "Uneruminamo can be taken literally as うねる水面 uneru minamo (undulating water's surface).", "/wiki/Wailmer": "Despite being found as an overworld spawn in Frigid Sea, Wailmer is not in the Crown Tundra Pokédex. It is the only Pokémon that can be found through random encounters in the Crown Tundra to not appear in this Pokédex.", "/wiki/Wooloo": "Multiple other Wooloo appeared in Buddy, under the ownership of Milo. They alerted Milo to the presence of Hop's Wooloo when it fell into their farm. Two of them reappeared in Sky, and three of them reappeared in The Gathering of Stars.", "/wiki/Wobbuffet": "Sonans is homophonous with the interjection そうなんす Sō na-n-su, which roughly means, \"That's the way it is.\" It is played off by its pre-evolution, Wynaut, whose Japanese name, Sohnano, is nearly homophonous with the phrase そうなの？ Sō na no?, meaning, \"Really?\" Together, they make for a potential perpetual conversation of, \"Really?\" followed by, \"That's the way it is,\" and so on, as seen in Camp Pikachu.", "/wiki/Walrein": "In Walrein and Camerupt, Archie used a Walrein to battle against Maxie, and later when ironically fighting alongside the Magma Leader against Ruby and Sapphire, though they are able to exploit the two leader's weakness of taking little notice of each other's presence and easily won. A few more volumes later, in the climax of the Ruby & Sapphire chapter, Archie sends out several more Walrein alongside Maxie's multiple Houndoom to buy time for the two to escape, but are thwarted.", "/wiki/Weedle": "Weedle is the only Pokémon that cannot legitimately know any Normal-type moves.", "/wiki/Watchog": "In The Pokémon Harbor Patrol!, a Watchog was a member of a rescue team managed by a harbor patrolman named Halsey. While originally used only for crowd control and as a lookout, Watchog, with the help of N, proved itself to be a capable and valuable asset to its team.", "/wiki/Whirlipede": "Despite the Scolipede and Centiskorch evolutionary families living in different parts of the Galarregion, both Venipede and Scolipede's Pokédex entries speak of their hostile relationship with the latter family.", "/wiki/Wimpod": "Wimpod may be a combination of wimp and the taxonomic term pod (foot), such as in \"isopod\".", "/wiki/Wingull": "Wingull seems to be based on a gull. Its narrow wings cause it to resemble the simplified, V-shaped silhouettes of flying birds depicted in some drawings and paintings. Its wings may also be a reference to the V formation used by migratory birds. The length of its wings and its method of floating on air currents are similar to an albatross.", "/wiki/Wormadam": "Wormadam appears to be based on an adult female bagworm moth, which never develops wings and remains in its cocoon lifelong. The Trash Cloak form specifically appears to be made of fiberglass insulation, a wool-like padding that is often dyed pink. The idea of a cloak made from household materials may be inspired by household casebearer moths, whose larvae exhibit the same cloaking behaviour as bagworms, and make cloaks from dust, hair, and dirt they scavenge from homes.", "/wiki/Weavile": "Manyula may be a combination of 魔 ma (demon), マニューバ maneuver (referring to its cunning), and ニューラ Nyula (Sneasel).", "/wiki/Xurkitree": "Denjyumoku may be a combination of 電気 denki (electricity) or 電磁 denji (electromagnetism) and 樹木 jumoku (tree).", "/wiki/Xerneas": "Xerneas was designed so that its silhouette resembles the letter X,[2] and by extension possibly the saltire symbol in heraldry or the X mark. Appearance-wise, Xerneas resembles a cervid, more specifically the extinct species Eucladoceros.", "/wiki/Xatu": "Natio may be a combination of native and indio (Spanish and Italian for Native American).", "/wiki/Yungoos": "Yungoos and Youngoose may be a combination of young or ヤンキー yankī (a certain style of juvenile delinquent) and mongoose.", "/wiki/Yamask": "Desumasu may be a combination of death and mask. It may be a pun off of ですます体 desumasu-tai, a form of polite Japanese which gets its name from the fact that sentences often end in です desu or ます masu.", "/wiki/Yanmega": "Yanmega and Megayanma are a combination of 蜻蜓 yanma (large dragonfly) and Meganeura (a genus that is a member of an order commonly referred to as \"griffinflies\", gigantic prehistoric relatives of modern dragonflies/damselflies). Megayanma may also literally be \"mega yanma\".", "/wiki/Yveltal": "Yveltal may also be based on any number of avian-related figures from mythology, such as the Celtic death-goddess Morrigan, which often takes the form of a raven; or Norse mythological figures such as Hræsvelgr, which takes the form of an eagle and sits at the end of the world, or the hawk Veðrfölnir or the unnamed eagle that resides at the top of the world tree Yggdrasil. Additionally, it bears a striking resemblance to a species of fungus known as \"devil's fingers.\"", "/wiki/Yanma": "Yanma seems to be based on a dragonfly, possibly the banded darter. Because of its size and weight, it might have been inspired by prehistoric ancestors to modern dragonflies and damselflies in the Meganeura genus, commonly referred to as \"griffinflies\". This is further supported by its evolution, Yanmega, which is much more closely linked to ancient dragonflies, and whose offspring did not have a larval stage, instead hatching directly into a smaller version of their adult phase, as Yanma is a fully formed dragonfly.", "/wiki/Yamper": "Yamper tends to be drawn to fast-moving things and will chase after people, other Pokémon, or even vehicles. Yamper has an organ that generates electricity from the base of its tail when it runs. It cannot store the electricity it generates, so sparks of electricity can often be seen when it is running. In the Galarregion, it is a popular choice for herding Pokémon such as Wooloo. Due to its gluttonous nature, it will only assist people in exchange for treats.[1]Joltik are often seen on its hindquarters, feeding on its static electricity.", "/wiki/Zygarde": "Zygarde begins with the letter Z, following the pattern established by Xerneas and Yveltal. It may also be derived from ζυγωτός zygōtos (Greek for joined) or zygote, garde (French for guard), and garðr (Old Norse for enclosure; realm).", "/wiki/Zorua": "In addition, Zorua's habit of replacing children with itself is similar to Irish folklore about the changeling, a fairy-child that replaces human children kidnapped by fairies or, in some tales, the devil. Zorua also resembles the trickster characters of many cultures in both appearance and behavior; such characters are often depicted as foxes.", "/wiki/Zarude": "Its Dark type may reference the aggressive and violent nature of said primates. The use of vines to swing through trees is also reminiscent of how monkeys and apes are often depicted swinging on vines in jungles.", "/wiki/Zacian": "Additionally, the crescent shapes on its sword while using Behemoth Blade may reference Hati Hróðvitnisson, a wolf that chases after the Moon in Norse mythology.", "/wiki/Zoroark": "Zoroark may be a combination of zorro (Spanish for fox) and dark, 悪 aku (evil), or arch- (prefix for \"top\" or \"chief\").", "/wiki/Zeraora": "Zeraora's name may be derived from Zeus (Greek god of thunder), زر zarra (Arabic for \"to beam/glitter/shine\", \"to encroach upon one's enemy\"), and 虎 tora (Japanese for tiger) or tora (Faroese for thunder).", "/wiki/Zweilous": "Zweilous and Deino are the only Pokémon who have Hustle as their only Ability.", "/wiki/Zamazenta": "Additionally, the shape of its shining shield while using Behemoth Bash may reference Sköll, a wolf that chases after the Sun in Norse mythology.", "/wiki/Zekrom": "Zekrom is derived from 黒 kuro (black). Ken Sugimori has also stated that Ze was used because it was a harder, stronger sound than Reshiram's Re, and Zekrom is a \"powerful, strong character.\"[5]", "/wiki/Zubat": "Zubat seems to be based on a bat, particularly vampire bats, which bite other animals to feed on their blood. Its Poison type may be inspired by either the anticoagulant properties of vampire bat saliva or the fact that bats are infamous for spreading deadly diseases such as rabies. Its lack of eyes could be a reference to troglomorphism and may additionally be influenced by the misconception that bats are blind due to their use of echolocation to navigate. The claim that Zubat will suffer burns when exposed to sunlight may be inspired by mythological vampires.", "/wiki/Zangoose": "Zangoose is likely based on the mongoose, a cat-like carnivore that is well known for its ability to hunt and kill venomous snakes. It also bears a physical resemblance to the Turkish Angora and Persian cat breeds. The rivalry Zangoose shares with Seviper is based on the relationship both cats and mongooses have towards snakes.", "/wiki/Zigzagoon": "Jiguzaguma may be a combination of zigzag and アライグマ araiguma (raccoon) or 穴熊 anaguma (badger). Guma (from 熊 kuma, \"bear\") as a suffix is often used for mammals that resemble bears.", "/wiki/Zebstrika": "Zebraika may be a combination of zebra and 雷火 raika (flash of lightning).", "/wiki/Zapdos": "Zapdos may be a combination of zap and dos (Spanish for two, indicating that it is the second in the series of KantoLegendary birds)."}