[{"review":"A fun reinvention of the Pokémon formula, hopefully the next version keeps this change while giving it a better look","sentiment_score":1.0},{"review":"Best pokemon game of all time! New pokemon, new stuff to do, new ways to catch pokemon and better gameplay","sentiment_score":1.0},{"review":"One outstanding experience, that is certain. I absolutely love the direction GameFreak is going for with this whole new installment for the Pokemon series, and it is very refreshing, while being very needed at the same time. Catching Pokemon in this game is more fun than ever, and I'm a fan since the first era with the FireRed\/LeafGreen versions. It's way more than a nostalgia trip : it is a brand new experience and I sincerely do hope that we will see a bigger sequel to it because the game really deserves one with further gameplay enhancements, maybe a bigger map with more activities. Cheers to all the haters! ;)","sentiment_score":1.0},{"review":"Incredible game that moves the Pokemon series forward in a fresh new direction. The gameplay loop is fun, and while the graphics aren't great, they are more than fine. Gameplay should always take precedent over graphics, and Legends: Arceus is a joy to play!","sentiment_score":1.0},{"review":"Im so addicted! New mechanics and ideas are really fantastic! Can’t stop playing it! Over 40 hrs and still can’t put down the console! The world is really beautifull, exploration is truly amazing. The only grip is the performance and graphics but the game has it own graphical moments. Must play for sure!","sentiment_score":1.0},{"review":"This is such a spectacular evolution for the Pokémon franchise. From the first few moments, you know you’re stepping into a new, fresh take on the series, and the game continues to surprise time and time again even into 40+ hours of gameplay.","sentiment_score":1.0},{"review":"A delight to play this game, perfect evolution of the saga with a magnificent exploration, completing the pokedex is very satisfying unlike in traditional pokemon that was more of a nuisance than anything else, graphically it is not bad at all but that is the least important, it's fun, it's addictive. Enjoy!","sentiment_score":1.0},{"review":"This is the best Pokémon game I've ever played. To me, it feels like what I thought I was playing when I was a child 20 years ago, but without having to imagine so much.","sentiment_score":1.0},{"review":"I'll get this out of the way, the graphics is the only thing imho that needs polish, but they are still servicable. I been playing the game for over 10 hours and honestly most fun I had in years with a Pokemon game. This game is testing grounds for future Pokemon games in this style. So let's put the graphics aside for a moment and look at the bigger picture here. Aside from Graphics do you want more. Pokemon games like this? I sure do, that's why despite the graphics needing more, that this game deserves a 10.","sentiment_score":1.0},{"review":"Excellent step in the right direction for Pokemon. Do not listen to the bad reviews. They are weak and shall be forgotten!","sentiment_score":1.0},{"review":"Finally this is the change in the saga what the true consumers demanded, hope the next generation with 1000 pokémon will be full open world and the best gen of all times.","sentiment_score":1.0},{"review":"A game with terrible graphics and technical issues but extremely fun and addictive gameplay. This is the right direction for Pokémon! It’s so much more enjoyable than the boring exploration and battles of Sw\/Sh and S\/M. Exploring, crafting, discovering new Pokémon. It’s a blast. Also the 0\/10 reviews are from people who obviously didn’t even bother playing the game and are just hating on it because it looked bad in the trailers and they don’t like to be wrong.","sentiment_score":1.0},{"review":"Best pokemon everhistory 10\/10gameplay 10\/10OST 10\/10art\/graphycs 7\/10+1 for funny","sentiment_score":1.0},{"review":"The best pokemon game so far. The world feels immersive, the gameplay is fun and escapes the old formula which was getting stale after every game being near enough a copy paste of the last.","sentiment_score":1.0},{"review":"The Pokemon game I've been waiting for since I first watched the anime as a kid.Visuals are a little lacking but everything else is amazing.8\/10 inflated to battle the trolls.","sentiment_score":1.0},{"review":"It's been a long time since I've picked up a pokemon game. Think alpha sapphire was the last one. I remember picking up pokemon red. And it has come a long way. After playing this game, all I want now is for them to do the remake of the Kanto region. With all the original pokemon.","sentiment_score":1.0},{"review":"a refreshing new take on the series the ball-catching mechanics are great and I love the options the game gives graphics could be better but the story is also very good.","sentiment_score":1.0},{"review":"100% adicted, I love pokemon, played since Gen1, but I didnt enjoy the games since Y\/X. And now im hooked!The quests, the new pokedex mechanics, the pokemon roaming , its all so much fun!! For real, giv it a try, you wont regret it","sentiment_score":1.0},{"review":"This is a huge step for turn based rpgs.Its open world simple yet difficult at times.and for a company that only really made hand held games it a huge step.There is negative here but come on its a fun fresh new turn based experiance that i theory should get better","sentiment_score":1.0},{"review":"Oops!... GameFreak did it again.It's been awhile since GameFreak released a good Pokemon game. The last one is Pokemon Emerald, obvi!Holy Arceus, I don't know why it took sooooo long for them to release another masterpiece.I am excited to see this formula milked for the next 2 decades, me thinks.Looking forward to Pokemon Legends Kyurem or Deoxys!","sentiment_score":1.0},{"review":"This is finally the game we should have got a LONG TIME AGO, seamless battle, great world to explore, a bit of freedom in how you want to tackle things, this is for me the first real 3D pokemon game.There is some flaw, the pokedex is not that big, the move selection is a bit shortened, and there. is quite a lot of repetition, an lack any form of PVP even casually, but aside from this this is the best pokemon experience so far","sentiment_score":1.0},{"review":"this is the best game GF has made in more than 10 years. i hope they continue in this direction","sentiment_score":1.0},{"review":"This is everything I imagined Pokemon to be as a kid, while there are some things I think need an adjustment, the entire game is absolutely refreshing. I love being able to find shiny Pokemon in the wild just sitting there. If this is the future of all Pokemon games I am absolutely on board, definitely my favorite game yet!","sentiment_score":1.0},{"review":"Excellent game! Great start for a series I hope continues to evolve and put out multiple sequels.","sentiment_score":1.0},{"review":"The Pokemon game we needed. I recommend it for Pokemon fans as well as those who have never played a Pokemon game.","sentiment_score":1.0},{"review":"Great Pokemon Game a must have role playing game for ur Nintendo Switch the gameplay is amazing as well.","sentiment_score":1.0},{"review":"It's just amazing, this is the new beginning for pokemón series, off course graphics could be better, but you forget about that quickly when you start playing.","sentiment_score":1.0},{"review":"This is my first Pokemon game, and I just want to say that it awesome. I never believed that I'd say such a thing. This game made with love to old school pokemon fans and newcomers.","sentiment_score":1.0},{"review":"Despite its graphical problems, this is the way of the franchise should walk.It's a must to all pokemon and rpg fans.","sentiment_score":1.0},{"review":"I enjoyed it very much, I love all the changes they made to this new Pokemon game. Best Pokemon game in the last ten years!","sentiment_score":1.0},{"review":"Dont believe what rat fan boys says about PLA, its a great pokemon game, the graphics are not good (its a 2gb graphic card) but the big step its done. I love the game, it has everything that fans need.","sentiment_score":1.0},{"review":"Ignore negative reviews with 0 ratings. They are made by a handful of miserable people who set out to review bomb this game.","sentiment_score":1.0},{"review":"It's not about the graphics. It is about the feelings, the gameplay and being a true RPG Pokémon fan.","sentiment_score":1.0},{"review":"The most fun I’ve had playing a Pokémon game since FireRed. Refreshing and highly addicting gameplay. I hope Pokémon continues in this trend going forward.","sentiment_score":1.0},{"review":"amazing game, bad graphics, but is the way that gamefreak must follow to do the perfect Pokemon","sentiment_score":1.0},{"review":"So, so good. Gamefreak really outdid themselves this time, and it's about time they did. I can't recommend this game enough if you've gotten tired of burned out on the usual Pokemon formula.","sentiment_score":1.0},{"review":"Compared to the previous entries in the franchise, this is one hell of a game, in a really good way.","sentiment_score":1.0},{"review":"Great Game a new experience i love Pokémon and i love nintendo exclusive, Buy now My friend","sentiment_score":1.0},{"review":"This is the best pokemon ever made. It has faults but comparing it to the older games it is clearly the best game. The people giving it negative reviews are clearly people who just arent into pokemon and just want to jump on the \"gamefreak lazy\" hate train. Everyone I know who loves pokemon is playing non-stop. I am someone who got the game early and I have battled arceus. It was one of the most fun boss battles iv ever played! And this game overall was fantastic!","sentiment_score":1.0},{"review":"Is a solid 8, a great evolution, but im giving it a 10 for the review bombing.you mad that we are having fun? uwu.","sentiment_score":1.0},{"review":"Perfect. Even both graphics and world blurry or bad textures, I approve the experience to play pokémon as breath of the wild Zelda","sentiment_score":1.0},{"review":"This is the kind of Pokemon game we were asking for years. Since Pokemon Black and White, the franchise needed a change, and here it is!","sentiment_score":1.0},{"review":"This game is fantastic! Yes graphically it could be better, but at least for me it doesn't effect my entertainment level in this case. The thing that is really mattering to me is just how much fun it is, once I have started it is hard to stop for hours. It has a gameplay loop that feels good and is very much a \"Just one more thing\" sort of loop. This is no doubt my favorite Pokémon game to have ever released and I hope that the next big title learns from this game, Pokémon is back baby!","sentiment_score":1.0},{"review":"It has some problems, sure, but boy is it fantastic. Make all Pokémon games like this from now on please!","sentiment_score":1.0},{"review":"The only thing this game could improve on is graphics. This is a huge step forward for pokemon.","sentiment_score":1.0},{"review":"This is the summation of various concepts that have been cooked up within the franchise over the years.A fantastic game that knows what to innovate, and also knows what to keep, personally I can't get off the screen of my Switch because catching pokémon and fighting with them against all kinds of wild creatures is totally stimulatingGame Freak deserves all the love for this.","sentiment_score":1.0},{"review":"Graphics aside, I think that this is the best game of the franchise by far!","sentiment_score":1.0},{"review":"Amazing gameplay. Feels fresh and makes you really feel like you’re interacting with the world and Pokémon","sentiment_score":1.0},{"review":"Most fun I've had in a Pokémon game in years.Exploring the different areas and completing Hisui's Pokédex is so addictive! I hope future installments build on what's currently set by legends Arceus.","sentiment_score":1.0},{"review":"The game even factoring in the technical issues is terribly good. I couldn’t imagine a more immersive setting and gameplay. The smoothness of the gameplay loop is ridiculously good, I’m truly having fun like the the first time I played a pokemon game and re living the wonder I felt diving into Hyrule in Botw.This is a 9,6 rounded up, because some details in the shadows should’ve been dealt with properly. The rest is pretty much everything you’ve ever wanted… and a little more.","sentiment_score":1.0},{"review":"Game is extremely fun. Been playing Pokemon since blue\/red\/yellow came out, and this is a really nice turn they achieved. It's totally different then your traditional Pokemon game and I love it. Wide open world, Pokemon everywhere... It's what I have been waiting for since a kid. As what others have said, graphics are a bit meh, but it's still really fun. Dangerous change they did, and imo it worked. Let's hope they improve upon this for the next game","sentiment_score":1.0},{"review":"Love it, this new direction is great and I hope Game Freak expand on it. The gameplay is unique and only Pokemon is capable of making this work.","sentiment_score":1.0},{"review":"Best Pokemon game. This is the way, there is no way back, this is what Pokemon needed","sentiment_score":1.0},{"review":"This is the way that pokémon games should be. The graphics is not that bad and actually it's a sort of unique for Pokémon games.It's amazingly Satisfying.","sentiment_score":1.0},{"review":"This game is an 8 but because it looks like they finally listen and there is a lot of pointless 0 i am going to give them a 10 , I hope they continue down this path and continue improving the franchise , they need to put more effort in the graphics , i love the style but there is a lot of graphical problems , also make the world feel more alive with more interactive pokemon and npcs , also i want to see more dungeons and caves more moves and see how they improve the battle system more","sentiment_score":1.0},{"review":"This is easily one of the best pokemon games released in years, highly recommend to anyone.","sentiment_score":1.0},{"review":"The gameplay itself is so addictive, innovative and good, that I rate it 15\/10.This equalizes the downsides of the graphics that are only sometimes bad. In general graphics are actually good and similar to Breath of the Wild.Sound is good, e.g. echoes in caves and different great music in situation like nearby strong enemies. Finally I can love Pokemon again. All last 4 games before were bad, finally a masterpiece. The game mechanics itself are fun enough to keep you playing","sentiment_score":1.0},{"review":"Easily the best Pokémon game that has come from GameFreak! All the new mechanics work and flow really nicely. Yes the graphics aren’t amazing but for what they are they are good.","sentiment_score":1.0},{"review":"The evolution the franchise needed. Hope the next game follows the same path as this one.","sentiment_score":1.0},{"review":"I am absolutely addicted. Fantastic shake up to the formula and the best Pokémon experience by far to date.","sentiment_score":1.0},{"review":"The most entertaining Pokémon game ever. There's so much done right that can make me forgive the one big problem, the underwhelming graphics.Other than that, it's a perfect game.","sentiment_score":1.0},{"review":"It was a very very bold move of Game Freak in changing the entire formula of a succesful franchise like Pokémon. I believe this is just the begining of a new generation of Pokémon games, and I'm so happy to be a part of this. The game is awesome, fun and beautiful. Don't listen to the haters, some are just graphics weebs or people who doesn't like good changes. Enjoy this adventure!!","sentiment_score":1.0},{"review":"The best pokemon game I've ever played. The innovations in the game are very successful. Gamefreak has shown us what he can do whenever he wants.","sentiment_score":1.0},{"review":"A total step in the right direction. The game is not perfect, but as a first iteration in something new it comes as close as it can. I haven't been this engrossed in a Pokemon game to where I'll spend many hours at once playing in quite a long time.","sentiment_score":1.0},{"review":"The graphics are not great. Aside from that, this is one of the most enjoyable Pokemon games I've ever played. It might be THE most enjoyable. People are really giving it zero just because they don't like the graphics or the new forms.","sentiment_score":1.0},{"review":"I’ve been tired of Pokémon games for a few years now but I loved this game from start to finish. This was the perfect blend of nostalgia and innovation. It’s not perfect but it was a huge step in the right direction. I hope this will continue to be the new style of games that game freak makes because if it is I’ll be there day one for all their new games.","sentiment_score":1.0},{"review":"Game is an 8 but because it is the best of the series it gets a 10 in my book lol.","sentiment_score":1.0},{"review":"Best Pokémon game since Pokémon black and white. I like the new action and stealth elements in the game.","sentiment_score":1.0},{"review":"Probably the best Pokémon switch game yet, definitely the most fun! Anyone who is complaining about graphics or lack of Pokémon need to see this as the best jump forward for the video game franchise. Brilliant","sentiment_score":1.0},{"review":"Great stepping stone for the franchise, hopefully gen 9 builds on this! Everything in the world is so seamless and fun that you can sink endless hours.","sentiment_score":1.0},{"review":"Best Pokémon I've ever played, no doubt, I mean seriously, this is the change that pokemon needed.","sentiment_score":1.0},{"review":"An incredible game, this was what pokemon lacked! It's funnyAn incredible game, this was what pokemon lacked! It's interesting and funny, I really liked it a lot, I really like it a lot","sentiment_score":1.0},{"review":"This game is what Pokemon nedeed for the future, PLEASE DO NOT BE A ONE OFF","sentiment_score":1.0},{"review":"The best Pokemon game yet. Definitely worth the time and money investment. It is definitely a step up for the developers at Game Freak. I look forward to what they'll bring us in the future. They should be very proud of this entry into Pokemon canon.","sentiment_score":1.0},{"review":"muito bão, mas muito bão mesmo isso sim very good is forever now game its play nice camon inthe game very well in the world chapion easy boy is definitive game note maxima inthe game family","sentiment_score":1.0},{"review":"Pokémon Legends: Arceus is easily the next evolution in the series; presenting an experience that blends elements of action-RPGs and open world adventure titles, making for a highly-rewarding game for series newcomers and true believers alike. The graphics and gameplay are among the best the series has to offer, making this a must-own title for Pokémon fans and Switch users everywhere.","sentiment_score":1.0},{"review":"Best game of pokemon in a long time.The change the formula a little an it works nicely.A lot of story and new mechanics makes this game perfect.I hope that it will be a new line of Legends games in other regions.","sentiment_score":1.0},{"review":"All I can say,this game is a breath of fresh air!","sentiment_score":1.0},{"review":"Absolutely revolutionary for the pokemon franchise. I Loved every bit of the game. This is certainly a step in the right direction. Good job gamefreak!","sentiment_score":1.0},{"review":"Much better than the last remake , and for me is more appealing than sword and shield , I have played all the Pokemon games from red to the last remake and this feels like a breath of fresh air , of course graphics are not great but I know that a have Nintendo switch with half of TFLOPs of a regular PS4 at least it runs o. 1080 p docked.","sentiment_score":1.0},{"review":"Its a refreshing pokemon game that feels so much fun! The mechanics are so good and catching all pokemons has become so much immersive than ever before! Hope the series will continue this open world feel.","sentiment_score":1.0},{"review":"Amazing game, a complete revamp of the pokemon game concept. Though the graphics are slightly disappointing, this game more than makes up for it in sheer fun!","sentiment_score":1.0},{"review":"By far the best Pokémon game of all time.It's far superior in any way, comparing past games to this is ridiculous.","sentiment_score":1.0},{"review":"I've played it for well over 20 hours and I've barely scratched the surface of it! Great value and it's quickly becoming one of my favourites (if I'm being honest it could become the very first but I haven't finished the main story yet)","sentiment_score":1.0},{"review":"This is the best Pokémon game since Soul Silver. Pokemon games should have had this type of gameplay since the switch to 3D graphics. This spin off is better than most of the previous Pokémon games and Gamefreak should focus all their attention on making Pokémon games in this style from now on.","sentiment_score":1.0},{"review":"Love the total shift in the gameplay, right from the start. could be visually better, but in the end gameplay wins, which is streamlined and fast in PLA. Super addictive and time just flies while enjoying the exploration. Hopefully this gameplay mechanic will be seen through new pokemon games, and i hope as much that there will always be main-line pokemon games also","sentiment_score":1.0},{"review":"You can say what you want about the graphics not being perfect, but the game experience Pokemon Arceus delivers makes it by far the best pokemon game of the franchise","sentiment_score":1.0},{"review":"Very enjoyable game thus far. The best game in the series no doubt, I'm convinced the people spamming the game with 0 score reviews haven't even touched it.","sentiment_score":1.0},{"review":"it could be better but rating it 10 so game freak realizes this format is has a lot of potential so they make a sequel","sentiment_score":1.0},{"review":"To be honest, I expected less. However, right at the game entrance I was amazed to see how diffrent the game feels. I thought that PL: Arceus would be lackluster and new fighting style of Pokemon wouldn't be as entertaining and simply won't have the same effect, nevertheless I was proven wrong. I could've wrote even more about this masterpiece of a Pokemon game, but I am too lazy :p.","sentiment_score":1.0},{"review":"Addictive game. I love exploring, sneaking around, throwing stuff, collecting items. Actually, the crafting feature is very fun. One of the best games I’ve played.","sentiment_score":1.0},{"review":"Best Pokémon game I’ve ever played. It switches up the formula in ways the series desperately needed and lays the groundwork for more innovation in the future.","sentiment_score":1.0},{"review":"This game is amazing, played 15 hours of it and i am having a blast and probably will be playing it for much longer","sentiment_score":1.0},{"review":"I am fascinated with how new this title brings. It's been 12 hours now and I can't stop playing. The music and sounds of nature are immersive, the world is wide and fun to explore, you can make your own tools, the story is interesting...One of the best Pokemon games in years","sentiment_score":1.0},{"review":"I have been playing since Red and Blue and this feels like the first time that I have had that level of interest and enjoyment from playing a pokemon game. The new mechanics are great which leaves to a very engaging and addicting gameplay loop. There are some nice quality of life improvements but most importantly, shiny hunting is really streamlined and feels more obtainable rather than doing an obscure shiny hunting method.TL;Dr, I recommend this is you love pokemon but want a fresh change.","sentiment_score":1.0},{"review":"Excellent game, ideal for people of all ages.In its main story it may seem easy, but in its huge post-game is where it keeps the challenge for the most experienced in Pokémon","sentiment_score":1.0},{"review":"Very good game, I didn't really like what TPCI\/GF gave us over the last few years, but this one is very different. The gameplay feels very new and different but does not eliminate the important elements for pokemon, Catching and Stealth system feels very fun, The difficulty of the game is not too difficult nor too easy, but there are some battles that feel difficult. The main thing is that finally GF puts effort into the game itself","sentiment_score":1.0},{"review":"Honestly, I love the game, its mechanics are dynamic and realistic and there is so many quality of life improvements. The story is really nice and for the first time, I'm really excited to complete the dex. The bosses are challenging and the game, in general, is incredible in my opinion. I don't find the graphics to be bad they are a natural progression. It's a top game a must-have.","sentiment_score":1.0},{"review":"Arguably the best pokemon has been in about 20 years. With clear influence from games like Monster Hunter and Breath of the Wild, Pokémon Legends: Arceus gives you the freedom to explore that you wish you had in Pokémon Snap with all the attractions of a main series Pokémon game and more.","sentiment_score":1.0},{"review":"Incredible how Game Freak managed to use a whole new playing method, different than the \"Pokemon formula\" they used in the previous games and still managed to do an incredible work.In my opinion, easily top 5 Pokemon, only behind masterpieces such as Platinum and Heart Gold.","sentiment_score":1.0},{"review":"An incredible evolution for the Pokémon franchise. The graphics need to be better, but the game is amazing and you can spend hours and hours just having fun. The new battle mechanic is great, the capture mechanic is really good as well","sentiment_score":1.0},{"review":"The game is a bold step towards a better future for the franchise. Its super fun, expansive, lots of things to do, story is better than previous main entries, etc.It still has room for improvement, specially when it comes to the graphics and other technical aspects, but if we are going to get more Pokemon games like this in the future, I'M ALL IN.","sentiment_score":1.0},{"review":"I had a really fun time playing this game. Graphically the game isn't the best, and I have to say i was pretty upset with the fact there was no online battles, but this is setting up something fantastic for the future of pokemon. Im really excited of whats to come.","sentiment_score":1.0},{"review":"The Pokémon game that I wanted since my childhood. It’s so addicting, the game rewards you for everything! I’m loving this game so much.","sentiment_score":1.0},{"review":"Quickly becoming one of my Top 5 Switch games. I hadn’t played a Pokémon game since Diamond, but this one is making me a super fan.","sentiment_score":1.0},{"review":"This game is really cool. The mechanics are complex enough to make success feel rewarding, but not tedious at the same time. It has what you love about a Pokémon game reworked without all the repetitive stuff. The gameplay loop of going out and researching Pokémon and then coming back to the hub to manage your inventory, quests, etc.. is addicting. The performance is ok; it doesn’t ruin the immersion, but it could be better.This game has a lot of variation, it’s really an experience and gives the same feeling I felt when playing other famous switch titles. I’m looking forward to seeing the publisher build off this formula.","sentiment_score":1.0},{"review":"When I was 10 years old Pokemon Blue and Red Version were released on the Gameboy. Pokémon Legends: Arceus is everything that I imagined Blue version was while playing all those years ago. In my opinion this is the greatest thing to happen to the franchise.","sentiment_score":1.0},{"review":"I'm glad we finally see some ambition. Graphics drop this game to an 8 or a 9 if you're not a Pokemon fan but I'm giving it a 10 because I want all the next Pokemon games to be as ambitious as this one","sentiment_score":1.0},{"review":"incredible game, the best in the franchise, mixing the greatest mechanics from pokemon and open-world games in general","sentiment_score":1.0},{"review":"it was simply awesome! The new mechanics are very fun and very welcomed after 20 years of the same formula! Must buy on the switch!","sentiment_score":1.0},{"review":"Please don’t pay attention to the minority of poor reviews on this game, needless to say giving this game a “0” isn’t an accurate and gives no insight to how good it is. For someone who has played Pokémon since the very beginning, this game is what I’ve wanted since I was a kid. I’ve already put 20 hours into Legends Arceus and I can’t wait to continue playing.","sentiment_score":1.0},{"review":"I have been very prejudiced with this title and with its studio, this game takes the idea of catching pokémon to another level that we have never experienced in the main sagaI love how you can fight with any pokémon and that the battle environment is the same overworld, The difficulty is quite decent IMO.Despite what some say about its graphics, they are actually lovely.","sentiment_score":1.0},{"review":"The best Pokemon game of all Franchise, new formula, and everything in this Game is a hard work of Game Freak to bring us Legends Arceus, i can't stop play.","sentiment_score":1.0},{"review":"This is what the franchise and the fans needed, amazing open world filled with Pokémon, best recent pokémon game by far.","sentiment_score":1.0},{"review":"I never expected a pokemon game to grab me like the days of old. Been sort of going through the motions with previous titles of the mainline games but this one has me going deeper into it. Great to see the changes. Graphics be damned if the game is good it's ok it's not the prettiest one at the PokeBall.","sentiment_score":1.0},{"review":"Well, i think it's the best Pokemon Game since Gen 3, Story is great for a pokemon game too.","sentiment_score":1.0},{"review":"The game is a step in the right direction anyone who gave it anything under a 7.5 either didn’t play it or just a hater throwing out 0s all over","sentiment_score":1.0},{"review":"20 hours in and by far, the best Pokémon experience ever. The only drawback in the game is graphics but considering the game development cycle was only an year I don’t mind it. The character, story, Pokémon and soundtrack are great as well but definitely the best part of the entire game is the gameplay, They completely revamped the Pokémon Gameplay and it is worth it.","sentiment_score":1.0},{"review":"It's THE GREATEST Pokémon main series game in history. A little lacking but graphics are more advanced than the previous series, vast and moderately divided territories, fun to collect, proper fusion of existing series and actions, bosses of various patterns, sub-quests that do not interfere with main content, and dramatic stories! How can this game be boring? I was able to feel with my whole body that GameFreak worked hard!","sentiment_score":1.0},{"review":"awesome game, i recomend it for all pokemon fans. Innovative game.❣️good job GAME FREAK","sentiment_score":1.0},{"review":"Loving the game!! Not the best graphics but a step in the right direction I love being able to roll off mountains I do wish there was a jump button but I am enjoying the game right now and I can’t wait for a future versions","sentiment_score":1.0},{"review":"Just good, there aren't many other words to describe how well Game Freak has managed to deal with a new style of game. After polishing and improving the current system for years.Its a game that everyone has to play, only playing it is understood because despite the average graphics, one falls in love and has it fixed on the screen.","sentiment_score":1.0},{"review":"To limit the quality of this game only to the graphics is to think in a very reductionist way, it is to limit the discourse in a mononeuristic direction that doesnt benefit anyone or seek any solution, only to complain in a destructive way without any reason.This game is surprisingly fun, vast and full of things to do, once you start the journey, it's hard to get off until you finish it.The prejudice that the general community has for the game could not be better described than with the word Unfair.Play it, and you'll know what I mean.","sentiment_score":1.0},{"review":"Pokémon Legends: Arceus innovates and moves the Pokémon franchise in many ways. Pokémon battle transitions seamlessly take place in the overworld, and only happen when you throw out one of your Pokémon’s Pokéball. This removes annoying random encounters, but there’s still danger to traversing the wild. Aggressive Pokémon will attack you! It’s pretty difficult. Battle animations have received an overhaul and now look super cool and actually run over and hit each other. They are also properly sized, and wild Pokémon are now more powerful. There are side quests as well. This is a super good game that you should buy.","sentiment_score":1.0},{"review":"A game completely up to the circumstances and that meets every expectationPokémon on Switch is simply on fire, with each game the franchise gets better.","sentiment_score":1.0},{"review":"One of the best games that Game Freak has made along with Emerald, Platinum, Ultra Moon and Shield+Expansion.The leap in quality they have made in such a short time is incredible.","sentiment_score":1.0},{"review":"This game is exactly what pokemon needed. Is not perfect, but the new mechanics and the freedom are too good. Imagine explore Kanto with this formula, please, gamefreak, this is the way.","sentiment_score":1.0},{"review":"I am loving it! The battle mechanics are fun. The only downside for me is the graphics. Overall, a breath of fresh air for the franchise.","sentiment_score":1.0},{"review":"Great game, get it right now grrrrrrrr you better buy it because it’s good and my review is this long because I can’t make it shorter","sentiment_score":1.0},{"review":"Best game ever I really love the graphics and everything about it's great this might just be my favorite game of all time","sentiment_score":1.0},{"review":"Gameplay is incredible, it’s a mix of Zelda Breath of the wild exploration in the vast over-world and Monster hunter style concept with the Pokemon charm. Totally blew me away. The story is top notch, the best Pokemon game ever released. It’s everything I wanted Pokemon to be when going 3D.","sentiment_score":1.0},{"review":"Huge step in the right direction! With PLA as a foundation, the future of Pokémon games looks bright. It’s not perfect and I understand the qualms regarding the graphics and lack of voice acting. However, this is a MAJOR improvement over the lackluster and lazy Sword & Shield and I am having a blast. If you’re on the fence, I recommend giving it a chance. I would’ve given it an 8 or 9, but since so many trolls are review bombing it, I’m bumping it to a 10 to try and balance it out. Most fun I’ve had in a Pokémon game since Red & Blue.","sentiment_score":1.0},{"review":"Normally I'd give this game a 8, but since everyone is giving zeros........","sentiment_score":1.0},{"review":"This is the best Pokémon game I’ve ever played. It’s everything I always dreamed of since I was a kid playing Red\/Blue. Yes, the graphics could be better, but the game is so much fun that it makes up for it. I’m so happy that Game Freak finally left their comfort zone and tried something new. I’m in love with this game and can’t stop playing it!","sentiment_score":1.0},{"review":"this is the pokemon game i have looking for since a kid. despite the bad graphic this game is insanely good for me","sentiment_score":1.0},{"review":"Overall this game is a great stepping stone for the Pokémon Franchise as a whole. The mechanics and gameplay are phenomenal and I feel this is a great starting point for the games going forward. All of my friends who have picked up this game absolutely love the game and are having a blast.Anyone who has rated this game a 0 you are just review bombing this game. You have absolutely nothing to complain about, Nintendo did a great job showing off all kinds of different videos showing off gameplay.","sentiment_score":1.0},{"review":"Best Pokémon Game in a long long time. A fresh take on Pokémon is just what was needed. Good gameplay.","sentiment_score":1.0},{"review":"I usually don't leave ratings.This is a solid 8\/10Very addictive.Obviously, there are some issues, including the lackluster graphics, the barren landscapes, etc...Giving it a 10 to counteract the 0-3 scores given.","sentiment_score":1.0},{"review":"Pokémon Legends Arceus is a great game amazing open world feels like a true RPG catching Pokémon is better than ever Pokémon models are great the Pokémon battles are amazing This game is a new positive direction to the Pokémon franchise also the Exploration is amazing and is very rewarding the ranks are nice. Arceus is a great visual game with the mechanics of the game not being repetitive at all. The story is great and the unique pokemon to the game are the most coolest things you ever saw Overall Pokémon Legends Arceus is one of the best Pokémon games ever that I recommend buying.","sentiment_score":1.0},{"review":"The fans can never be happy. This game is fun and can bring new fans. This game doesnt repeat what the last previous games has done. Only problem is that it doesnt have good draw distance. However, this game is fun better then other games and will always be criticized because fans arent happy to get what they want. Sword and shield wasnt that bad of a game. People who dont play these games also criticized without proof (angry joe is definitely one of them because he claimed this is for kids yet he played animal crossing) so rating 9.5 but definitely a 10 because of its good story","sentiment_score":1.0},{"review":"The new system gives very new fun. The fun of collecting has doubled than before. Difficulty levels bring interest to the game.","sentiment_score":1.0},{"review":"Best Pokemon game in a decade. This is what fans have been wanting for years. The catching and battling mechanics feels so good!","sentiment_score":1.0},{"review":"Excellent game! Visuals do not distract from the incredible gameplay flow. The best story and gameplay loop the series has ever had.","sentiment_score":1.0},{"review":"A new world to experience. Love the new features. It's worth my time. I really enjoyed it.","sentiment_score":1.0},{"review":"The gameplay elements are very fun and interesting in this game and are a big step forward for the series, though the graphics could improve.","sentiment_score":1.0},{"review":"Botw graphics + the pokemon we always wanted. I hope gamefreak continue this way and make a AAA game with this formula.","sentiment_score":1.0},{"review":"A really nice game for anyone who has been complaining about these games for the past few generations","sentiment_score":1.0},{"review":"Most fun i had in a while with a pokemon game. The new mechanics are really cool and it really feels like you are a part of the game. Huge step in the right direction and im so excited to see what they will bring in the future.","sentiment_score":1.0},{"review":"This is the most interesting game. The graphic is very good and theres are funny asdfk;","sentiment_score":1.0},{"review":"A perfect example of Pokémon and it’s what I wanted after seeing the first episode of the anime. Even with the technical limitations of the Switch it expands the series in a great new direction and sets a roadmap for the future.","sentiment_score":1.0},{"review":"Fun 11\/10 we all have eyes but gameplay ist still the most important think. And its great! Botw feelings","sentiment_score":1.0},{"review":"Best Pokemon experience I've had since b2w2. I started the series with Yellow so I am ecstatic about this direction","sentiment_score":1.0},{"review":"Best game of pokemon by far, this is a great change for franchise, we have to support this type of big changes and not destroy it with ridiculous ratings without non sense.","sentiment_score":1.0},{"review":"Pokémon Legends Arceus is the greatest surprise for me in the last years of playing Pokémon. I expected a game with small content, horrible graphics and a middle quality-gameplay. What i got was a lot of content, graphics that are okay and a gameplay that has a higher quality than i could dream of. I really hope that we'll get a second part in a few years, because i didn't feel such a joy while playing pokémon for at least the last ten years.","sentiment_score":1.0},{"review":"This is format I'd like to see for future Pokemon games, freedom to explore, no tedious walking through grass and constantly encountering Pokemon. The effort point system is miles ahead of the old system, changing moves on the fly in the menu is amazing. The only downside is that it can be hard to see some Pokemon from a distance. Also moving forward we should go into a more voice acted approach for these games because it can seem a bit quiet.","sentiment_score":1.0},{"review":"Thought i would not like it. Turns out to be one of the best switch games so fae!","sentiment_score":1.0},{"review":"This is, by far, the greatest Pokémon game ever made. I really hope they continue the trend of doing corresponding Legends games for each existing generation.","sentiment_score":1.0},{"review":"By far one of the most enjoyable Pokémon games I’ve played, going all the way back to Red and Blue. I do miss having a lot of trainer battles, however, the new mechanics introduced in the game and the story have made the game very enjoyable. I hope they can continue off of this game and make more with the new features that were introduced.","sentiment_score":1.0},{"review":"Arceus is the game we’ve all wanted since we were little I’ve been playing for 20 years now and this is a refreshing and exciting take on the franchise.","sentiment_score":1.0},{"review":"The gane Is awesome, this Is the Pokémon what needs to transform in a better experience.","sentiment_score":1.0},{"review":"Best pokemon game of all time!!!!! Chupem haters! Mandaram muito bem, dessa vez.","sentiment_score":1.0},{"review":"As a lifelong fan from playing Pokémon yellow at 5 years old to Pokémon legends arceus… Wow just wow. Okay this game if you love the franchise or even new. Beautiful addicting gameplay that offers an amazing experience","sentiment_score":1.0},{"review":"Insanely good game, it's a really unique and amazing experience, there are so many cool new features that could partly even make it into the main series because of how good of an improvement they are. Im not even close to finishing the game, especially storywise because im busy completing dex entries, but i can alr tell you its more than worth it to check it out, huge recommendation even to non pokémon fans.","sentiment_score":1.0},{"review":"I now have 18 hours of gameplay in the new Pokemon. And it's more fun than it's been in a long time. The fluid gameplay between catch, fight and explore is just awesome. Yes, Gamefrak didn't put much effort into the graphics and preferred to put their resources into the reorientation of the gameplay, that would be the only point of criticism for me. Otherwise, the new Pokemon convinces me all along the line!","sentiment_score":1.0},{"review":"It is very close to the Pokemon game that everyone has dreamed of for years. It is a rather innovative game compared to the usual main series, in which the company acts boldly. The quality of the animations this time and the fact that it offers a very fluid game experience in the open area were the aspects I liked the most. I really liked this game.","sentiment_score":1.0},{"review":"Hands down the best Pokemon game ever made. It's everything you ever wanted. Can't wait for this series to continue!","sentiment_score":1.0},{"review":"Of course that's not my true rating, but until people will be allowed to vote 0, which isn't realistic for any game, I will have to give a fake vote for balancing.It's an addictive game and really fun, despite technical blunders.","sentiment_score":1.0},{"review":"A fantastic departure from the same ol tired formula. It may not be the most visually impressive game, but graphics never made a game truly great to begin with. The poke collecting\/adventuring\/battling all feels fresh and fun. The world is incredible and all the lore tidbits are going to please any long term pokefanatic.","sentiment_score":1.0},{"review":"The best Pokemon game ever made, finally after 26 years GF shaked up the formula and it worked!!The game looks terrible, but it's still a masterpiece","sentiment_score":1.0},{"review":"Best Pokemon game ever. Really laid the groundwork for the future games.Free roam is what we have always wanted, and the updates to the move pool system, the graphics, everything is awesome. Only wish HP was kept the same.","sentiment_score":1.0},{"review":"This is a step in the right direction. Hopefully they incorporate some of these mechanics into the next generation","sentiment_score":1.0},{"review":"Fun new Pokémon experience. I think the graphics get entirely too much hate. Aside from one particularly ugly cloud, everything looks nice and has a watercolor sort of feel to it. Can easily sink over 50 hours into it, and the core gameplay loop is fun.","sentiment_score":1.0},{"review":"One of the best Pokémon game ever, it’s a breath of fresh air to the series that long overdue. All though the graphics lack","sentiment_score":1.0},{"review":"Best Pokémon game up to date. I'm really enjoying it, from the gameplay to the mechanics, everything feels fresh.","sentiment_score":1.0},{"review":"This is the best Pokémon game they have ever made and if they do not iterate on these systems I will be disappointed","sentiment_score":1.0},{"review":"It feels really amazing to actually have a new Pokemon game where i don't already know how to do everything before i even start, capturing Pokemon is a whole new experience, the fighting is more dynamic and way less straightforward, the progression is very Zelda like where you are more of a Pokemon Researcher than a trainer. Overall this is the best way this franchise could possibile grow, so excited for the future.","sentiment_score":1.0},{"review":"honestly its not perfect but it is so lovable and has a charm similar to the original games, I spent so long doing side quests finding Pokémon in new locations and finally catching hard to get Pokémon. honestly the game feels so good and alive. been critical of Pokémon since ORAS, but this is a great experience for a hardcore fan like me.","sentiment_score":1.0},{"review":"It is one of the best Pokemon Games ever! I have now over 20h playtime and are done with the main story and it was sooo funny! Yeah, the grafics aren't the best but the mechanics are so smooth and it feels so good to catch pokemon or farm resorces. I hope that the incoming games are like this!","sentiment_score":1.0},{"review":"I love the idea, it makes me hope for a better future also the nature is not perfect but for a switch I think they did a great job and I am going to wnjoy it","sentiment_score":1.0},{"review":"best pokemon game so far and most relaxing and exploring is also fun and graphics issues seems nothing","sentiment_score":1.0},{"review":"The game was the must fun I had with a Pokemon game in a long time, It shakes up the formula in the right way, keeping things interesting and making you think about how and when to approach pokemons. The only downside is the graphics, it should have been better and i think it could have better if they dedicated the game a bit more time of development. I'm giving it a 10, even with its flaws, because I hope they will use this game as the stepstone to build future installments rather that going back to the old formula for the next generation of games","sentiment_score":1.0},{"review":"Good job!I am enjoying this game a lot. This is the way Game Freak have to take. Maybe the graphics are not the best but the rest is so fun and enjoyable. Sincerely I love it.","sentiment_score":1.0},{"review":"One of the best games and one of the best Pokémon, a serious candidate for best RPG at The Game Awards.","sentiment_score":1.0},{"review":"This game revitalizes the Pokemon formula with tons of new ideas and advances for the franchise. Have not enjoyed a pokemon game this much in a long time, and I've played every generation of pokemon since gen 3. The gameplay loop is engaging and really inscentivises catching as many pokemon as possible. Sidequests are pretty diverse and never feel like copy-pastes of each other. Also every npc in jubilife village has a name and feels like a real character and I love that.","sentiment_score":1.0},{"review":"This one of the best Pokémon games that have ever been made. The game play is fun the story is one the most Surprising aspects of the game. Don’t listen to the negative review there are lot we can take from this game and what can come in the future. There definitely improvements on the game but I truly love it and have been having playing for days now","sentiment_score":1.0},{"review":"Pokémon Legends: Arceus is everything that sword and shield wished it could be. I said what I said","sentiment_score":1.0},{"review":"The pokemons are so cute and there are many new things to check out. Love this.","sentiment_score":1.0},{"review":"In my opinion this is the best game that Pokémon has done since Gen III, and the most creative, period. I say that as someone who has played every generation and enjoyed all of them somewhat. It really captures what people should expect from the franchise, and I hope it sets the standard going forward. The new battle system is fantastic, the art direction works well, and the gameplay is honestly pretty engrossing. 10\/10","sentiment_score":1.0},{"review":"Best Pokemon Experience ever, Good mechanics, Great Gameplay , nice Back up Story","sentiment_score":1.0},{"review":"I really love the game, It gives me the good old feelings of being a chad and having a thick but good time","sentiment_score":1.0},{"review":"This has to be my favorite Pokemon game of all time, and I am not even that far into the game yet. Easily puts this game into my top 5 games of all time. The exploration is very rewarding along with being able to pace break the game given some trial and error regarding catch rates. The overall theming is absolutely wonderful and being able to interact with your Pokemon in new ways is always a nice and sweet thing to do. Absolutely recommend to anyone who is a Pokemon fan or enjoys collect-a-thons or open world games.","sentiment_score":1.0},{"review":"I think trying something new in a pokemon game is awesome. And this game gives as so many new features and a new style.","sentiment_score":1.0},{"review":"Amazing game! Love capturing all the mons, exploring, completing side quest, and more. The story is really cool, there are explonations for some of the things that are in: pokemon d p p \/ bd sp like why spear piller is in ruins and how the reigon got the name shino it's just wonderfull. Obviusly this is not the \"perfect\" pokemon game, but it's close. Some of the things i wish were a litle better are the graphis wich aren't bad just not as good as i wanted. So yeh greate game, do recommend!","sentiment_score":1.0},{"review":"New Pokémon is refreshing change of pace on the franchise. Great play experience with the new catching mechanics.","sentiment_score":1.0},{"review":"Everything is in place here, if only they had worked on the visuals more and added some form of voiceover it would have been 10\/10. It is a pity because the next game in the series will not be that big moment for the franchise anymore, no matter what it looks like. It's like a waste of opportunity to impress everyone and sadly great gameplay is overshadowed by visual problems. For me it's still the best pokemon game since gen2","sentiment_score":1.0},{"review":"I absolutely adore this game. I‘ve been playing Pokemon since I was four and diacovered every single generation, but couldn‘t really enjoy anything that came out after X and Y. Legends Arceus on the other hand gives me a sense of immersion no other Game Freak game has created, the game as a whole just works perfectly within its own world. Sure, the graphics won‘t win prices, but they also didn‘t bother me, and the gameplay more than makes up for it. Game Freak delivered, and I hope they learn from this game and continue to improve in every aspect!","sentiment_score":1.0},{"review":"This is the best pokemon game since third generation. Cant stop playing it.","sentiment_score":1.0},{"review":"Best Pokémon game so far ! Very addicting been playing it 4 days straight !","sentiment_score":1.0},{"review":"The best Pokémon game. I am a fan of the main series, I always considered almost perfect the original formula but with this game GameFreak reinvented the franchise with a new combat system, a exciting gameplay, amazing music and a entertaining campaign.The only “issue” with the game is the Nintendo Switch outdated hardware.","sentiment_score":1.0},{"review":"As a person who played all the Pokémon games, including the spin-offs, i never enjoyed something in this universe like Legends: Arceus. Is addicting, is well made, and kinda impossible for me to stop playing. Its the kinda of game that you play until you fall to sleep. Really hope that the Pokémon Company keep going with that format and understand that this was the best step they took in all Pokémon franchise.","sentiment_score":1.0},{"review":"I haven't had this much fun on a pokemon game since HeartGold\/SoulSilver. Please game freak continue with this system!","sentiment_score":1.0},{"review":"I think this is the BEST Pokémon Game, is a reinvention, the graphics could be better but there are no vas, i love the new Pokémon, the music is incredible, the BEST point is all the posibilities that you can do, capture, history, pokedex. A 10. (Enamorus tótem is horrible xd)","sentiment_score":1.0},{"review":"THE BEST POKEMON GAME TO DATE..An amazing game that, if indulged in all aspects, can lead to countless hours!pokemon can't go back from this! great for new and old players alike.","sentiment_score":1.0},{"review":"Simply the best main series Pokémon game since Black & White 2. Very addicting gameplay, major improvement to Pokémon models and animations, loads of QOL improvements, seamless gameplay. Such a great step forward for the series and something Pokémon fans have been wanting for years!","sentiment_score":1.0},{"review":"Great story and controls and an amazing world. They finally progressed! It's still not how it could be, but still I hope they use this concept for more games until they found an even better concept.","sentiment_score":1.0},{"review":"Great game. Love the interactions with the pokemon in the overworld!!! The developers really worked to make them come to life!","sentiment_score":1.0},{"review":"One of the best Pokémon games I’ve played in a long time. I’d love to see more Pokémon Legends games that look and play similarly to PLA.","sentiment_score":1.0},{"review":"Honestly one of the funnest games I have ever played. Definitely not perfect, but a step in the right direction for Pokémon. An absolute must-have!","sentiment_score":1.0},{"review":"Finally a rework of the old formula to make Pokémon fun and exciting again!","sentiment_score":1.0},{"review":"Hands down my fav Pokemon game and I've been playing since Red\/Blue. The capture\/battle system makes wandering the world of Pokemon feel alive. Can't wait to complete my Pokedex, then get perfect entries and shiny hunting!","sentiment_score":1.0},{"review":"Love the game. It’s a refreshing change for the Pokemon series. I haven’t had this much fun with any game in a long time.","sentiment_score":1.0},{"review":"This is the best new way to play a Pokémon game. It’s not for little kids anymore, and the content is solid. Needs some more Ui enhancements and more Pokémon, but all in all a perfect game","sentiment_score":1.0},{"review":"This game is awesome. I look forward to Nintendo pushing a new design for Pokémon, and am excited to see the future of Pokémon games based on it.","sentiment_score":1.0},{"review":"What you imagine pokemon should be like if you watched the show its an amazing game with so much to catch and it makes you really want to catch them all .","sentiment_score":1.0},{"review":"Loving it. There’s never a boring moment, there’s tons of stuff to do. The act of throwing the ball at the Pokémon and the target system is a lot of fun. Crafting the things you need (poke balls, potions, etc) was a great idea for this game.","sentiment_score":1.0},{"review":"A fantastic game. The future of the franchise, never before a Pokémon world has been so alive, neither in the mediocre anime adaptation. The graphics without doubt can grow exponentially in next chapter, and could step from a incredible game to a proper masterpiece. A great hope for the future.","sentiment_score":1.0},{"review":"Legends Arceus is EASILY the most fun I’ve had with a Pokémon game in a very long time. This is the game that makes me optimistic for the future of Pokémon.","sentiment_score":1.0},{"review":"This is...... amazing ! (This is one of the best pokimon games) :D","sentiment_score":1.0},{"review":"I haven’t had this much fun on Pokémon since the original ruby\/sapphire\/emerald.","sentiment_score":1.0},{"review":"I don't want to write a big review, but this is one of my favourite games ever. Yeah it doesn't have the best graphics but if ur a pokemon fan u honestly won't care at all its a 10\/10 for me I could play it all day. If u just want to play it just to find any flaws then go for it but if you've played it for quite a bit you'll know its a sick game and really enjoyable.","sentiment_score":1.0},{"review":"The new mechanics are very fun and very welcomed after 20 years of the same formula!","sentiment_score":1.0},{"review":"It is absolutely the most beautiful and involving Pokémon game I have played in a lot of time. The change was for good.","sentiment_score":1.0},{"review":"Really enjoying this game. It is quite the unique take on the Pokémon series!","sentiment_score":1.0},{"review":"This game is like crack, best pokemon game in years! so much fun! Graphics aren't the best but it really isn't bad in handheld mode and the gameplay makes up for any shortcomings","sentiment_score":1.0},{"review":"Great fresh addition to the series! Some performance and graphical issues, but overall I hope to see more entries with this format!","sentiment_score":1.0},{"review":"Amazing game, it’s like a ninja Isekai Pokémon breath of the wild love child! Super addictive and fun!","sentiment_score":1.0},{"review":"finally the game we have waiting so many years, freedom, tangible Pokemon, much more dynamic battles, a story that is not bad at all and many hours of fun, which reminds me of the illusion of my first Pokemon. Even so there are still people who believe that a game is only its graphics. I invite them to sell their Nintendo Switch and buy another console, because they are wrong.","sentiment_score":1.0},{"review":"Best pokemon game in a long time. The are minor issues with the textures and frame rate but still an amazing game.","sentiment_score":1.0},{"review":"Best Pokemon experience I would say. Previous games have been tedious and too easy, and easy games mean no fun. This game is significantly more challenging and I very enjoy it. The pokemon are more vivid and for the first time, I have the desire to fill in the Pokedex instead of finishing the main story as soon as possible. Although the graphic is not the best, especially in water, I would say this game is a great leap and I truly have a blast.","sentiment_score":1.0},{"review":"Amazing game, this is the way gamefreak should follow for the next pokemon games, just improving and polishing graphics.","sentiment_score":1.0},{"review":"Game is awesome, first 2-3 hours might feel a bit slow but after that it's really fun, also the history is the best of the Pokemon series, even better than B\/W on my opinion.The music is fantastic too, and the graphics might feel a bit sharp at the beginning, but as you progress on the game it feels much more smooth (especially on handheld mode).","sentiment_score":1.0},{"review":"My best Pokemon game ever. Great interaction with Pokemon, nice game-play and decent story and sub-quests. I hope that Game freak keeps this direction to develop a new Pokemon game. I really enjoy it!","sentiment_score":1.0},{"review":"The best mainline release of the franchise hands down. I couldn't have asked for more in a Pokemon game since I was a kid. This is what I envision the series looking like going forward. Absolutely awesome game. Thank you Game Freak! This is a great base, build on it please!","sentiment_score":1.0},{"review":"Pokemon Legends Arceus was something to get hyped of right from the start when they teased it. The Massive Openworld makes this game really interesting to discover More and MORE!!! With the ability to control the camera angle was great from Sword and Shield's wild area but in this game, we are free to use this feature everywhere. As well as the battles and while talking to NPCs in some case. I really enjoy playing this game and spending hours and hours in it catching'em all. Really appriciate their effort in this game. I am now looking forward to GameFreak's next project.","sentiment_score":1.0},{"review":"New fresh bold improvement, everything in this is so lovable to me as rpg lovers. Beautiful open world, fresh way of battling and evolve pokemon, just love it. Best pokemon game ever ! Living the LORE !","sentiment_score":1.0},{"review":"Great gameplay and battle mechanics changes. Hoping that this is the direction pokemon is going. Great job Game freak","sentiment_score":1.0},{"review":"Is perfect!!! Is the game that I wanted since I play \"my first pokemon game\", pokemon ruby.","sentiment_score":1.0},{"review":"I should have given it 9 points. Even if it is not perfect, I am still willing to give it an encouraging 1 point. It's very close to the Pokemon world I imagined when I was a child, but it's ten years late. Unfortunately, I can only take time to play this game occasionally at this busy age. If it can maintain this level in the future, I will like to buy Pokemon games for my children.","sentiment_score":1.0},{"review":"The best and most refreshing Pokemon game to release in a very long time, so good it makes going back to the other pokemon games seem to be a chore. Which I am fine with. Could use more content of course but with that said, definitely a chance they took but with a huge win.","sentiment_score":1.0},{"review":"This game deserves a 10\/10 just for the Volo fight alone... But it also comes with an entire video game","sentiment_score":1.0},{"review":"this is a salute to all seasoned pokemon players that can still be enjoyed by new ones. the story was great (not stellar, but that is not the centre of this game) and sure, the graphics could be better, but we're essentially playing it on a tablet with thumbsticks... what really shone in this game was gameplay. the controls and the feeling of catching are so natural that you can do it for 50 hours and still not be bored by it... i hope we can expect more legends games in the future, as this has been my most enjoyed pokemon experience since the original dpp games","sentiment_score":1.0},{"review":"The best an most innovative Pokémon game ever made! Almost the exact game I was imagine when first started to play Pokémon as a kid. A great step for GF to change the old formula for something new!","sentiment_score":1.0},{"review":"I was intially sceptical as the recent D\/P remakes and Sword\/Shield were bad, but after some friend recomendation, I gave it a shot. Turns out, this is one is the great one. This game on itself is just as good as Gold\/Silver was back in the day. Initially, I'd give it 7\/10, but the more I played it the more I liked this - there's plenty of content in this one, and they're adding new quests in updates. And yes, some of the terrain graphics are bad, but the game is fun, so it doesn't matter that much.","sentiment_score":1.0},{"review":"A break from standard tradition, Pokemon finally gets it's first truly open-world 3D game, with plenty of exploration and an emphasis on catching and researching Pokemon! The only downside is it could use some graphical polish.","sentiment_score":0.8705481072},{"review":"Starts off a little slow and the menus are a mess also needs a better story but the game play is amazing i love it","sentiment_score":0.8807861832},{"review":"Here we have a very good game with the twist of a gameplay we've been waiting for. World is interesting and progressive with the story but also gives you enough freedom to do as you please. Very recommendable.","sentiment_score":0.8950230508},{"review":"The best Pokémon game in (at least) 10 years. It could have better graphics, but it is an improvement over the past games","sentiment_score":0.0},{"review":"This game is a solid 9. Probably the best pokemon game ever released.The graphics are pretty sub-par for 2022 but that stops mattering 20 minutes into the game.In my view I haven't had as much fun playing a new release in quite a while.","sentiment_score":0.8980668859},{"review":"Don’t believe the super low review scores from others that haven’t even played the game. While there are issues, Legends Arceus is the biggest leap forward the franchise has seen yet, resulting in one of the best games the franchise has to offer.","sentiment_score":0.0},{"review":"The game is really fun to play, it's addictive and has a pleasant Japanese vibe. The introduction is pretty long but it's not boring.I've never been a fan of Pokemon games but I like this one because it's 3rd person, has cute graphics, and has an interesting grind with quests.But the game has its disadvantages. A lot of people complain about graphics; to me, it's just fine and doesn't disturb my eyes.The most awful thing in the game, in my opinion, is audio. Some sounds are way too junky or compressed.","sentiment_score":0.8672924251},{"review":"The most fun I've had playing a Pokemon game in a long time. The graphics could have used more polish with more detail but overall it isn't as bad as the outrage over it. The ways of encountering, catching, and battling is seamless and intuitive and provide massive positive steps forward for the series. Future mainline Pokemon games should look at this game as the bare minimum and baseline of what it should be.","sentiment_score":0.8917920516},{"review":"Best Pokemon game experience ever. The quality of life improvements, new combat mechanics, the open world areas, the quest\/mission based progression, reward system and the ability to shift from exploration to combat seamlessly truly make this a breakthrough for the series.","sentiment_score":0.8970720577},{"review":"Everything said about the graphics is true, but if you enjoy pokemon you are going to love this game and spend hundreds of hours.","sentiment_score":0.8871618372},{"review":"Great game, I've never been this excited about playing Pokemon since I first played it in the third generation. In my opinion, this new formula should be the future of the franchise. I just didn't give it a 10 because I believe the graphics is a little out of date, just a little, but that doesn't affect the player's experience at all.Good job, GameFreak!","sentiment_score":0.0},{"review":"The game is uglyBut is great fun!Realy interesting and envolvingIm loving itBut is 10 yo graphics","sentiment_score":0.8834208767},{"review":"Graphics could be better. Overall though, it's the best foot forward gamefreak has had in a while. Great new mechanics, and the flow of gameplay is incredible.","sentiment_score":0.8751432066},{"review":"I love what Game Freak tried with this gameThey need to stop phasing out Pokémon as it would add more variety","sentiment_score":0.8721168703},{"review":"This game is very fun whether you've played any Pokemon game before.This is the most important aspect for a game and it definitely delivers despite its flaws and subpar visuals that many are unhappy about.","sentiment_score":0.8807861832},{"review":"good game pokemon , a pokemon game i've been looking forward to since childhood","sentiment_score":0.0},{"review":"This is game is a love letter to those who enjoy Pokemon and its lore. Don't miss this game if you are a fan of the games. Even with some comments that I've seen about the graphics and all — the game runs fine. Coming from Shin Megami Tensei V, which is a technical masterpiece on its own, Pokémon Legends Arceus manages to impress me with the detail it has for its fun mechanics and catch-them-all-based nature. One game not to miss.","sentiment_score":0.8960576405},{"review":"fun game. i havent had this much fun playing a pokemon game in years, love the changes they made to it. the only thing im not a fan of is the graphics, seems abit plain. either than that its a very solid game.","sentiment_score":0.0},{"review":"Best pokemon experience I've ever had so far, it was everything I.ve always wanted and imagined of the Pokemon world. One point from perfect for the terrible graphic.","sentiment_score":0.0},{"review":"I finally feel Pokémon is back on the right track. Legends Arceus mix the new features from games like Pokémon Let's Go, Pokémon Sun\/Moon, and Snap to the main RPG gameplay that made the series a success. The result? A much more entertaining gameplay loop. I didn't expect there'd be as many as 242 Pokémon species in this game.The visual is great too. The art style is very charming, and I'd pick jagged lines over blurry VFX every time I had the chance.","sentiment_score":0.8338880973},{"review":"this pokemon game is better then the last like 4 games (not including ultra sun and moon as that games post game and improvements made it a better game in my opinion) this game is in my opinion really fun for me this game is a 9 but for others i can see it being a 7 to 8 but if you like pokemon or want to get into it or back into it i recommend this game the graphics are bad yeah but arent even that important nor will it take from your experience of this game its really addicting and definately worth playing","sentiment_score":0.8807861832},{"review":"finally, something fresh... by gamefreak's standards, of course. i hope they can really expand on this type of gameplay in gen 9.","sentiment_score":0.8960576405},{"review":"Bad graphics but very good game. Lots of new mechanics and changes to the formular. This is the evolution Pokemon needs.EDIT: I am now finished with the game and I´m increasing the score from an 8 to a 9 because of the really awesome mounts. Swimming, climbing and flying is so much fun!","sentiment_score":0.8544865635},{"review":"This is a step to the right direction, loved this game, after burning myself out with Sword\/Shield I thought I was done with Pokemon games after ignoring BD\/SP, but this game my god I had so much fun.","sentiment_score":0.8917920516},{"review":"First of all i don't remember when was the last time I enjoyed a pokemon gsme this much. I am a hardcore pokefan. This would be a 10\/10 game if they mixed with the original formula. I miss gym battles, elite four and even trainer battles. I don't mind that it's not fully open world. That could be really overwhelming with a lot of pokemon. And for the last. Come on Gamfreak put some effort in the graphics. The animations were cool. The pokemon are cool. But the terrain is n64.","sentiment_score":0.0},{"review":"The game we wanted for so long. The plot is more mature and the world interesting. Finally a story i'm interested in. Gameplay is fun and make sense in the story. You have to complete the pokedex and revive the village for a reason that make sense in the story.Grafic is the reason my score is not 10. Still is better than what i tought but inferior compared to other switch titles. A HUGE step in the right direction for gamefreak. I can even forgive them for selling me an incomplete\/nerfed game with brilliant diamond\/shiny pearl.","sentiment_score":0.7578540069},{"review":"The game would be perfect if it wasn’t for the graphics. It’s also really slow to start. However, past those two points, they’ve completely changed the game.","sentiment_score":0.8960576405},{"review":"Honestly what a game this was. Completed the dex and everything. That last boss fight agaisnt Arceus was incredible and the final trainer battle was intense.Best pokemon game since gen 5 and it wasnt the same boring stale formula we have had for the past 20 years. Game is not empty and is full of pokemon","sentiment_score":0.8917920516},{"review":"Pokemon Legends Arceus is an interesting new take in the Pokemon series. The game is fun, and well paced. The cast of characters are strong and interesting, and the story is satisfactory. Overall, the world feels vibrant, but some parts tend to feel empty or repetitive","sentiment_score":0.0},{"review":"Excellent game just needs voice acting i coukd bever get into the older pokemon ganes because i need a game i can walk around in like this. Deffinatly reccomemded to anyone who loves to play a adventure game with rog elements and anyone who loves pokemon this is a must buy","sentiment_score":0.0},{"review":"Definitely the best Pokemon experience I've ever had. Literally the only issue I have is *minor spoilers* the ridable Ursaluna. Sonic Adventure 2 had better mechanics for treasure hunting, I literally only used it for the mission requirement and never touched it again because of how particular the controls are for it.","sentiment_score":0.0},{"review":"50 hours in, around 45 hours of fun.The game has terrible graphics, you know it, everyone knows it.But also, the sound design is lackluster.The story is as usual, you need 2 functional braincell to understand it.But people enjoys Minecraft.The game is amazing, there is so many QoLs I love, you can catch every pokemon without needing someone else to trade with you.Easily the best Pokemon game, if you are a fan you need to try it.I just wish there was more battling content.","sentiment_score":0.0},{"review":"I can say that the game has been really enjoyable so far after 12 hours in game. Not a game that is as breathtaking as Breath of the Wild, but I do think that it could be a steppingstone for the next Pokemon game which might revolutionize its series. Game Freak is on the right track. I give this a 9 for the fun I've had.By the way, the graphic is not that bad if you don't compare it to BOTW, people just had way too high expectations for it like \"I expected this to be on the BOTW level, what the hell!!!\".","sentiment_score":0.8906704489},{"review":"The most excited I’ve ever been to see and catch a Zubat in any Pokémon game. The new gameplay loop is very addicting and there’s an actual challenge in catching some of the Pokémon and staying alive. The only con I have for this game is the graphics can be buggy at times but I mean what do you expect from an oversized cell phone? Bottom line, the game is very fun and holding my interest compared to the last 3 mainline Pokémon titles.","sentiment_score":0.0},{"review":"Not a perfect game but man this is by far the best pokemon game released in over ten years","sentiment_score":0.8721168703},{"review":"I was worried about the graphics and world being lifeless and empty but there is simply too much to do and an addictive gameplay loop to either notice much or care. +Pokedex completion is varied and engaging+Completionists will be happily busy+Pokemon themselves never looked better+Music is phenomenal+Seamless transition from open world to battles+Engaging story- Graphical artifacts are genuinely distracting at times ; flickering, pop ins, and glitching grass flat out ruin some moments","sentiment_score":0.0},{"review":"I'll start with the obvious downsides. The graphics are not good, even considering it's a Switch game. It just looks unpolished and unfinished. The story is nothing special and it's about what you expect from a Pokemon game.However I enjoyed playing it. The changes to the stale formula, makes it a nice and new experience. New fighting options, no stale trainer fodder fights and it's fun being a researcher. The action sequences give a nice break from the normal, more monotone battles. I would have given it a 10 if it was more polished and had more content, but I'm satisfied for now.","sentiment_score":0.8807861832},{"review":"The best pokemon game so far. I had not enjoyed any pokemon game since 15 years ago, but this time, I really enjoy it.","sentiment_score":0.0},{"review":"The best Pokemon game I have ever played. It is all I ever wanted growing up. This game is not perfect, but it provides an excellent stepping stone for future games of this style. I hope GameFreak sticks with this style of game. At times, it was painfully obvious this was the devs first time attempting to make a game like this. However, the gameplay is absolutely addicting and the overworld Pokemon are simply too cool to pass up this game.","sentiment_score":0.0},{"review":"Such an amazing game. I hope Pokémon games continue in this direction in the future. You can get lost for hours in the world simply just wandering around and catching Pokémon. It’s the first time I am actually interested in completing the Pokédex. Graphics are the only let down in my opinion.","sentiment_score":0.0},{"review":"Best Pokémon game in a long time, cuts down on the nauseating text boxes you have to acknowledge in the previous games","sentiment_score":0.0},{"review":"If you are someone who does or ever has liked pokemon, you will like this game. If you are someone who literally only cares about graphics, you will not like this game.","sentiment_score":0.8736481278},{"review":"Not a fan of pokemon until now !!Game ís amazing ! Love IT all music, gameplay every body should enJoy ^^","sentiment_score":0.8950230508},{"review":"The first Pokemon game I've genuinely enjoyed and wanted to finish since HG\/SS! I'm a big fan of Monster Hunter, so I wonder if that's why I love the game so much. A sequel\/dlc with all new Pokemon, and some better textures would being this to a 10.","sentiment_score":0.0},{"review":"Pokemon is back and better then ever! The Gameplay is refreshing, but the story needs some work. that's really my only problem with this game. This is solid evidence that Graphics does not measure how good a game is.","sentiment_score":0.8928909009},{"review":"Really amazing game overall! Love the new mechanics and it would be amazing to see these implemented in mainline Pokémon games if not have the spin off with “Legends” and keep it going! It has to be said the graphics aren’t up to par which is a real shame and It could have really done with voice actors I feel like it’s something they need to invest in going forward… but more than makes up for them with its sheer amazing gameplay. Overall they done an amazing job.","sentiment_score":0.879423734},{"review":"Everything that i was expecting from this game was delivered and even more, is true that it still sins with questionable graphics and performance, but the gameplay is SO GOOD. the models of the monsters and the new animations are really amazing, And the story is actually really good, the last part specially.Overall an spectacular experience and the best pokemon game since fifth gen. Looking foward to see what this brings to the table of the mainline games, gen 9 could be something incredible.","sentiment_score":0.8751432066},{"review":"The most fun I had with a pokemon game since the first gen. Instead of just doing the quests Im out there grinding the pokedex for hours without being bored. The game would be a 10 but the graphics are on playstation 2 level, some pokemon in the background have like 1 fps and you can see pokemon only if you are right in front of them...but this game shows gameplay >>> graphic","sentiment_score":0.8766033718},{"review":"A new experience of Pokémon and is amazing i cant let it playing ,exelent work for nintendo.","sentiment_score":0.8821182291},{"review":"Pokémon is always amazing, but this time game freak really tried to innovate, and in my opinion it worked, the only problem with the game being the bad graphics.","sentiment_score":0.8917920516},{"review":"What can be said except good job Nintendo! This may not be the perfect game for people, but it does one nicely done job and being one of the best pokemon game in years. Listen to the positive AND negative reviews. I fully recommend.","sentiment_score":0.0},{"review":"As someone who has had minimal interest in Pokémon games up to this point, yeah, this is the real deal. It's rough around the edges, with somewhat poor graphics and minor graphical glitches, but it shines at times, too, with decent character models and pretty sunsets. The gameplay itself is compulsive, the story pleasingly dark, and the soundtrack is better than it has any right to be. I'm impressed.","sentiment_score":0.0},{"review":"I hadn't had so much fun with a pokèmon game in such a long time!!! Loved the game a lot, great and fluid gameplay. Loved all the new concepts that were included.The graphics need a lot of polish, I hope future games improve on that but keep and improve this gameplay, this is the way to go","sentiment_score":0.8980668859},{"review":"best game I have played since BOTW, the final boss was epic and I love it. -1 point because the graphics are trash","sentiment_score":0.0},{"review":"Everybody knows that this game looks like **** but man look at the gameplay it's amazing y it's really fun, great pokemon game","sentiment_score":0.8871618372},{"review":"A breath of fresh air for the franchise, and by far the best Switch pokemon game.","sentiment_score":0.8895253798},{"review":"Awesome game with brand new gameplay improvement and great sound although the graphic is still not good. Hope it will monimated for GOTY award of TGA 2022.","sentiment_score":0.8846950873},{"review":"I am addicted to this game. Pokémon has not been this good since like Gen 3. I fully recommend getting this game it is amazing! So much fun, the new mechanics are great, it’s just so much fun.","sentiment_score":0.8980668859},{"review":"Game Freak delivered everything shown in the trailer and boss battles are most fun They amazed me 4th one was a bit difficult Expect graphics everything is good And music is Very good it makes me forget about the graphics The game isn't perfect but it's good or I should say One of the best gams in Pokemon","sentiment_score":0.0},{"review":"The game can be better, the graphics are 5\/10 ok, but new mecanics and the pokedex is awesome, this the wey pkmn has to follow","sentiment_score":0.0},{"review":"Best game in years, the fact it makes some purists mad shows that this game will affect the whole franchise for years to come, and better the experience as a whole. 9\/10 due to lack of accessibility settings","sentiment_score":0.0},{"review":"Yes, the game is not perfect. The world badly needs filling up. But I sincerely hope future pkmn games keep this style of game. Revamp was sorely needed and all i would need to be happier with this game is multiplayer battles and some more interesting content to explore in the world.","sentiment_score":0.0},{"review":"Graphics are terrible, but it's a wildly fun game in spite of that. I love everything about the updated catching.","sentiment_score":0.0},{"review":"If you put aside your feelings on the obvious graphical issues it has, the game-play loop and mechanics feel legitimately great! This is GF's first go ahead at something this big and the mechanics were nailed down. Now they gotta start working on doing a modern time-line Pokemon game with gyms and frontier but with these kinds of open world environments and smooth out the graphics. I spent hours getting lost and trying to discover different areas with different Pokemon and different ways to encounter and approach them.","sentiment_score":0.0},{"review":"The games innovative gameplay loop is really engaging and the world building of Pokemon lore is exemplary. The game is ugly but still has epic scenery and feels like a huge step forward.","sentiment_score":0.0},{"review":"What a refreshing shift for such a beloved franchise. Can’t wait to see where they take this.","sentiment_score":0.0},{"review":"Dont let the dumb youtubers fool you, this game is amazing and the rough draft for all future pokemon games","sentiment_score":0.0},{"review":"Great game, very addictive and fun. Not 10 because graphics can be improved… a lot!","sentiment_score":0.0},{"review":"The game has a very good concept behind it. The core mechanics felt polished, and it seems Game Freak really did their homework. Even though technical limitations of the game coupled up with blurry and weird textures, I think the game was still very playable. I enjoyed it a lot.","sentiment_score":0.0},{"review":"There are some room for improvement in this game, but this game is made progress","sentiment_score":0.0},{"review":"It's a good start. It's a big change to the pokemon game. The system made it very exciting. It's worth playing for anyone with a nintendo switch or a pokemon fan.","sentiment_score":0.0},{"review":"I just think it's neat. Is it perfect? No, not by a long shot. However, it's (subjective) a very fun game and shouldn't necessarily be pushed aside just for its looks","sentiment_score":0.0},{"review":"It's what I imagined Pokemon to be when I was a child playing Gen3 (Emerald, FireRed\/LeafGreen). Graphics are not good but they have never been a strength of Pokemon games. Given the limited time to develop this game, Game Freak has done a good job.","sentiment_score":0.8834208767},{"review":"The best pokemon game i've ever played.That game is what pokemon franchise needed since the begining.Of course, the graphics is horrible, but game freak, i think, left the comfort area for the first time","sentiment_score":0.0},{"review":"Pokemon legends Arceus is truly an amazing game. He has some fantastic mechanics, it's the closest we ever got to the dream Pokemon game and definitely a step forward to the franchise. Obviously, It's not a perfect game, the graphics are just awful and there fps is inconsistent. But the game is fun in so many ways that the flaws are just secondary.","sentiment_score":0.0},{"review":"To be honest, this isn't the absolute best game ever. However I don't put it too far away from the best ever. It certainly shakes up core aspects of what a pokemon game can be, but even doing so you still feel it is definitely a pokemon game. If you liked the ability to catch pokemon without fighting them like in let's go pikachu and Let's go eevee, you woll love this game. I will say best game from pokemon since coming over to switch.","sentiment_score":0.0},{"review":"First Pokémon Game. Great gameplay and performance. I like the style of the graphics but the draw distance and pop-ins are bummers.","sentiment_score":0.0},{"review":"This is a pretty great game honestly. After the cute but shallow Let's Go games and the AWFUL Sword\/Shield games this is very refreshing. It has a very addicting gameplay loop, everything is fast and snappy and besides the first hour the game lets you play pretty freely. Graphical issues aside (mostly in docked mode, handheld looks pretty good) I fully recommend buying this if you're an old Pokemon fan that fell out of all with the recent games.","sentiment_score":0.0},{"review":"If you growth playing pokemon you will like it so much. Don't pay attention on the comments of the haters. Graphics are not so important here.","sentiment_score":0.0},{"review":"The game is not perfect especially in the graphics but if you do look past the graphics it is one of the best Pokémon games and probably the best game this year. Also stay mad verlisify","sentiment_score":0.0},{"review":"Good game, good mechanics, not very good graphics, but you’ll enjoy it anyway","sentiment_score":0.0},{"review":"This new concept of pokemon is wonderful. The Monster Hunter-Like style broght a new fresh Air to pokemon franchise. This game has a nice gameplay and a magnific soundtrack.I would recomend this game to every pokemo fab","sentiment_score":0.0},{"review":"Great game. Very in depth pokemon experience. Reamly makes you feel like your the pokemon master. Just the visual could use some tuning. Pls fix the water combat and pokeball animation","sentiment_score":0.0},{"review":"The best pokemon Game of history. I can't rate it with a 10\/10, because of some graphical issues that are a minor problem, but it's very clear that the game needs some updates to fix the popping.","sentiment_score":0.0},{"review":"Astounded I like this game. Pokemon died for me around black and white 2, but im just blown away by how much this surprised and impressed me.","sentiment_score":0.0},{"review":"I had to make an account just to let people know to ignore the negative reviews, those people obviously didn’t play the game and probably want some more Sword and Shield type games","sentiment_score":0.0},{"review":"Super fun makes me more hopeful for the future of pokemon, only wish they would put more time into the games and it could of easily been a 10\/10.","sentiment_score":0.0},{"review":"In my opinion this game is the best pokemon experience ever created. It has addictively fun gameplay and the crazy part is that it seems like it was made to be a test prototype. The things missing are the traditional pokemon tropes like gym battles and even random trainer battles. If those two things existed in this game it would definitely be a 10\/10. The access to being able to fully evolve your pokemon, switch out moves sets on the fly, and an easy to understand EV\/IV system should be a staple to the series moving forward. This is a new bar that the franchise will have to beat going forward.","sentiment_score":0.0},{"review":"A wonderful new direction for the regular Pokémon games, and certainly a welcome one. Yes, graphics could be better, but they do not undermine the core gameplay loop. I have not had any framerate issues either. The difficulty spikes sometimes, which was unexpected for a (current gen) Pokémon game. The story is accessible for its audience.","sentiment_score":0.0},{"review":"A new, refreshing experience for the franchise, and definitely the most fun I've had with Pokemon in years. While the technical department is certainly lacking in graphics and model optimizations, that doesn't take from the first experience of an open map Pokemon world. The characters, lore and story are solid, the level design is smart and diverse, and the combat system is fast, fun and immersive.I pray that TPC will take this as the new direction for their games, even if it has to be a secondary series of games. With more time, work and optimization, this game could've easily been a 10","sentiment_score":0.0},{"review":"I personally love the game and the premise, but the graphics tend to catch my eye most of the times when playing a video game. In this game they are not the best, the game is beautiful in its own ways, but only if you are paying attention on what is near you.","sentiment_score":0.0},{"review":"NOT Pokemon: Breath of The Wild, BUT a Breath of Fresh Air! This series was in need of a shakeup and this was exactly what it needed. Hoping Pokemon Legends will continue down this trend of experimental Pokemon games with RPG elements because this has been a blast so far. My only knock from giving it a 10 is the lack of polish in some areas, but it's easily overlooked. Excited for the future of this franchise.","sentiment_score":0.0},{"review":"Pretty good GameOnly con I see, the way you catch Pokémon in the water. Im not a man of graphics, so I didn't care about it, but I think it could be better.","sentiment_score":0.0},{"review":"This is way forward for future Pokemon games. No other Pokemon game has given me the sense of wonder and excitement that PLA has. This is the closest Pokemon has ever come to being a dream game. This is the first time I felt like I was fully immersed in a Pokemon world. There is so much attention to detail and the Battle Animations have finally got reached respectable quality. The game is rough around the edges and has the smallest lineup of Pokemon moves, but without a doubt this game should be a benchmark for all future Pokemon main series titles.","sentiment_score":0.0},{"review":"Fantastic game! Honestly the entirety of the game is probably an 8.5 if only because some mechanics are janky and the graphics could be much better, BUT I'm so happy about the direction Pokemon is going with this so I'm rounding up instead of down. Make more like this please!!!","sentiment_score":0.0},{"review":"30 hours in still in main story, fun times so far \/Story is about as enjoyable as any other pokemon game \/Gameplay feels smooth and if you think you can do something it's probably possible \/Personally I'm not the most picky on graphics, since the switch is my only console so it wasn't really a bother and I found it quite soothing to look at even for extended runs I did, but yes it is nothing remarkable or groundbreaking in that department","sentiment_score":0.0},{"review":"Story-wise, this has some of the best writing Gamefreak has done since b\/w. The characters are fleshed out without the 2000 sun and moon cutscenes every second and plays very smoothly. Gameplay is definitely a hit or miss, you'll either hate it or love it since there are very few battles and most of the gameplay is just battling. This is a solid 9\/10, please don't work on DLC for this Gamefreak and give us some nice graphics patches inside :)","sentiment_score":0.0},{"review":"Fresh new direction for Pokemon, a great base for games to come. The open world, the battle system and the boss battles felt great. It certainly lacked polish in the graphics department and it was too easy to beat; I miss the puzzles and difficulty from other games. Overall its good that Nintendo are trying new things.","sentiment_score":0.0},{"review":"Yeah graphics arent amazing but the game is and we finally have a new pokemon direction. It’s still a grinding game like all the past pokemon games so it will still feel familiar to the past games.","sentiment_score":0.0},{"review":"100% a right direction for this game series to go. The release of a remastered version of Pearl and Diamond set the stage for this game really well. The game itself is honestly addicting to say the least, and your Pokémon actually feel like you interact with them compared to other games. Hopefully they stick on this track and make more games like this, you will definitely want to try this game for yourself.","sentiment_score":0.0},{"review":"Very fun game, story was very compelling if you like the story in generation 4 games.Battling has changed a little and it makes the experience even more fun!VERY good start for the Legends spinoff series and cant wait to see more games like this from pokemon franchise! Enjoyed every single hour i put into the game.","sentiment_score":0.0},{"review":"Just an amazing blend of all the recent features that game freak had previously added, plus the open world areas feels wicked! It is just a refreshing way to play pokemon and an enjoyable game overall.","sentiment_score":0.0},{"review":"About 20 hours and still did not finished this game, its absolutely perfect, new contents, new mechanics, the map is really great despite lack of cities (only one), next generation can be still better doing the same.","sentiment_score":0.0},{"review":"Although there are a few drawbacks, such as graphic issue and main story shortage, this game shows a satisfiable appearance which Pokemon mainstream games can have afterwards.","sentiment_score":0.0},{"review":"The complaints have been made: the graphics. I don’t need to add to it. I disagree about the color palette though. I quite like the muted, watercolor feel. Besides that complaint (which does not take away from the gameplay at all, just the overall experience), the game is great. Most fun I’ve had playing a Pokémon game since the originals - I’m serious. It feels new and fresh. It’s everything I love about Pokémon with new features and mechanics. It’s wonderful.","sentiment_score":0.0},{"review":"Well worth the money!!! Best Pokemon gaming experience to date!!! I cannot wait to see what else Gamefreak and Nintendo plans to do with the Pokemon franchise as it grows from here.","sentiment_score":0.0},{"review":"The best Pokémon game that Gamefreak had ever producedWould be a 10 if there were online battles","sentiment_score":0.0},{"review":"Amazing game, very unexpected. If you don't really care about graphics and you are a Pokémon fan you need to try it","sentiment_score":0.0},{"review":"This is EASILY my favourite pokemon game ever. Open world is the perfect genre for Pokemon, and that's the way it should be always. Hopefully game freak keep up the good work!","sentiment_score":0.0},{"review":"Despite the egregious graphics and empty world the gameplay is amazing and entertaining.","sentiment_score":0.0},{"review":"Great for a Pokémon game! Much needed refresh for the franchise. Graphics could use a “few coats of paint” in the environments. Pokémon animations are solid and look good. Tons to collect and the world feels massive! Not boring if your a Pokémon fan. Game Freak really stepped up there game! (Pun intended) I would like to see all future Pokémon games, using this as a template and continuing on, what was laid here. Please Game Freak, don’t go back to the old format! Move on using what you built here!If your on the fence, just give it a shot, it’s really fun!","sentiment_score":0.0},{"review":"Best game by far about pokemon, hope one day see pokemon red\/blue on this style","sentiment_score":0.0},{"review":"Nice game with fresh new elements. The graphic could be better but the game play is lot of fun.","sentiment_score":0.0},{"review":"Great game. The wild area can be polished, but this game is certainly leading the franchise to a new and exciting direction.","sentiment_score":0.0},{"review":"Great game. A much needed change for the series. The best Pokémon game since gold and silver. They just need to improve the graphics a bit for the next version of this.","sentiment_score":0.0},{"review":"This game is full of really, really good ideas. From the open world with tons of things to do, to the new capture mechanics, to the likable characters - this doesn't feel like a Pokemon game and that's a good thing. This game is a first step in a better direction for pokemon and I really hope gamefreak builds upon these ideas and polishes the game in future pokemon games.","sentiment_score":0.0},{"review":"It's a beautiful reborn for Pokemon, every one can play and love it, a beginner or a fan ( or big fan like me ) Nice story, beautiful soundground, easy to lran how to play, for me it's a Must Have for every Switch's Player !","sentiment_score":0.0},{"review":"The game is very cool, My brother got it for me digitally and sure the tutorial is on the lengthy side but with the new mechanics its justified, the story is very cool and arceus (aka god) gives you a phone and i like how they have shiny pokemon spawn in the overworld with a sound to go with it, they even added something for the black and white fans, they added Ingo and even his subway like lines and I got a nice smile, they even added the subway theme and redid it which was a nice touch, this could be legends saving the remakes","sentiment_score":0.0},{"review":"New gameplay elements are amazing. Good story. Environments and biomes are diverse. Battles and encounters are slightly more difficult than previous games. Only major issue is graphics.","sentiment_score":0.0},{"review":"I could not bear to play a Pokémon game since X&Y.The games were just endless tutorial-hells with childish storylines that did not challenge me any form whatsoever. But this, this is finally a dream come true. Roaming through ancient \"japan\" with my Pokémons, battling through somewhat challenging fights and feeling like a trainer \/ explorer rather than a kindergardener on a killing spree is just so much fun. I love every aspect of it, even (or exactly because) if it's not fully polished.","sentiment_score":0.0},{"review":"Such a great jump into 3D gameplay. Of course it has noticiable problems related to graphics (popping is such a disaster) but in terms of joy and fun I hope this game sets the guideline for the future of Pokémon.","sentiment_score":0.0},{"review":"Finally they are making a jump out of their normal formula and it worked perfectly. The only con is the graphics but I really love the game.","sentiment_score":0.0},{"review":"A massive improvement and filled with quality of life features that make the game much quicker to pick up and enjoy.It has graphical glitches, nothing too game breaking, and while the graphics are rather passable, the gameplay and complete push for effort makes this game a very enjoyable experience. Recommend for the Pokémon fan who felt burned by Sword and Shield.","sentiment_score":0.0},{"review":"A refreshing and unique Pokémon game. Great mechanics, story and for the first time you want to complete the Pokedex. Has a certain level of complexity and would be great that they add Battles with friends.Best Pokémon game in my opinion.","sentiment_score":0.0},{"review":"Love this game! So many QoL features added. The more mature tone of the story. The tangible danger of the world. Gathering\/crafting. Very curious what this game means for the future of the franchise. I'm very hopeful though.","sentiment_score":0.0},{"review":"Most fun pokemon game i've ever played. Gameplay is amazing, adds a lot of features for different playstyles, which are enjoyable by everyone, and give more realistic feels for our creatures. Story and missions are simple but enjoyable even for adult public. Graphics should be given more effort in the future, but given the style of the art, it doesn't look too bad as one would think.Having playing around 60 hours, i highly recommend this.","sentiment_score":0.0},{"review":"Pros:Lots of Pokemon, Faster and more fun catching, more to do than just battle, open world, exploring is more engaging than in previous titles, more personalization than other gamesConts:Graphics were obviously impacted by switch hardware or game is designed poorly in terms of efficiency, they removed abilities, story is sub par","sentiment_score":0.0},{"review":"This is what long term Pokémon fans have been waiting for. To me, it’s hard to rate the game solely by its performance or quality. It’s more about the innovation and the effort, and what this will mean for the future of the franchise. The game on its own isn’t perfect, but I believe it’s everything it needed to be.","sentiment_score":0.0},{"review":"Besides graphics and slow start everything else is great! Haven't played a game without realising 5h gone by for a while now, love the game loop.","sentiment_score":0.0},{"review":"The perfect Pokémon game we know we needed, with the only downside being its graphics. Excellent QoL improvements, animations and combat system. Exploring Hisui is one of the best activities ever found in videogames","sentiment_score":0.0},{"review":"Very fun and enjoyable game.Solid game loop.My only gripe is the blackscreens when a character does something and we just see a black screen with a sound effect .","sentiment_score":0.0},{"review":"Addicting. 9\/10 because of poor graphic and missing voice acting. Dialogues are a lil bit childish but this is pokemon game soo... I thought I will be bored with all that catching stuff nad many tasks in pokedex but it's extremely addicting. The best pokemon game on switch.","sentiment_score":0.0},{"review":"Just amazing. Gamefreak has finally started to modernize the pokemon formula and it's incredible. Haven't had more fun with a game in a couple of years.","sentiment_score":0.0},{"review":"This game is not a 10, maybe not even a 9 but I feel the need to overrate it because all the hate I'm seeing. It's a great game and most important, it's a great Pokemon game which honestly I haven't seen in a long while. It's definitely worth my time and I'm enjoying every second of it. I'm even completing the Pokedex without following the main story because I don't want it to end.100% recommend","sentiment_score":0.0},{"review":"Best Pokémon I've ever played, but why is there still no audio for the cut scenes?","sentiment_score":0.0},{"review":"What a breath of fresh air for a franchise that felt like it was drowning. I hope GameFreak goes forward with a full head of steam with this new gameplay. The story itself is also a lot more competent and enjoyable than Sword & Shield’s. I really hope Gen 9 is similar to this with more emphasis on graphical fidelity and interacting with your Pokémon.","sentiment_score":0.0},{"review":"I have been playing Pokemon since the gold and silver days. Even though I have always been a hardcore fan, i was slowly losing interest in the series due to the never changing nature of the games in the past 20 years. And behold, Gamefreak finally decides to step into unknown territories. I agree, the graphics are something that definitely look like they still belong to the previous decade, but i feel that they have more than made up for it with the gameplay. I hope this sets the milestone for all future pokemon games to come.","sentiment_score":0.0},{"review":"Unique and great approach to an old classic Pokémon. There’s a nice balance between fresh and new game mechanics combined with familiar themes.Great to see that there isn’t an strong emphasis on fighting but more on catching and exploring which feels more in tune with the theme of Pokémon.A mix between breath of wild, monster hunter and Pokémon.","sentiment_score":0.0},{"review":"It wouldn't be a fair review if i just gave this game a perfect 10\/10 because it does have it's faults but in all honesty even with those faults this is still a pretty amazing game in its own right and I hope for the future of this series they keep this style of gameplay. This is the first game since BW2 where I've actually enjoyed playing it all the way through despite its issues so that's why I gave it a 9\/10.","sentiment_score":0.0},{"review":"Great game! Was really into pokemon during the Gameboy and GB advanced but grew out of the franchise until sword and shield which was ok ish but left me thinking I was done with these games. Decided to take a chance on this new one anyways and I'm having a blast and it's complete rejuvenated my interestes in the series going forward","sentiment_score":0.0},{"review":"Pokémon Legends: Arceus is about 8\/10 of the way to being a perfect Pokémon game. It's certainly not the most amazing game to look at. But the gameplay is fun enough to make up for the lack of graphical fidelity.It's a great addition to the franchise and I hope they continue to build on this concept.","sentiment_score":0.0},{"review":"Only thing keeping it from a 10 is graphics. Still do not understand how some things made into final cut (Pokemon just going up a tree randomly, the outline of your character during some backgrounds, distance renderings, etc). HOWEVER this is the most fun I have had with a pokemon game in years. BDSP shouldve been this. Great story and characters. I do not see how we go bacto tradutional pokemon games after this. Gen 9 and BW remakes have a high bar to pass. I do hope GF gets outside help with graphics.","sentiment_score":0.0},{"review":"Best Pokemon game ever made. Game does a lot of things well, however there are a few small problems, The graphics and not enough sex.","sentiment_score":0.0},{"review":"PALI_CRITIC: 92\/100List of my favourite games: #5Best Pokemon game of all time!","sentiment_score":0.8928909009},{"review":"A fun new adventure with Pokemon. Worth a play. Buttons are easy to remember.","sentiment_score":0.0},{"review":"Definitely one of my favorite Pokémon games. The new battle mechanics are a breath of fresh air and has a sense of similarity to the old battle mechanics, the world a big with lots of different Pokémon to find in certain parts of the region. The visuals are lacking, but the performance on the switch makes up for this and the story is great.","sentiment_score":0.0},{"review":"Honestly, I was really skeptical when I saw the leaks about \"catching multiple Pokémon to complete Pokédex pages\" but when I actually played the game it was very natural. I truly enjoyed playing this title like I haven't with the franchise for years. This is super fun.The graphics are still wonky but in my opinion it doesn't significantly hinder my experience and it's even meme-able at some point. It's a refreshing game!","sentiment_score":0.0},{"review":"The game is a breath of fresh air into the overdone Pokémon formula. The new way of completing the Pokédex make the process more interesting, compared to catching and forgetting about the Pokémon. The graphics are a down side and need a lot of improvement. In my opinion graphics are less important when compared to gameplay. The part I don't like is the overuse of voiceless dialogue. The story is interesting compared to previous entries but is over run with boring dialogue. Overall the game is an excellent step that Pokémon has needed for a long time.","sentiment_score":0.0},{"review":"The breath of fresh air this franchise always needed! Cannot wait to see more pokemon games using this same formula! Good job Game Freak!","sentiment_score":0.0},{"review":"definitely best pokémon game i’ve played in a loooooong time, spent 80 hours + on it to finish the game","sentiment_score":0.0},{"review":"Big fan of Pokemon since i was a kid and the games that nintendo makes is truly awesome RPG IS STYLE and I have to say I was kind of effy on this one but after playing it and finishing it up its one of many of the best. Truly everything they did right and I cannot wait to reset my character again and so it all over again 9\/10 the reason I gave it 9\/10 is because pokemon gold and silver will always be my favorite.","sentiment_score":0.0},{"review":"Breathe of fresh air. The gameplay is top notch and engaging, although there should have been a hard mode. 60fps would have made the experience way better as well","sentiment_score":0.0},{"review":"It's just so fun to run around and catch Pokémon and discover different Pokémon in different regions The macanics work great And tough the frame rate isn't always the best if a Pokémon is far away the game looks great overall (accept in some of the cut scenes)","sentiment_score":0.0},{"review":"Probably one of the most refreshing games GameFreak has done in a long time. It's indulging and the gameplay is absolutely amazing.most of the characters are very rememberable, especially the clan leaders. A lot of people complain about the graphics but to be honest the only graphics that really look bad is the environment, besides that it looks amazing! The character models are really well done and the Pokemon look very alive.","sentiment_score":0.0},{"review":"Just Amazing, loved the lore and new catch system. Graphic quality doesn't matter in a game like this and it stays at 30 fps stable.","sentiment_score":0.0},{"review":"Very addictive game I can’t stop finishing the researches of Pokémon. If you liked catching new Pokémon more than battling in the main series you will love this game. Side missions where simple sometimes that’s the only bad side of the game.","sentiment_score":0.0},{"review":"Very good game. Pokemon Legends: Arceus is like, a step forwards from Pokemon Sword and Shield. You can explore a little more freely, and the graphics look slightly better. And that step they took seems very successful for them. I haven't finished the game (like 14 hours in), but it looks very promising.","sentiment_score":0.8859417805},{"review":"Complete reinvent of the Pokémon formula, a much needed breath of fresh air. Mechanics are smooth and fun, Pokémon feel more alive than ever, but graphics are human character animations need work. Solid 8\/10.","sentiment_score":0.0},{"review":"For me, Pokemon was on a decline the last few entries.A decline not because it actually got worse, but because after all these years you'd think they could improve these games so much more.Arceus is ALMOST exactly the big improvement I was always hoping for.Only \"almost\" because on a technical standpoint this game is - as always - rather disappointing.I think we all know that gameplay is the most important thing and Arceus does deliver on that front, but I can't lie: I often wonder how much better these games could be if they wouldn't be held back by Nintendo Hardware.","sentiment_score":0.7825380796},{"review":"takes about an hour or 2 to get into, after that its very fun. i cant put the game down sometimes. probably the best pokemon game ever","sentiment_score":0.7270380228},{"review":"Nice Games i really love the New gameplay mechanics the graphics is not really good but its fine !","sentiment_score":0.7846266037},{"review":"This game is great! I had an amazing time playing the game. The mechanics kept me entertained through the whole game. While it's not perfect and needs some polish in parts I still highly recommend this game.","sentiment_score":0.723686891},{"review":"After a couple of years of frustrating choices by gamefreak. I can finally say we've got an excellent game in our hands. All though the game could have used another year of development it feels to work on it's graphics and environments (that tend to feel empty) i can say the gameplay makes well up for it.","sentiment_score":0.7804088896},{"review":"It's Pokémon meets Zelda and I'm loving this new style of \"open world\" exploration. It looks great in my opinion, plays well & is very addicting. It has it's occasional hick-ups (small bugs and glitches) but nothing that affects the core gameplay experience.","sentiment_score":0.7512014085},{"review":"I loved this game. It was very different from the original formula but it's always nice to try new ones if they do it right, and this one does. It's the first Pokémon game chronologically and the story is very nice. I also enjoyed the gameplay a lot. The formula breaks from the typical battle after battle and I personally found that really good for this spin off. I highly recommend it.","sentiment_score":0.7366251754},{"review":"Really liked the game, i vote 8 because the game takes too long to let you play it like an open world + Textures are ass. But i can say this is a really fun game, and the animations in combat are insanely good.","sentiment_score":0.790659439},{"review":"I have been really enjoying the game so far. Big minus is the graphics. They should polished game more to make look more clean and beautiful. For that reason I wouldn't mind later release date. Overall this game is really taking Pokemon games new and fresh direction, and I hope next Pokemon game is even better. And please Gamefreak, for your next time hire some voice actors!","sentiment_score":0.0},{"review":"Most fun I’ve had on a Pokemon game since I was a child gen 1-3. Yeah the graphics are a little disappointing for a 2022 game, but the gameplay is really promising, please keep going in this direction gamefreak!!","sentiment_score":0.0},{"review":"It's a pretty solid experience, it's not perfect and the gameplay is fun although a bit repetitive at times, but the atmosphere is super chill and it can be challenging when you least expect it. It's not for everyone but it actually feels like effort was put into this one. In the early game the mon variety is a little shallow but it gets much better as you go. I'd put it on the same level as Pokemon Emerald, it's not a masterpiece like HeartGold\/SoulSilver but it has charm and style.","sentiment_score":0.7335044614},{"review":"What the franchise needed! It’s so addictive. I can’t stop playing and getting all Pokémon! But.. the graphics kinda sucks for a game made by the richest brand out there. Good job game freak but UPDATE YOUR GRAPHICS! I don’t care how many ppl tell you Pokémon is not about the graphics, but when your developers are the top money makers… you have no excuses…","sentiment_score":0.0},{"review":"Very fun and I can lose myself exploring the areas. Pokemon Legends: Arceus is a refreshing take on the series and I'm excited to see where we go from here.","sentiment_score":0.0},{"review":"This game is very rough around the edges in terms of graphics. This game does not looks very bad, to be frank. But if you can look past that you’ll find this to be a really fun game and a definite step in the right direction for Pokémon.","sentiment_score":0.7565932872},{"review":"It’s a good game, is nice to see the story behind the Pokémon mythology, famous characters and a explication about some events in other games, but is not perfect, have bugs and the graphics sometimes is not so cool","sentiment_score":0.0},{"review":"The most fun pokemon experience I've ever had (or I always want). The encounter change feels fresh and fun, it's experimental and they get it so right.Yes. This game NEED polish, but it's definitely NOT a lazy game. You can easily tell that Game Freak put their love into the game but didn't have enough time to polish it.","sentiment_score":0.0},{"review":"Started playing today and so far so good. This is my first pokemon game since red. It's a huge map with hundreds of critters w\/ different behaviors. Fight or capture. This will keep me satisfied for a few hours for sure.","sentiment_score":0.0},{"review":"This is the first time since 2006 that I've really enjoyed a Pokémon game. Of course it has its negative points, the worst being the graphics and loading errors. But apart from that, the game does a lot of things right and new, and if Pokémon keeps going like this, it's on the right track for the future.","sentiment_score":0.0},{"review":"The game is not perfect but as a starting pokèmon game which tries to be more open man does its good work. Catching and exploring without limitation is fun and reading about Hisui's hidden lore has been quite fun. The problem comes when you try to explore for longer times and the graphic holds you off a little, but it is manegable. Overall good but GF should really take more time on games","sentiment_score":0.7565932872},{"review":"Good job, Game Freak! This game is what Pokémon deserves to be, the new formula that works and delivers (even with minor gameplay flaws and missed opportunities and with the graphics it has). Good customization options, nice plot, really great gameplay loop (I haven’t been this invested in a Pokémon game for the gameplay only since X\/Y). Solid 8,5 for me.","sentiment_score":0.7866756089},{"review":"This is the best Pokemon game since the N64 Stadium titles and a huge step forward for this franchise. Plenty of room for improvement such as better animations, cleaner visuals and more gameplay mechanics with less grinding would make the sequel to Legends Arceus a contender for GOTY.","sentiment_score":0.753926654},{"review":"The game is awesome, not perfect. It could be better for sure, mainly in the grafics departement. But after a 30 minutes of tutorial and some dialogue boxes the gameplay really shinies. I had the same felling of losing the notion of time playing this game as i had when playing breath of the wild and that is a good thing to be achieved.","sentiment_score":0.0},{"review":"I love this game. This is what i hope for Sword and Shield. Grafics are bad but its Pokemon so what, i mean they made over 200 Pokemon whit new attack animation.I love the exploration (could be more Details to explore), and filling my pokedex :DI think its the right way Pokemon goes. Hope for other games like this one!","sentiment_score":0.0},{"review":"As we all know is that pokemon has be at a complete standstill for the past 20 years, but now that legends arceus has come out I will admit that im pleased with the expirence and disapointed at the same time, with 20 hours under my belt i have to say, that this game is a good game. Iits not great but its not terrible but its just good. I highly reccomend not looking at the reviews because its filled with people giving the game 10s but also giving the game 2s or 0s so i reccomend just playing the game for yourself, i promise you will enjoy it.","sentiment_score":0.0},{"review":"As an turn-based rpg, you can do better on the Switch (almost the entire look and UI is lifted from Breath of the Wild.) As a Pokémon game, it completely blows the other games out of the water. The improvements to the core gameplay are so vast, it will be extremely hard to replay any of the previous entries.Unfortunately for Game Freak, this amount of innovation is setting a high bar. Things like voice acting and dialogue trees are going to be a must for sequels. You can’t get away with copy\/pasting the entire game any more.","sentiment_score":0.0},{"review":"Considering Game Freak's track record recently this is a really fun (if a bit janky) game.","sentiment_score":0.7366251754},{"review":"Almost 20 hours in and loving it! The battle mechanics are great and the fact that some wild Pokémon are out for your blood as soon as they see you is both hilarious and terrifying. The only downside for me is the graphics, the water especially. Overall, a breath of fresh air for the franchise.","sentiment_score":0.0},{"review":"It is obvious that the game is not developed enough as one would like, but in my opinion it is a very good start for a new vision of the franchise in which we can capture the Pokemon in a more realistic world, see the whole surface and also not need loading screens, I hope that from now on the next installments seek to use this formula but improve it notably, since it obviously limps a lot in the graphics and in the feeling of a living world","sentiment_score":0.0},{"review":"Visuals and graphic are really bad as always for a pokèmon game and it's right to blame gamefreak for this, the main storyline it's a bit lame but doable, once you get used to the graphic style (especially in the first zone) and to the Pokémon flying at 3 fps in the distance, you will start to get captured by the game and really enjoy the fresh innovations and the new type of gameplay.","sentiment_score":0.0},{"review":"One of the best Pokémon since the beginning. It's been a long time since I had fun capturing Pokémon and seeing new one when I'm exploring the map. Graphic wise they could have been better but since it's a first open world for them I was ok with it. Hope in the future they continue to make game like this one and they upgrade the graphic.","sentiment_score":0.0},{"review":"Huge step foreward for pokemon. The semi-open world is a huge improvement for pokemon, but graphics could be better. And the lack of trainer battles is the one point I’m critical of the game, even thought it’s explained by the story. Therefore only 8\/10Other Positive: + improved fighting systems+ elite pokemon+ crafting + no need for trading with real people to get pokemon like gengar+ pokedex system+ + a lot of potential for upcoming gamesNegative:- graphics outdated for 2022- lack of trainer battle’s","sentiment_score":0.0},{"review":"I do enjoy this game. Not as much as I would if it were a traditional pokemon game. My only gripe really is the opening; It felt like it took foreeeeeever to actually start my journey after having to shovel through dialogue and cutscenes, the tasks needed to advance. They just felt repetitive, and the world felt a bit empty. My entire time playing it, I was imagining what it would be like to do battle in a gym or wandering through kanto, hoenn, or johto regions with this new engine. I hope they think about doing such that for the next canon game.","sentiment_score":0.0},{"review":"Definitely imperfect and glitchy but lots of fun. I like that the battles are a bit more difficult. This is the direction they should have been taking for years.","sentiment_score":0.0},{"review":"Overall it's a good game. I like the new ideas like catching Pokemon without having to enter combat or quickly switching between Pokemon during a battle. I also like the open world sections and I enjoyed playing through the story. Unfortunately, the game is limited by the hardware it runs on.","sentiment_score":0.0},{"review":"Love this Game. Made an account just to give it a rating!. Just feels like it's heading in the right direction!. So many good changes that make the experience much better and new.","sentiment_score":0.0},{"review":"the game is very good, the story is not bad, there are moments in the game that are very well done but there are others that are not, for example, there are many bugs.","sentiment_score":0.0},{"review":"Roughly 15 hours in and loving the game so far. Obvious complaints are the graphics, some Pokemon don't exactly interact with anything, but that's about it. Story wise it's a tad more mature than the older titles, which is always nice. I love the catching mechanics, and the lack of a ton of trainers on every route is incredibly refreshing. All the characters are unique in their own little ways, move animations are beautiful and I love the new battle system. Honestly everyone saying this is \"the worst pokemon game ever\" need to go back 2 years and play sword and shield.","sentiment_score":0.0},{"review":"Solid game. Very addictive gameplay. Battles are so streamlined compared to Sword and Shield they take about 1\/3rd of the time to complete. This time there's actually incentive to catch them all. Graphics are a huge letdown compared to BOTW. Music is good, not as good as BDSP. Where the game shines is the gameplay. I wish the world was more open like BOTW with less hand-holding, but compared to other pokemon games that feel like they're on rails this is a breath of fresh air.","sentiment_score":0.790659439},{"review":"Finally some fresh air in the pokemon franchise.Yes the game doesnt look good, yes it contains glitches, BUT after all those years, fan prayers were heard.A (kind of) open world with roaming and living pokemon everywhere, a new way to catch them and new methods to complete your pokedex.","sentiment_score":0.0},{"review":"The graphics are just bad. But that's the only big point. The gameplay feels great and i think this is a really good step for the next Pokemon games. The best Pokemon game i played on Switch. I hope this is the new gameplay for future Pokemon games. The rewarding system is also fine and the side quest are okay. With voice actors for the main questline and better graphics it would be a 10\/10. Still a great experience.","sentiment_score":0.0},{"review":"The game play is amazing, it's finally a redesign of the original formula. The boss battles are great fun, my only complaint is the graphics are really weak. Lots of alias artifacts, and the pixels are very clear. That's more of a switch limitation, would be nice to see a pc port for a similar style game.","sentiment_score":0.0},{"review":"One of the best Pokémon games I've ever played, of course it has its flaws like graphics, pop in and empty places but it was still very enjoyable and I appreciate that The Pokémon Company took a risk and I can say it was worth it!","sentiment_score":0.0},{"review":"Great new direction for the franchise, fantastic world building and lore expansion and fresh battle mechanics all make it the best pokemon game in over a decade. Let down by the graphics and somewhat grindy aspects.","sentiment_score":0.0},{"review":"Not prefect, there's some graphical issues and lack of voice actingBut all around refreshing change for gameplay. Gamefreak made a good Pokémon game since gen 5","sentiment_score":0.0},{"review":"The game is great and game freak really did a good job trying out new things. The only thing that is miserable are the graphics.","sentiment_score":0.0},{"review":"75\/100Gameplay is barebone as everything in this game, but it's already so satisfying going around and throwing PokéBalls.","sentiment_score":0.7565932872},{"review":"This is the most untertaning Pokémon game I played for years.Yes, graphics are kinda ugly and there are some visual glitches from time to time. but that's really anecdotic when playing de game.The soundtrack is a sweet mix of nostalgia and modernity and the sound design is awesome.The gameplay is innovative and can get a little spicy, especially in postgameI would recommend this game more than any other Pokémon game.","sentiment_score":0.0},{"review":"I have not played the entirety of this game, but so far, I've really enjoyed this new Pokémon game. Sure, the graphics could be a little better, but with the open world experience and that you can catch pokemon without having to engage into battle, it's really awesome.","sentiment_score":0.0},{"review":"In summary it is a classic game of Pokèmon, I would have preferred open world than open map and graphics maybe better (here we are at the level of Unity crap). However, the leveling system is strange, throughout the story you can also go to equal level but towards the end, you are required to have a team leveled well, this I call it unbalancing and not good at all.I sincerely hope that for other games in the series, they improve starting from their negative points but knowing Gamefreak......","sentiment_score":0.0},{"review":"A great step forward for the pokemon series, however, needs work. Honestly the most fun ive had catching pokemon and running through the world. This game has revamped the combat system as well as the pokedex. i would recommend this to anyone who has played pokemon and people who have been wanting something more from the franchise. The reason i gave this game an 8 is even though the world is fun to run around in and the combat is interesting, the game does look pretty bland mostly due to graphics. This is surely a great step forward for the franchise but there is a lot of room to improve!","sentiment_score":0.0},{"review":"This game is a promising evolution for the Pokemon series and I hope the direction the series will go in. I was absolutely addicted to the gameplay loop of navigating the open area and doing the different requirements needed for each Pokedex entry. I highly recommend this game to any Pokemon fan.","sentiment_score":0.7714609334},{"review":"My God the world envrionment is ugly af! Gameplay is really good though, i would say that if you are able to look pass the story, lack of multiplayer battle system, gym battles and the horrendously bland and lifeless world of Hisui this is an alright game to pick up but with a company as big as Game Freak it feels kinda lazy and they should be doing more","sentiment_score":0.6366805307},{"review":"Completed in 20hours, was extremely boring story, no gyms or leagues. Easily exploited gameplay that allowed me to catch everything with a single ball and no aggro. Graphic so old it looks like ps2 era. No idea why people rate this higher than sword and sheild when it's half baked game. Add ability to throw a ball which is in pokemon go so it's nothing new.","sentiment_score":0.609338177},{"review":"It's good but it's lacking some heavy graphicals features that game from past 2010 have. For the price it's not an excuse the switch isn't powerfull enough anymore we are in 2022 not 2008","sentiment_score":0.5101902455},{"review":"This game had the potential to be a masterpiece. Unfortunately the lack of voice acting and polished\/improved graphics prevent it. That being said this is still a good game and worth the adventure for pokemon fans. It has me so excited for the future of what pikemon games have in store. I truly hope they will give one pokemon game the time and love it deserves to make a game as good as super mario odyssey and breath of the wild. This is the closest we have gotten to it. But there is still a long way to go.","sentiment_score":0.6728011283},{"review":"It's good, feels fresh. New catching system is great. It just feels kinda rushed thou and like it wants you to mainly be re-catching the same Pokémon all the time to fill out that Pokédex. And there is even less emphasis placed on story and battles. I don't like how there is almost no trainers battles, as having high level good Pokémon being pointless.","sentiment_score":0.49},{"review":"The new style of gameplay is fresh and exciting, however I feel disappointed by the lack of PVP, pokemon abilities, and held items. The open world aspect is fun and questing feels more like a modern RPG than pokemon. While the graphics of NPCs and the game in general are laughable, the gameplay is smooth when throwing pokeballs and using a mount to transverse the open world.","sentiment_score":0.0},{"review":"A good improvement on the Pokemon formula. The gameplay loop is awesome if you're a completionist like me. The things that are being the score down is this game is either unoptimized on the switch or the switch is not powerful enough for the game. I think a mixture of both are true. There is a lot of pop in and I have seen other games that shouldn't be able to run on the switch be able to run quite well so this is disappointing. The other thing is the small Dex size. 240 Pokemon for a franchise that is right around 100 is too small to reasonably charge 60 bucks.","sentiment_score":0.681457464},{"review":"The game is very fun and addictive but the graphics are terrible and the gameplay feels like a Pokemon GO with open area elements like Monster Hunter. It's surely an enjoyable game if you're a Pokemon fan but we deserve better and Game Freak needs to take their time and make a fantastic game that can be forever remembered, not just rush game development and put low effort so they can make money from games every year.","sentiment_score":0.6923206056},{"review":"I like the exploration Mechanic's, but sometimes the game feels too repetitive. The missions would be more epic, I keep farming and exploring all the time. The alpha battles breaks this a little, but I miss the epic battles at gyms.","sentiment_score":0.0},{"review":"This game is definitely a fresh take on a repetitive formula. The main focus of the game is on collecting pokemon, and it does that better than pretty much any other game in the series. However, it also at times feels like you are play-testing an upcoming title. For one, the graphics look like something from 20 years ago. Furthermore, the main plot could be improved by voice acting. However, many vital features like breeding or online battles are just completely missing.","sentiment_score":0.6438178484},{"review":"A huge step into being the pokemon game I've dreamt of for years, but really could've used another year of dev time to add more and to polish. More than any other pokemon game, you can feel the Pokemon Company's crushingly strict bi-yearly release schedule in this game stifle this game's potential. But in all, it's as fun as pokemon ever was ignoring that.","sentiment_score":0.0},{"review":"(7) - Good.-------------------------------------------------------------------------Yes, there are some major flaws with this game, but it is definitely a step in the right direction for Pokémon.","sentiment_score":0.6330058791},{"review":"An extremely fun and enjoyable game! This game Is a pokemon game that I have been waiting for to be made! It takes elements of other open-world games and adds It into the pokemon universe! The combat Is extremely slick and seems almost fresh but old to some gamers. The one thing I wish was built upon more, was the visuals. Although Pokemon Legends Arceus Is a very fun and entertaining game, It lacks In the visual department. But... That doesn't mean It's a good game. Overall: 7\/10","sentiment_score":0.6506855054},{"review":"New Pokémon Game!You're not buying this game because of the graphics but because you can fill the first ever Pokédex and find various types of Pokémon.","sentiment_score":0.6402838535},{"review":"Besides the hirribal graphics and some physics the game is great gameplay wise side quest are a bit repetetive","sentiment_score":0.0},{"review":"TLDR it's flawed, but a good Pokemon experience. At its core, this game is on to something, but Gamefreaks execution is pretty disappointing. I still enjoy playing Emerald and FR\/LG, I really don't need perfect graphics, but I think the graphics in this game are pretty laughable. Only to be out done but the overall world design, it feels empty, the textures are all the same.but exploring the world is fun and catching the pokemon is also fun. hopefully GF let someone else take over making these games in the future. but if you like pokemon you'll like this game","sentiment_score":0.0},{"review":"It’s a fun game but the entire battling aspect of the games is essentially put on the back burner and forgotten. Not nearly enough opportunity to use the team you assemble. Love the new mechanics and open world aspect but the graphics are rather poor","sentiment_score":0.0},{"review":"The best beta i have ever played. This is the best way to summarize this game. The world lacks depth and it feels empty. Graphics could be easily improved. The difficulty is too low even for a Pokemon game, there are no real Pokemon fights until end game. There should be an option to chose in which difficult mode you want to play. I am no longer 8 years old and I no longer want to play versus a trainer that only has 2 pokemons after playing 30 hours of game. Also too much pointless dialogues.","sentiment_score":0.0},{"review":"I really enjoy playing this game and it's cool because this is what all pokemon players ever wanted.BUT!1. Why no one have voice in this game?2. Needs more anti aliasing when playing docked3. Need more character animations for some choices in game, like pressing a stone button instead of chat selections.4. Need a better way to track side quests and track pokemon progressionSometimes I feel the dev team had some lazy decisions about some aspects of the game.But in the end it's a good refresh for the pokemon game franchise and I expect more on the next games like online coop, battle arenas and more","sentiment_score":0.0},{"review":"Finally the franchise go out of its old classic gamestyle. Compared with other JRPG nothing looks increadible but Pokemon charm is very strong.From technical point of view PLA looks like 2002 game with worst art direction.","sentiment_score":0.6330058791},{"review":"Although this game is a good one compared to bdsp, i do not understand how people can call it a 10\/10. I ve played the game around 40 hours or so and i have to say the only thing that makes this game enjoyable are the mechanics. The story is a solid 3\/10 at best, and the graphics are truly horrific. Im a fan of old games and dont care about graphics but visual bugs and disappearing assets are truly bad. Its a shame because BOTW manage to do graphics way better so its not about the switch rather than the game","sentiment_score":0.0},{"review":"Okay, first off, I hate the hand-holding at the start.This game is NOT fun, but it is pretty. It is worth the full price, as art, not a game.","sentiment_score":0.3883014231},{"review":"The new mechanics and the direction in which this installment moves the franchise are very enjoyable however the game seems unfinished, the missions are repetitive and the visual section gets in the way of the enjoyment of the game.This delivery has value and is enjoyable for the changes it introduces, but it is weighed down by the constants, sloppiness in the visual section and a development of missions \/ narratives too simplistic and repetitive","sentiment_score":0.5280670421},{"review":"Changing the review, I put a score of 3 first, because the first 5 hours with the tutorial was terrible, like everyone had like 5 years old. But after that the game improves, not technically of course because is terrible, but related to gameplay and fun is not that bad, nothing revolutionary here, maybe for the franchise yes, but not in gaming in general, nothing that a MH games did many years ago but better. If you are a fan of the franchise enjoy, but just average to me.","sentiment_score":0.4557159524},{"review":"Pokémon is slowly turning into a cheap JRPG. The graphics are shockingly bad with a very poor frame rate, the tutorial lasts for over an hour and that’s with rushing through dialogue. The game interrupts you constantly from playing to force you through bland and generic NPC cutscenes with forgettable characters that have nothing to interest to say.The world is barren and has very little atmosphere, and nothing worth exploring.People that excuse this game deserve the mess that it is.Update: If you can stick it out for a few hours more then the game lets the training wheels off you and you can start to have some fun. Still not great.","sentiment_score":0.4918999027},{"review":"This new Pokémon game has an interesting concept but the fresh air is not that well executed. Exploration is quite nice, although is not the best in open-world gameplay. Graphics, however, are bland and outdated; it looks like X\/Y on 3DS 10 years ago, which is pretty disappointing since the Let's Go games were very good-looking. Better than Sword and Shield but still low in my Pokémon list and in my Nintendo Switch list. I suggest you to buy it end of year\/start of 2023 when its in discount. Bland but still a little bit fun.","sentiment_score":0.566893385},{"review":"So, there's a lot I really like, but there might be just a tad more that I dislike. Idk if I were to give it a rating probably like a 6. Overall it's fun, but it's mechanics get a bit boring after a little and the story and graphics are worse than games from 15 years ago. The story doesn't get interesting until you're in like the last arc of the game. I love what they did with the game and, if they were to expand upon it in sequels, the legends subseries will certainly be my preferred way to play Pokemon. But as it stands idk..","sentiment_score":0.5443702034},{"review":"Nice gameplay, you can see the evolution of the series. But disgusting technical condition and art design.","sentiment_score":0.337272851},{"review":"Nice game compared to the last Pokémon Gamesa but the graphics are poor and the game has to improve a lot. This is the way","sentiment_score":0.5106152138},{"review":"This game is definitely a step in the right direction.However, GameFreak now needs to build on this foundation.We need:- More settlements & interesting locations- A better told story (with voice acting maybe?)- More interactions with the world (especially by the pokemon)Pros:- Finally a step forward for the pokemon franchise- Fun action centric boss battles- Catching pokemon feels great- Way better difficulty spike than older gamesCons:- Horribly bad storytelling- Even more handholding than in a monster hunter game- The world feels liveless and the Pokemon do not interact with it or eachother- Boring environments. There are no secrets other than the ones you have to discover for the story","sentiment_score":0.4967039381},{"review":"Its a half baked game for a price of AAA game...Feels like game from 2005. No voices just text, cant jump, cant pass terrain..Graphics is horrible, just bad textures, no effort to make some art if it cant render proper graphics. You would expect 120fps on switch with graphics as bad as this, but think its barely pushing 30.World, has lot of pokemons thrown in, but besides feels rather empty... no sense of wonder while exploring, just dull.You can read good stuff from other people. Making it going into good direction, or better then previous doesn't make it a good game.","sentiment_score":0.0},{"review":"I love the game for the first 15 hours of game play. It is really fun, and the interaction with the Pokémon are really good. But when reaching the later areas, it starts to feel a bit repetitive and empty. I understand that the world is supposed to feel empty, but this is too empty. The graphics not good. i normally would not mind, but it feels unfinished. For the hype this game got, and the fact that Pokémon is one of the biggest franchises for Nintendo, i am kind of disappointed. I had higher expectations.","sentiment_score":0.515091924},{"review":"Visuals are an improvement but still very bad for a game in 2022. Game play is fun at first but gets very repetitive catching trash pokémon over and over again","sentiment_score":0.0},{"review":"This game was a breath of fresh air that pokemon players needed as gamers and content became very repetitive, great ideas let's hope gen 9 for moving on and expanding our expectations for a good pokemon game","sentiment_score":0.4387119216},{"review":"Game was really fun at first, due to novelty. Got really boring really fast. I am struggling to stay awake most of the time. The story is very bad, don’t let others tell you otherwise, it’s backwashed horses semen. Just bottom of the gutter story. Items are annoying, item storage even more so. Only hope I have for this is that there are more than 3 zones and hopefully some free patches. If I could go back in time, I wouldn’t have bought this. This Pokémon game was my last one, I just don’t think Pokémon is for me anymore.","sentiment_score":0.3385638867},{"review":"Gets very repetitive and locks the main story behind level grinding. For a game called Pokemon legends it has very little Legendaries. The catching is super fun, but the battling is broken and not as fun as fighting people. It feels abusive to fight wild pokemon.","sentiment_score":0.2704075891},{"review":"-Graphics anren't very good. I swear there are reused assets from phantom hourglass (ds) on this game.-Sound ain't good either. Most of the music sounds like elevator music and the sound fx lack any energy.-Pacing is extremely slow. The game holds you by the hand the entire time and there is far too much text to read. It gets boring quick.-Not much variety in the world.-Not alot of depth to the combat (you aint doing much of it either)-Character desings are ok-Seeing pokemon moving around is kinda cool","sentiment_score":0.1994941857},{"review":"The graphics are objectively terribleThere's no voice or gruntingTons and tons of dialog and cutscenesIt's not really open world, more like sections of open areasThe music is uninspiredBoss fights are boringThe first 2 hours are a trudgeFeels like a fan-made gameGameplay loop is alright and the crafting is a coolIt tries to mimic the BoTW charm and falls far short in originality, gameplay, graphics, music, animation, bugginess, performance, controls etc.In all, I mean if you're a pokemon fan you're going to get this but if you are just thinking about getting into pokemon, this game will probably disappoint.","sentiment_score":0.0},{"review":"Gameplay is boring, you just throw your pokeballs to the pokemon and that's it. The bosses are just orrible, the graphics even worse","sentiment_score":0.0},{"review":"A lazy reskin of the BOTW area's with low preforming grapichs and a bland overview. I really wanted to like the game, but it's just a sloppy overall job.. They should just have taken one more year and polish the world, i am afraid this game will do what al 4 pokemon releases before have done. Get in with a great score, and then be reduced to a 5 because the nostalgia has worn off..","sentiment_score":0.0},{"review":"Non-existent plot, repetitive gameplay, 2006 graphics. The only thing to do is throw balls at the pokemon.","sentiment_score":0.0},{"review":"For a game that compares itself to Monster Hunter and Breathe of the Wild it doesn't live up to the expectations. The frame rate and graphic makes it look like a very solid ps3 game hoping it gets patches and if so my rating will go up. Honestly only a game Pokemon fans would be okay with","sentiment_score":0.3662053156},{"review":"As I predicted, same STUPID director=same stupid game. Unfortunately the fanboys will never admit it, they think they can call themselves gamers because they like pokemon lol. As predicted, I knew gamefreak was going to use the timeline as an excuse to not add gyms, trainers, championship (less directing needed.) Is not nintendo fault, is just that sadly gamefreak owns part of the pokemon franchise.","sentiment_score":0.0},{"review":"An okay game , but GameFreak could do better. The total game content is not so satisfying, it should be more from a Pokémon company.","sentiment_score":0.0},{"review":"It would be nice to put the budget to use from time to time. Actually it would be the first time ever game freak actually utilized the budget.I’m just speechless. The only way I could start to enjoy this game was to imagine myself as a kid again, being affirmative of anything pokemon related. You’d have to be practically stuck in the 2000s to appreciate this game. I just… I don’t know what to say.It’s a garbage game.","sentiment_score":0.0},{"review":"The game is fun, BUT IS F*CKING UGLY, JESUS CHRIST.I have a indiferent\/hate relationship with the progression.","sentiment_score":0.3608351443},{"review":"A solid baseline for the future, but the game lacks of some fundamentals features. The story and the graphics are really terrible, but overall the game is funny. For a future chapter, with several improvement, I could think to give a better score, but as today the game is still under the 6","sentiment_score":0.0},{"review":"Honestly, i will say no to this game. I really apreciate the \"zelda way\" attitude, but game freak need to pratice more. Graphics is not really good, and movement physics is a little inaccurate. You cannot swim a little, you cannot check your life or stamina.Positive that they try to make the boss fight more fun with another way to fight, but overall it's a mediocre game,but an improvement over the old games of the past.","sentiment_score":0.0},{"review":"Honestly overall it's not a bad game. The graphics are that of a Nintendo 64 game and I can't count how many graphical errors I've ran into. However the mechanics and new battle styles are honestly really cool and I have a lot of fun battling. Although the story seems pretty shallow and not super well thought out which is nothing new for a Pokemon game to be honest. overall I think it's definitely worth playing but not worth the $60 price tag.","sentiment_score":0.0},{"review":"A good step forward for the brand, but with a ridiculous quality. Gamefreak should leave the technical development of the game to third parties.","sentiment_score":0.0},{"review":"The game took a whole new direction in a different setting. The visuals are much improved and the gameplay is rather addictive! It truly feels like how pokemon should have always been. Exploring and seeing pokemon in the wild!","sentiment_score":0.0},{"review":"If this had good graphics it would be GOTY, it doesnt get repetitive, really nice game.","sentiment_score":0.0},{"review":"One step ahead, two behind. They could have done just a little more and this could have been the new standard for pokemon game, gameplay wise.","sentiment_score":0.0},{"review":"Good if you are a pokémon fan but if this game is made by another company nobody would play it, the gameplay is interesting but it´s the only thing, the story is poor and the tutorial never ends","sentiment_score":0.0},{"review":"While many of the latest Pokemon games will introduce a few new features or tweaks, but retain the same gameplay and story, this takes it in a whole new direction. The gameplay is wildly different and makes it feel not like a game you play but a world you are part of. Less of a step in the right direction and more of a sprint, I highly recommend this to anyone interested in the series and look forward to any future installments.","sentiment_score":0.0},{"review":"The best gane of pokemon , The shinyhunt its more easy and The open world y increíble","sentiment_score":0.0},{"review":"A (semi)open world pokemon game is the way to go. The pokemon company's lack of affection for the saga is worrying. This game needs at least one more year of development, but Pokemon only cares about the money, they know that it will sell just the same even if the game is an authentic graphic **** like this one. Also the game is very repetitive and kind of boring.","sentiment_score":0.2704075891},{"review":"Awesome new concept and I had really high hopes. The story is interesting at first but the game is so grindy and loses a lot of the pokemon charm. No cool new landscapes, bonding with pokemon, and not that many hidden secrets to discover. It’s grindy and the visuals aren’t good—all the pokemon want to run or fight. Interesting new direction but overall loses the fun.","sentiment_score":0.0},{"review":"All four of the bosses were great. The way you catch pokemon is amazing in every way. Awesome game.","sentiment_score":0.0},{"review":"After completing the game and spending about 25 hours in it, I sadly have to say it is a hard pass on a reply. I wanted to like it....I tried to like it....but the only reason I even beat it at the end was to say I did. A lot of small things overall irritated thought out my time playing this game, that will be excused cause it is not as buggie as other \"AAA\" titles. I will give it all the credit in the world for being playable, but it's sad were in a age where that is a thing.","sentiment_score":0.1482375796},{"review":"I was hoping for Pokemon to finally catch up with times but it feels like they only developed a game that should have been released 10 years ago. It even further convinced me that publishers\/developers of pokemon games only aim to milk nostalgic players and children who just started their adventure with pokemon. Minimum amount of effort for maximum amount of profits looks like has became the motto for a while now. Still, could enjoy bits and pieces but I was falling asleep most of the time.","sentiment_score":0.2598927143},{"review":"I tried to play Pokemon but I still see a lot of room for improvement.I'm looking forward to the next one.","sentiment_score":0.1011928851},{"review":"Don't buy it, if you really like pokemons and want Game Freak to do better, it's the only way we as consumers can make the difference. Don't get me wrong I'm not saying that every thing in there is terrible but we, as players, deserve better than this for 60€ (or what your currency is). If you like gameplay loop play Monster Hunter, if you like open world play Zelda, if you like pokemon battles play BDSP, what we have here is nothing to be praised.","sentiment_score":0.348817039},{"review":"Man the graphics in this game are bad. Looks like a ps2 game. The gameplay is not fun.","sentiment_score":0.2898966732},{"review":"as yall already know the graphics are really bad like a unity terrain tutorials look betterits not really open world and you know that is not the worst problemso you have like 5 smaller areas with a hub world but they somehow made this 5 smaller areas really empty and blandbattle system is boringcathing pokemon is not the worst thing ever but it gets old after a whilecouldnt get more than 13 hours in before geting really boredand if u like it thats fine but il take a break from all the crappy games that have come out the past 9 years","sentiment_score":0.2700935875},{"review":"The maps and the graphics are downright ugly and disappointing. I think the catching mechanic is a lot of fun, but after the first 10-20 hours, my enjoyment dropped off fast. The lack of trainer battles makes leveling up and raising different Pokemon virtually pointless. There are some nice quality of life improvements in this game, such as the move select and evolution menu, and the agile and strong style mechanic is interesting. But again, the lack of trainer battles makes this game have zero replay-ability after you beat the main story.","sentiment_score":0.0},{"review":"I wanted a game, not an unpaid job............... Looks average, better than sword & shield, good for kids I guess if you're desperate","sentiment_score":0.0},{"review":"The pathfinding work on the map is really painful, and I don't just focus on the graphics.come on nintendo..the world of Biomutant was more alive...","sentiment_score":0.0},{"review":"Good idea for a game but horrible execution. Game is just boring for the most part and story make no sense.","sentiment_score":0.0},{"review":"If we are honest in the graphic section it leaves a lot to be desired and is even boring and cancine at times, the Pokémon Legends arceus I understand that it seems very good because of the new fighting mechanics, however they continue to drag certain problems from the sword and shield series I do not deny that the game is fun or that we are facing a great game created by Game freak, however I could notice how this game was not made with the love and affection that accompanied the Pokémon games","sentiment_score":0.0},{"review":"Long and boring tutorial. Poor plot and characters. 2013 graphics and framerate.There is only a good thing about the game, it is a Pokemon game.","sentiment_score":0.0},{"review":"looks like most reviewers only played the game for 3-4 hours, otherwise i cant explain myself all these good ratingsgame looks like trash and after a relatively short time everything just repeats","sentiment_score":0.2344367046},{"review":"It's pretty crazy what Pokemon can get away with. They've switched up the formula which imo is definitely for the best. However, it has been done poorly. It looks like it is still in development and made by a small company with little income. The graphics look so crap. There are so few NPCs. Pokemon just sit idling as if theyre not actually part of the surrounding, but just artificially placed there. The gameplay loo","sentiment_score":0.2136203559},{"review":"The ingredients are there but combined in an incredibly lazy, low-effort way. Optimistic that they will continue to try new things, but this misses the mark ik polish, story and variation in gameplay.","sentiment_score":0.2344367046},{"review":"the score above 7 are pure fanboy, the textures are terrible, the tutorial is very long, you have to be 2 meters from a pokemon to see why, if not it doesn't load, the sound is broken, you can beat the game without fighting, except for 4 fights. you can beat pokemons that take 20 levels out of you effortlessly...the intention was good, but they have made a low budget Breath of the wild impact, sad on the part of nintendo","sentiment_score":0.0},{"review":"A game that should have looked like this at least 10 years ago. Consider how much money GameFreak is making from the franchise and end up giving the fan such a bad game. The animations have once again been taken over from the 3ds game Ultra Moon and Sword. You work through checklists and have very few trainer fights. If it was an indie game it would get a 7 out of 10 but this is one of the biggest franchises in the world!","sentiment_score":0.0},{"review":"Pros: Some music; the design of some PokemonBad: Technically unjustifiable; Pokemon are lifeless puppets wandering in an empty world, without any level design, devoid of ecosystem; unbalanced and unclear combat system; banal and redundant story.","sentiment_score":0.0},{"review":"Bare bones of a game, decent gameplay mechanics but surrounded by ugly graphics and a bland story, could be far better, and any fan that settles for this it's not helping the franchaise.Yes, praise the good things of the game, the new things that they've tried with the capture mechanics, the combat, etc, BUT PLEASE, say the truth, it's an average game at most when you see the full picture. Let's not make a battle of 0's and 10's, we can argue about giving the game from a 3 to a 5.5\/6 rating, but anything else it's just unfounded hate or fanboyism.","sentiment_score":0.200829885},{"review":"NO...no. This could not be a game from 2022. It looks like an early Gamecube game at best. Its horrible looking. Why did i buy this trash. The open world gameplay is nice and battling Pokemon is kinda fun but thats all there is thats good oh and a good size amout of pokemon. Again, this is Nintendo putting something out there where ppl playing PS4 or PS5 are rolling off there chair laughing at this game. I love Nintendo to death but this is pretty bad, Yes, its bad.","sentiment_score":0.258520979},{"review":"It would be a pretty solid Nintendo Gamecube game. As a Nintendo Switch game, it's offensive to the fans","sentiment_score":0.0205728458},{"review":"Leaving aside the pitiful graphics it looks like a game made without desire, unfortunately disappointed in what will be the first pokemon game that I will not complete.","sentiment_score":0.0},{"review":"It's a common point that people make that graphics don't matter, it's all about style and gameplay. Well in this game, you don't have visual quality, but it also looks artistically defunct. The copy-pasted houses in the small village thing, only a few trees spaced out unnaturally using the same model and size, the shiny, flat textures on the ground... And people act like moving in a somewhat open space is a huge innovation, when that has been a standard thing for more than a decade. They are on a point where they can say \"It's a pokemon game, people will buy anything as long as it's a Pokemon game\".","sentiment_score":0.0},{"review":"Quick and easy review:- The story is not bad at all.- Empty and lifeless world.- Bad physics, textures and framerate.- Rough controls.- Terrible typography.- The worst open world in an AAA.- You have to be a hardcore fan to like it.","sentiment_score":0.0},{"review":"The first 3 hours have been awesome, but the exact same procedure in ugly environments, which are repeated in the next 4 areas is the worst. The story is bad, as well as the gameplay or the animations of the figures. Actually, its pokemon stadium with better graphics. A shame for this game studio.","sentiment_score":0.0},{"review":"This game looks like a beta. It is not finished. The technical section is a disaster, it has bugs, it is very flat and the textures are not attractive at all.For all the money and support the company receives, it's a game made with very little desire. The new mechanics aren't much, and the combat lacks any appeal.We need the company to get its act together or this saga will go to waste. Very disappointed.","sentiment_score":0.0},{"review":"This game has about an hour of tutorials (if you scream through them), a ton of time of useless dialogue, and the worst offense of all - MMO mechanics. Use a move X times, catch this pokemon Y times, kill this pokemon Z times. You HAVE to do this to progress in the game. If you buy this game, understand that it's a money wasting timesink with some cool mechanics sprinkled in to remind you of what could've been.","sentiment_score":0.0},{"review":"The Noble Arcenine made me hate this game, how in the world could they even consider this being good?! How am I suppose to avoid arcenine? The space is so tiny...","sentiment_score":0.0038882896},{"review":"How do you defend a game of this quality?The Pokémon franchise is one of the most profitable and people keep justifying Game Freak for this garbage. I'm glad they brought something new, but the quality is really poor, it's about time everyone let them know.","sentiment_score":0.1270236564},{"review":"2 - 3 cool gameplay mechanics but an ugly game, 20 years late, technically infamous, an inconsistent framerate, an empty game, repetitive and boring quests, a badly written scenario and the least good music from the license. It's good to want to renew the license and congratulations for taking the risk but nothing is going well","sentiment_score":0.0840739654},{"review":"The game might be great but these graphics make me puke. Mario 64 looks more pleasing in my eyes. It's like a beta fan made game made by 1 person.","sentiment_score":0.0},{"review":"Repetitive mechanics, empty scenarios giving the feeling of a dead space, short draw distance provoking popping and poor graphics that will undermine the overall experience. I cant beleive one of the most profitable IPs ever is not able to pull off a mechanics revamp and move to 3D. Time to say goodbye to GameFreak.","sentiment_score":0.0},{"review":"Low effort slop from the highest grossing franchise in the world. Plays and looks like a unity asset flip","sentiment_score":0.0},{"review":"after a few hours the same man again and again feels like a bad mobile phone game it's not the full price","sentiment_score":0.0},{"review":"It is just a disrespect to players to deal with such an outdated graphics, if GF doesn't know how to develop a 3D game they should stick to 2D.The game itself could be a nice spin-off from the main series more focused on the grinding and \"lore\", the main problem with it is that the open-map world feels empty, you can't interact with anything but the small number of pokemon you find along the way. Overall it kills the immersion and make you feel bored pretty soon.","sentiment_score":0.0},{"review":"Lack of polish and horrible graphics don't make up for a few minor gimmicks. The game is still years behind.","sentiment_score":0.0},{"review":"The game is very ugly, even compared to other games released on the same console. The Pokemon animations and sound effects are poor. The story and battles are boring and the tutorial is too slow, it takes more than an hour to start playing. There is no musicIt looked like an alpha","sentiment_score":0.0005945571},{"review":"This might be the most visually displeasing game I have ever played, and I don't even care for graphics.The gameplay loop is also very repetitive and grindy.","sentiment_score":0.0003562248},{"review":"It has improvements compared to SwSh, but overall still a boring game. Map is very empty. Zero fun for exploring the map. This game ask you to repeatedly catch Pokémon, which is no fine and tiring.","sentiment_score":0.0372759372},{"review":"Legends Arceus is just incredibly ugly. In addition, so much is not ideally thought through and is boring and repetitive. I just don't know how an \"established\" company like GameFreak has so little attention to detail. I just miss it in too many places. No.. Without me.","sentiment_score":0.0},{"review":"This is a shell of a game. For a company that makes a billion dollars a year this is unacceptable. No online battles or PVP (in 2022!), no trainers, no gyms, no elite four, no towns (just a little uninteresting village), graphics that are very mediocre at best, mostly empty biomes which lack variety and show laziness in design, side quests that give you no incentive to play them that only reward you with little items like Potions or Candy which you can get without them, hardly any NPCs, very little music, hardly any expression in the character faces. What were they thinking?","sentiment_score":0.0},{"review":"Bad graphics, bad game play, the game is unfinished and needs so much polishing. We are talking about game freak and Pokemon, the state at which this game has been released is just unacceptable.","sentiment_score":0.0},{"review":"the actual 8.3 is too much for this, my real rate is 5.9.nice game but orrible graphic and my aspettative about the company are higher than this result","sentiment_score":0.0},{"review":"the game is made on the idea that has been made by may fans more than 10 years ago. the graphics are worse than 20yo games.","sentiment_score":0.0},{"review":"Really disappointed about gamefreak, they make bad games since years and they doesn't care. They always do the bare minimum and never listen to players.The universe has nothing natural, it's too robotic, the pokemons move erratically, they wander lifeless, no ecology, no wildlife or anything. The devs just created a map and put pokemons here and there.And I don't even speak about the graphics.","sentiment_score":0.0},{"review":"This is the best Pokemon game i have ever played.My first pokemon game was Red And Blue and see the evolution is amazing!","sentiment_score":0.0},{"review":"Sounds good. It has the worst graphical quality of the last decade, an empty world with \"new\" mechanics that add absolutely nothing. In short, the IP that generates the most money in the industry laughing in your face, once again.","sentiment_score":0.0},{"review":"People are suckered into buying an unity asset flip game marketed as AAA game.","sentiment_score":0.0},{"review":"A 6 but 0 to balance the people giving ten, Game is the best direction for pokemon i believe but need some polish work to do in the future.","sentiment_score":0.0},{"review":"Boss battles are trash and unfair. The main difficulty here is to jump around fast enough. I don‘t like such sh.. in a strategy RPG.","sentiment_score":0.0},{"review":"Game looks\/plays like **** Nintendo can do better than this. Theyre asking full price after all.","sentiment_score":0.0},{"review":"Only good thing about this game is the new mechanics for catching Pokémon. .The world is large but completely empty so there is no reward or satisfaction from exploring it. The new battle system makes any Pokémon that doesn't have a high speed stat worthless. The gameplay is extremely repetitive and tedious, requiring you to grind the same task up to 25 times","sentiment_score":0.0},{"review":"I'm disappointed. Barely any improvement from the two previous atrocities. The map is a barren wasteland. The game is infested with bugs. I'm done with this series. I just realised I've been playing this out of sheer nostalgia. I'd rather spend my money playing games where devs respect their fanbase.","sentiment_score":0.0},{"review":"They copied same house seven times for main village of the game not even changing rotation at this point single game developer can make a better game. They are just lazy and they know pokemon bias people gonna buy their game anyway.","sentiment_score":0.0},{"review":"Extremely disappointing, technically the worst I have seen in many years. Still, it will sell more than anyone else.","sentiment_score":0.0},{"review":"This game is repetitive, empty, and as innovative as replacing sliced bread with unsliced bread. Once again Pokemon fans are rewarding a low effort cash grab with heaps of money and praise. It's time for the Pokemon franchise to catch up with the generation of gaming that came before the last one, which they have still failed to do, so any hopes for the franchise to ever catch up to current gaming are nonexistent. Remember how good BOTW was? Don't forget that's a WiiU game that was ported to Switch, not an actual Switch game. SIX years later this is the garbage Pokemon comes up with? Absolutely shameful.","sentiment_score":0.0},{"review":"It's catastrophic. Graphism is ugly. The gameplay is very boring. The fights are not interesting, it's only throwing a bag of dust on the Pokemon for ten minutes. Really, it's a scam, if this game was not a pokemon game, the rating have been at 50 or less.","sentiment_score":0.0},{"review":"A low quality graphics for a 2006 game. Seems to play Metin 2. rendering problem, purple spots around the world, etc...","sentiment_score":0.0},{"review":"its bland, ugly and boring as hell. the worst pokemon game in history. it feels like a bad fangame","sentiment_score":0.0},{"review":"This Game is absolut bad. One of the worst Games i ever played. Graphics are Trash, the Gameplay is just Awful, the Story is a Joke and the Balance dosen't exists. Worst Game i ever played on the Switch. I hate everything about it.","sentiment_score":0.0},{"review":"People should really stop buying\/supporting the Pokémon game series. It's disgusting that they throw at us new games with the exact same flaws the previous ones had and the poorest imaginable quality regarding graphics, designs and story.","sentiment_score":0.0},{"review":"... What a ugly and repetitive game. Sorry ...the worst game \"open world\" with graphics from n64 or mobil game.","sentiment_score":0.0},{"review":"Spend at least a cent on development. The game is sold in huge numbers, you can afford it.","sentiment_score":0.0},{"review":"Grind, grind grind grind……Boring quests, bad Graphics, very bad animations, I hope GameFreak sees this Game as a mistake….","sentiment_score":0.0},{"review":"Its soo ugly... This game somtimes look like psx 1 game... Its 2022... This game look like 1999 game... Dont buy!","sentiment_score":0.0},{"review":"I've just finished the game. This is a mayor disaster that never could tolerate by a big company like Game Freak and Nintendo. A shame.","sentiment_score":0.0},{"review":"Game is a awful cash grab. Imagine giving a game that drops under 15 fps often a passing grade. This game is worse looking than some N64 games.","sentiment_score":0.0},{"review":"a game made without love, the gameplay is fun sometimes, technically is a shame, it is not even \"low graphics\", is a game badly done with poor technical decisions","sentiment_score":0.0},{"review":"This game has inexcusable graphics. It looks like they pulled the blocky graphics from the original Roller Coaster Tycoon game. I have seen better graphics on GameCube. It looks soooooo bad! I have concluded the devolpers have no graphical talent.","sentiment_score":0.0},{"review":"Too big for gamefreak. There are some good ideas here and there but very poorly executed. Graphics destroy and limit the whole experience.A disaster. A beta version of what it should be.","sentiment_score":0.0},{"review":"The graphics are unbelievable bad! If you're asking yourself why this game gets golden showered with 9's and 10's. It's the sign of the times. It's a sign the world is turning to ****","sentiment_score":0.0},{"review":"Between textures running at 240p, horrible white artifact pop-up whenever the game gets dark, bad draw distances and pop up, and distant pokemon often running at 2fps, this game is visually embarrassing. The battles aren't cooler or different. You can just move your character during them which is purely cosmetic. Sometimes you get 1v2 or 1v3 battles, even against trainers but you cant send out another mon and theytook out aoe attacks. This feels like a f2p mmo from the early 2000s minus all of the other people.","sentiment_score":0.0},{"review":"As a game and creation of a saga as big as Pokémon that moves millions, it is a great shame. Half done graphics. Half done animations. 3 hours of tutorial. Technical and artistic non-existent. open-world? Gamefreak has done it again and a mediocre game will once again sell a lot to a fandom without criteria.","sentiment_score":0.0},{"review":"I understand that Game Freak does not own all the money that the Pokémon trademark makes. I also understand that Nintendo does not have a say in how Game Freak make their games, but I still understand that Breath of the Wild was released four years ago and looks better than Arceus. So the Hardware isnt the Problem. The very game that Arceus is trying to copy for its mechanics and open-world is four years older and yet, somehow, looks better plays better more Story more heart more everything and 60 Bucks for this Desaster from Game Freak year after year we have to stop this.","sentiment_score":0.0},{"review":"The real problem of this game is not in the graphics (which however is a problem), but the problem lies in the very foundations of the game, passing off as primary missions of the obvious fetch quests (collectible classics in any other game) is pure shame.Absolutely absent plot, dialogues without a minimum of logic.All in all a ****","sentiment_score":0.0},{"review":"Absolutely embarrassing. Both technically and on gameplay level, there may absolutely be some player who can like it, but if this game didn't have the name \"Pokemon\" it would be blasted away with a lot of 4-5.","sentiment_score":0.0},{"review":"By far worst pokemon game i have ever played , people complained about sword and shield and now praise this ??? Completly discusting ...","sentiment_score":0.0},{"review":"I think it is safe to say that the Pokemon games Fan base has become a cult of sorts at this point.Realising a game in this state and getting praise by it is downright disgusting. Dont get scammed for this game , this is a beta test for what could be somenthing way more polished.Dont get surprised if it takes another 10 years for something actually worth while to get release ... thant you pokemon fan base.","sentiment_score":0.0},{"review":"It feels like a step in the right direction, and I appreciate the idea to change the formula up, but my god what a disaster of a rushed game. Repetetive mediorce gameplay, embarassing visuals, with no saving grace. All the positive reviews have to be paid off, no one in their right mind could possibly enjoy this game. It feels like a tech demo from 2003. It's NOT a complete game.","sentiment_score":0.0},{"review":"A very poor game. Pokemon Legends: Arceus breaks the traditional Pokemon formula that we all know and love. The game feels very empty, with almost no extra content. A big disappointment overall.","sentiment_score":0.0},{"review":"the graphics are sh1tthe rest would be good?Legends Arceus, as just a game without its franchise, would definitely be mediocre. It is a collect-a-thon with some QoL elements, a serviceable plot, subpar graphics, and a musical score which, while charming , is a bit too subtle in the overworld. The fact that it has a full game price tag would definitely turn some people away.","sentiment_score":0.0},{"review":"This is not an open-world, nor is it a new attempt. Many Pokemon fans are trying to overestimate the game, saying it has made a new attempt \"for Pokemon.\" But I can't give high scores to these games just because Pokemon comes out.","sentiment_score":0.0},{"review":"Huge Pokemon Fan here.In my opinion this game is one of the worst Pokemon games of all time.I like the fact that they finally tried out something new, but Game Freak has failed.The music is lame and boring.The graphics are from 2004 (Botw is from 2015 and looks thousand times better).The world is empty and very generic, some places are just copy-pasted.","sentiment_score":0.0},{"review":"Best Pokemon ever without any doubts.- It's beautiful graphics almost made me cry.- The \"open-world\" looks so full of life, incredible detailed, textures made with love.. Lots of Pokemon having interesting interactions between them.- Story and mechanics are the best of the franchise so far.- So many things to do. Catch the same Pokemon again, again and again. And craft.- So many love put into the animations.- Very cheap game. Only €60?- Etc.It's a must buy. No other Pokemon game achieves this perfection.","sentiment_score":0.0},{"review":"The only way you can like this game is if you have never played another open world game. There are a hundred better open world games with infinitely less budget.","sentiment_score":0.0},{"review":"I don't recommend it to anyone.All nice ideas to renew the brand, but none done well.","sentiment_score":0.0},{"review":"Tragic graphics, janky gameplay, poor story, boring repetitive quests, awful effort at a open world game","sentiment_score":0.0},{"review":"Disappointment, Brings nothing new to the open-world formula you're much better off with Breathe of the Wild shameless cash grab Gamefreak cant make a 3d pokemon game, It's extreme hand-holding, and too many filler cutscenes My nickname for it is Pokemon Fetch quest","sentiment_score":0.0},{"review":"This may be the most disappointing Pokemon game ever. The graphics suck. The entire overworld feels empty. No towns, no cities, no Gyms, no Elite 4, no Champion, no extra content like Contests, Secret Bases or anything similar, very very few trainer battles. I don't know what they were thinking.","sentiment_score":0.0},{"review":"A basic and worse copy of attack on Titan mixed with Monster Hunters.Game should be free to Play with these graphics and this story telling.It's monster hunters but it cost 60 euro, and is way less fun, worse graphics and no entertaining mechanics.Please save your money and go download a fan made version of pokemon, those actually have some story and fun to it","sentiment_score":0.0},{"review":"As long the developer doesn't suffer a huge sales failure, they will continue to develop mediocre games. Do not support Game Freak. Pokémon fans deserve more.","sentiment_score":0.0},{"review":"the same disappointment as every year, very low quality and ugly graphics, repetitive gameplay the same as always","sentiment_score":0.0},{"review":"Technically a ps2 game, also a flat world that doesn’t have a soul, Pokémon are png that walk completely random and also doesn’t interact with them. They are in strage habitats like Hauter in the snow habitat or other stupid things. Probably Game Freak should get helped because this game is completely garbage.","sentiment_score":0.0},{"review":"Despite having good ideas and being the first innovative pokemon game in the last 10 years, its graphics is the least of its problems.This game is an insult to the player, it treats u af if u had 3 years old, the dialogues are pathetic, and despite having a very simple and very easy to understand, it has more that 3h of tutorials, without letting u explore the world or do anything freely.I just hope next pokemon games will do something at least acceptable with the core ideas of this game.","sentiment_score":0.0},{"review":"Plays like a over price mobile game, not very many pokemon and less battles. Even Sword and shield is better all they did was recycle old pokemon into a game we're ur supposed to research them like there something new. The game is significantly shorter then any of the other pokemon games.","sentiment_score":0.0},{"review":"It doesn't have SQUIRTLE, how can a POKEMON game be launched without simply having the best pokemon in the game. This is disrespectful.","sentiment_score":0.0},{"review":"A 7 but 0 to balance with people giving it 10.Fun game but boring after a few hours, bad graphics and boring music","sentiment_score":0.0},{"review":"worst pokemon game ive ever played. its a catching simulator with barely any battles, **** graphics, horrible fps issues and rendering of assets in the game from barely 10 feet away from me. I've seen playstation 2 games with better graphics and hardware is not the problem, look at BotW and Xenoblade and Monster Hunter on the switch WAY better and on the same system. Lazy devs milking the pokemon name for money. They dont even have online pokemon battles or barely any battling in the game at all to be frank.","sentiment_score":0.0},{"review":"If you like catching pokemons, This os your game, but if you like fighting, just don’t buy this game.","sentiment_score":0.0},{"review":"Battles are boring and the exploration is very lackluster. Clearly Nintendo had shipped out here and it’s going to be the second version that would probably be worth playing.","sentiment_score":0.0},{"review":"Graphics are unbelievable bad and the gameplay is repedetive, you‘re just running from quest marker Top quest marker.","sentiment_score":0.0},{"review":"Terrible game. Visuals are horrible, the world is barren and dry. People only say this game is good because it’s a step forward but if game freak can’t put in the effort to make a good game there is no point buying any future Pokémon game until they do. They know that anything with Pokémon in the title will sell. Trust me I really wanted to like this game but with all these issues and bugs I cannot. To have a game released in 2022 to look worse than games released on launch with switch. I cannot support a game that looks like the world has been through 4 nuclear winters.","sentiment_score":0.0},{"review":"This game have bad graphics, bad design, boring grind fest loop. This is embarrassing for the most popular franchise in the world. What's the point in growing Pokémon if there aren't any trainers. It's a grind fest in an ugly environment. No music, voice acting or story.The best lava and water graphics ever, almost better than sea of THIEVES. GAMEFREAK MADE A MONEY GRAB.","sentiment_score":0.0},{"review":"Quite the different Pokemon game from the main line series. However, this is one of the best Pokemon gaming experiences I've ever had. 10\/10. 100% would recommend to fans of the franchise.","sentiment_score":0.0},{"review":"Final boss is too cheap, that is not fail at all. It’s not beyond type, it insulting.","sentiment_score":0.0},{"review":"Boss fights aren’t thought out properly. Too many bugs and sloppy development","sentiment_score":0.0},{"review":"not open world and kinda boring. graphics are pretty bad. the beginning of the game has a ton of dialog.","sentiment_score":0.0}]